{"id": 1244083799274766342, "screen_name": " BadCOVID19Takes", "name": "Bad COVID-19 Takes", "statuses_count": 6451, "followers_count": 125830, "tweets": ["https://t.co/ukkP4kXfgh", "@Joseph_Joe_M That was fast!", "https://t.co/yAOm81nSI6", "https://t.co/AGN4kzi4AK", "RT @BadVaccineTakes: https://t.co/VwCpimmFfk", "Lions need a new shtick. https://t.co/Tjia8Qp3XI", "An explanation for the blood drop in the screenname. https://t.co/KklALmBoVv", "RT @BadVaccineTakes: https://t.co/dtGfrq65RG", "Man tells Stew Peters he's been magnetized by being around vaccinated people. https://t.co/8yyHTszONt", "https://t.co/2v25Fp6LvQ", "I apparently won a Twitter appeal over this.\n\nTo be clear to humorless people and algorithms: being around vaccinated people does *not* cause broken bones, it's bonkers to believe otherwise, and that's my point. Refer to screenname. https://t.co/plKeRuuA2J", "https://t.co/gfXpPx3Lye", "RT @BadVaccineTakes: https://t.co/l1P1rPJxsj", "New side-effect from being around vaccinated people and 5G (“cinco”): broken bones.\n\nBut good news: the stuff she sells helps prevent such radiation damage! https://t.co/oRDqTkWxSO", "Idea for this contrast brazenly stolen from @jmhorp. https://t.co/GQJiHeUfUn", "https://t.co/QVICX5F2fu", "@BadVaccineTakes Not only the one joke, but it over-explains the joke to the point even someone who loves the one joke wouldn't find it funny.", "This account's official position is that boraxing yourself to undo your vaccination is just terrible. https://t.co/mmytfjgcki", "One of the best bad takes I've seen. https://t.co/wxe7VBunCr", "As a reminder, Wright suspects the vaccines are part of the \"antichrist agenda\" due to luciferase (which the vaccines do not contain). https://t.co/yc1mO7W98w", "“Sick due to being near vaccinated people” is a widespread belief among antivaxxers. Arguably a beneficial bad take.\n\nThis family probably shouldn't give their cats a BOO bath though. https://t.co/uCZcorts8b", "https://t.co/wAPo3eQzBN", "https://t.co/aKyT8bnpQL", "https://t.co/Vd1T5Q5Ovj", "RT @BadVaccineTakes: https://t.co/XaDLwzyjEK", "Toby Rogers is accidentally right about this. Gavin Newsom is the new Tiffany Dover, the woman that antivaxxers lied about dying. https://t.co/fID3wfUPA8 https://t.co/CSz5qZl3yo", "h/t @HardlyRealTom, also featured on a sub I never heard of before, r/confidentlyincorrect. https://t.co/LJbT7qYdnJ", "Joe Rogan explains why he “joked” that Joe Biden was not vaccinated. https://t.co/WR8fPH97vN", "Tempted to delete because of the “can't breaths” typo, but prob4bly not as ßad as wr!t!ng like a 1999 l33t ha&gt;&lt;0r. Still, sorry for that.", "For those asking what BOO baths are: BOO is an MLM product she happened to sell to some of her 51,000 followers.", "Just being around vaccinated people: can't breaths, can't walk. https://t.co/BPJSYfmZZh", "And since the theory was completely unsupported by facts to begin with, Newsom's appearance at a press conference has not deterred the theorists. https://t.co/ZXZCQayfaf", "Context: Two days ago a baseless theory that Gavin Newsom had Bells Palsy and/or GBS picked up a dumb amount a steam. The theorists didn't care that he attended a wedding last weekend or that he had posed a Halloween video. @dfreedman7 was on top of this: https://t.co/sc4kfFCKzr", "https://t.co/kh75LJ1Mfd", "https://t.co/Sm8AFw4m52", "RT @BadVaccineTakes: https://t.co/8SmJmGoZKI", "@BadVaccineTakes Sneaky good take, I wish.", "https://t.co/1my1yECgbp", "@somethinsomethi Thank you for the quick reply.", "Actually, you're called a troll. See you next Tuesday! https://t.co/F9yGADl4An", "Context: The science matters, not the politicians. Undermining confidence in the vaccines based on politics is bad, because not all citizens share your politics, but we all share the air. https://t.co/4CKGSyhoZH", "https://t.co/q7dT3x3sy2", "@HiddenPinky @TurnerJoy Still seems to be alive. I try to give the dead space.", "https://t.co/uzxpoYGPT1", "Since posting this thread, there have been fact-checks about the claim. But the sort of people who follow Dr. Gold tend to interpret fact check debunkings as confirmation that the reverse is true. https://t.co/7fBUTV9JH9", "Context: a week ago a disingenuous account linked to an Italian op-ed talking about how most Italians who died had other conditions (like respiratory failure...caused by COVID). Acct claimed Italy's ministry changed the numbers. This was a lie. 🧵 https://t.co/xbd3lhAjUl", "https://t.co/ey1hx4l7Iq", "@bbhrusty That's why I'm only 80% sure. The crazy goes back for years.\n\nMy main reason for thinking so is he's much funnier than most nuts, who post cryptically about young earth creationism or flat earth, but don't string together \"NASA, Santa Claus, the loch ness monster, or dinosaurs.\"", "Happy Troll Tuesday. I'm only 80% sure this account is trolling. The third tweet here makes me think so. There are lots of deadly serious flat earther antivaxers, but few with such comedic beats. It's ambiguous enough to me I'm relegating his tweets to Troll Tuesday. https://t.co/IG59ah2XwQ", "Hat tip: @Popehat, who apparently doesn't think Big Bird did the RICO. https://t.co/tQ09V7ptVn", "https://t.co/jACaUnFrV6", "@BadHippa As a reminder, this user is going out of her way to get everything wrong about HIPAA that could possibly be wrong. https://t.co/RlBLf4H3Yw", "h/t @BadHippa, who speaks for a lot of accounts here. https://t.co/BkMO1OaPfX", "https://t.co/7hPbvKkONv", "https://t.co/K8P5jUoUiP", "RT @BadVaccineTakes: https://t.co/gqtn7hS9Dq", "https://t.co/WdEpQiDNIE", "To be clear: masking may or may not be a good policy for schools. But whatever your views, it's not the source of teenage insecurity.", "https://t.co/b2AXVtJIOi", "Keep predicting it, maybe it'll happen. https://t.co/q5U3AEtMMB", "Context: This isn't true and doesn't even make sense internally because ivermectin is a generic drug and most doses are not manufactured by Merck at all. It's not more widely prescribed just because most doctors don't find the evidence for it compelling. https://t.co/BfwUlHsTdu", "https://t.co/unpedkGpn5", "Context: https://t.co/aOWXhRzLZZ", "https://t.co/aKrSGmCJMC", "RT @BadVaccineTakes: https://t.co/WGEop47JK5", "https://t.co/ePpSJ7KMVU", "RT @BadVaccineTakes: https://t.co/pmlBPeysFh", "h/t: @patriottakes via @Roberto_M_Ruiz.", "https://t.co/hurvGxMWLK", "It's like being a tankie, but instead of excusing leftist dictators you celebrate authoritarians with terrible Covid policy. https://t.co/9I710UueoG", "Context: Tanzania's late President outlawed reporting Covid, and so no deaths were reported—including his own (the opposition party believes the “flu” he died from was Covid).\n\nIt turns out that when you don't report on something, it doesn't disappear. https://t.co/1CzSrpXav5", "https://t.co/tABOUK0eGj", "She posted a photo of herself with “do not comply” written on her arms. Just to be clear about what she was talking about, she sent this story. https://t.co/3kTYlVkoji", "@slickpoetry @BadMedicalTakes @BadVaccineTakes I'm just saying if you like this content, maybe follow one of my favorite accounts, @BadVaccineTakes (run by a Brit with no relation to me).", "RT @BadCOVID19Takes: https://t.co/PAOKn9thXA", "@BadMedicalTakes I liked this image even more when @BadVaccineTakes tweeted it.", "https://t.co/snj5G1vlOO", "Context: The vaccines don't change your DNA and aren't made of aborted human babies. https://t.co/g5UA1ZroIp", "Aaron Rodgers explains why he didn't wear a mask at press conferences. https://t.co/bcv35Pi9JI", "https://t.co/XhsgU46YUa", "https://t.co/pSklqgmQS2", "RT @BadVaccineTakes: https://t.co/FNM3AAniob", "https://t.co/slpXpXJ47j", "A thread on the pamphlet by someone willing to read it. The pamphlet's author not only claims that viruses don't exist, but DNA does not code proteins! https://t.co/eRdFkHfZML", "https://t.co/uzFvLgVmFa", "TLDR: This is not the way. https://t.co/4ADfouPKHX", "How do we know it's completely wrong? Well, here are the total deaths in Italy compared to previous years. Over 100,000 extra people died in 2020, and they died exactly when COVID was rampant. https://t.co/t9zjsaH8s5", "Even COVID minimizer Toby Young admitted this was basically nonsense (after posting his own viral tweet spreading the lie, which he hasn't deleted or added onto). https://t.co/SnQQpJoSd6", "A columnist dusted off a report that indicated that 2.9% of people had no other conditions listed on their death certificate, so claimed that only that number \"really\" died of COVID. Well no, not when conditions include things caused by COVID. https://t.co/8tqBpaUjEK", "Context: The Italian Department of Health did not such thing, and actually called this out as a misrepresentation. https://t.co/GOnG2Or1lH", "https://t.co/G0sF3nUZVI", "https://t.co/i2hexiTrJK", "https://t.co/fRO9VCIe1U", "I don't have a pamphlet, but no this is not true. https://t.co/Q5kIeJJVH1", "https://t.co/6nneQSTWkK", "RT @BadVaccineTakes: https://t.co/iIxQ8y6mUM", "Hot new theory: being around vaccinated people turns your hands yellow. https://t.co/dX1AxaFaNt", "Context: Italy's senate voted down a hate crime bill to protect LGBTQ folks, so thousands of people in Milan grabbed their candles and rainbow flags to demonstrate.\n\nPeople indifferent to truth claimed it was vaccine protest.\nhttps://t.co/kv8r4dMjsd", "https://t.co/SFFdySd3Wv", "Three months ago, even.", "https://t.co/Nuty3HdHqF", "https://t.co/WMo8XVuV6B", "https://t.co/7kVmbr0Ebb", "Troll Tuesday continues. https://t.co/8ypjRlH1XE", "@BadVaccineTakes She believes lots of weird stuff. https://t.co/UCvyiyelba", "@SirajAHashmi @EmeraldRobinson Also, Habibi, I think \"deleted\" is giving her too much credit. https://t.co/lcmDwAOcwI", "@SirajAHashmi @EmeraldRobinson She's on a roll. https://t.co/UCvyiyelba", "https://t.co/x8YRdmL5lN", "@DRAlana4 Share 'em if you got 'em; would love to run them. I find people rarely organically thread the needle like an intentionally satirist can.", "https://t.co/cANjOPqsUK", "RT @BadVaccineTakes: https://t.co/T8KuvpUheq", "Happy Troll Tuesday, the one day I post trolling and insincere tweets.\n\nImages of this tweet have gone viral, and so people have sent me it several times. But it's a joke by a satire account. https://t.co/orjPHcgYcD", "https://t.co/MAJQ28OdcV", "RT @BadVaccineTakes: https://t.co/C9DZYYzo9N", "https://t.co/4R6RYbpf6x", "https://t.co/IA4mQ5tkyn", "https://t.co/aNANFKBerB", "https://t.co/XYYABbCbXe", "https://t.co/ixvNcvOQ73", "https://t.co/IuvJIo5iJ5", "https://t.co/fbd0gDxSqS", "https://t.co/Q1sOQeW9GQ", "@BadLegalTakes I'm in light mode because of you, and I only RT light mode tweets because I'm eccentric. Which is to say, fine if it flips one date, but @BadVaccineTakes should switch with us too.", "https://t.co/nU9SOQ5KSo", "RT @BadCOVID19Takes: https://t.co/ujRu9nPUTg", "RT @BadLegalTakes: https://t.co/ZYpbCJH518", "One year ago, October 29, 2020: The number is almost nothing. https://t.co/pHZnBuRRjA", "https://t.co/GrfSCfnEX3", "Context: \n1. The vaccines don't change your DNA.\n2. The Myriad opinion doesn't even decide whether modified DNA could be patented.\n3. The opinion definitely says nothing about forfeiting human rights. https://t.co/4dSUd0pdrb", "https://t.co/em8PrnFuQQ", "RT @BadVaccineTakes: https://t.co/Cv9u64Zyl2", "https://t.co/x3uIVqlJ5H", "https://t.co/QlrwYGjkv8", "https://t.co/xWDj91avOj", "@vitevoila @acnewsitics @BadMedicalTakes @VaxxersAnti https://t.co/8jsGYsUtcy", "https://t.co/QjvygN2YTn", "RT @BadVaccineTakes: https://t.co/eeajxgqviE", "https://t.co/uXsm3pOA3r", "Context: \"Not significantly worse\" is not the same as \"better,\" even if you start a new thinktank based on this faulty premise. https://t.co/W3vFAFvPWT", "https://t.co/XGTSdXMHZX", "I remember when we eliminated polio with vaccines instead of shitty memes.\n\nI also remember when a president treated this virus with dexamethasone, remdesivir, and monoclonal antibodies instead of soup because it's not the flu.", "https://t.co/lsA1Njy3e6", "RT @BadLegalTakes: https://t.co/Nw0LDszBHS", "If people keep asking this question, why do they drive cars with both seatbelts &amp; airbags?\n\nAnd if they understand measures can be effective but not 100% effective, why do they keep playing as intentionally-stupid Socrates?\n\nBecause clicks aren't about truth.", "https://t.co/mI6zbmsF8I", "Which is to say: This is a bad Gillian McKeith take, but also a stealthy bad @TwitterSupport take. https://t.co/4xrZis6i7L", "The vaccines don't contain them. In fact, these things are too big to fit through a syringe needle. @BadVaccineTakes (no relation) pointed this out, and Twitter issued a 12-hour suspension for their trouble. https://t.co/5hDgqNSzzi", "Context: Gillian McKeith is spreading the dumb theory that the vaccines contain creatures. Twitter has taken no action against this tweet, nor loathsome replies to it. https://t.co/y28DJYSF8X", "https://t.co/L61gpIIZ8d", "https://t.co/3sj517Dsem", "https://t.co/YZcsK4Pvoy", "RT @BadVaccineTakes: https://t.co/6aKNAMcBRd", "https://t.co/Ed7Sai8g0e", "Context: this is a 2015 video of self-assembling wires. https://t.co/1ayMvGEXc8", "https://t.co/XmvsSh4CMO", "RT @BadVaccineTakes: https://t.co/WPtuOS5MIB", "RT @BadVaccineTakes: https://t.co/cjA731C6qw", "https://t.co/rWwtBjm6os", "https://t.co/bfOZMyPHJF", "https://t.co/r3ViGtMNra", "RT @BadVaccineTakes: https://t.co/XvyTKcr2n2", "https://t.co/KRhbrSvMcg", "https://t.co/xBUmleEyDG", "Boss Baby 2 is also in on it. https://t.co/VtNhejNppM", "https://t.co/LYh9xDxfaT", "https://t.co/NUExA1enR0", "Explanation: Among other things, IG Farben manufactured chemicals to murder people at Auschwitz. This is another take calling the vaccine to genocide. https://t.co/1vQ1DWZac3", "https://t.co/DvhTVEKwzO", "https://t.co/mYvg99ajxc", "@BadVaccineTakes Well, I have a bingo.", "RT @BadVaccineTakes: https://t.co/rxqPWaH4sS", "https://t.co/sMxgt38qMe", "RT @BadVaccineTakes: https://t.co/4wlIpNYh9v", "https://t.co/M12wxuWBBo", "@HardlyRealTom Sick burn of Oxford's Faculty of English.", "Remember when feminist Naomi Wolf was against transphobia (and not advertising cards with the One [transphobic] Joke)? \n\nTime travelling nanopatticles remember. https://t.co/a67E9oPFBg", "https://t.co/X0qrgIjq9X", "https://t.co/4qV0GflWCf", "RT @BadVaccineTakes: https://t.co/HGUWpHJBNu", "*shuffles deck, pulls card*\n\nFreemasons https://t.co/B5i5kDHjoO", "Oh. Well, I assume Magic Johnson is starting for the Lakers tonight then. https://t.co/VErPRJpS4X", "Happy Troll Tuesday: I'll post a few takes that some username with a lot of digits might not sincerely believe, but they apparently did think it would stir things up. https://t.co/jlM91yBfpW", "https://t.co/Mr8PPW40Xf", "https://t.co/iORBNvS81J", "https://t.co/ABYQY2bg5R", "RT @BadVaccineTakes: https://t.co/8AhRe0l83V", "Context: It turns out that when you start from 0 and count upwards, you pass through all the numbers.\n\nOr is that what Satan wants me to think? Better check with Descartes. https://t.co/lGX57Nqray", "https://t.co/kOzH5ePnoV", "@mikerhoneTM Until IG stops letting people return the day after they're “banned.” So... https://t.co/TxIV7rt00e", "https://t.co/w8xEQcYYcp", "https://t.co/ChtS6hnC6I", "https://t.co/qD733GETZj", "@earlyamhistory Praise the Lord! https://t.co/avL7MPAiHg", "https://t.co/galVmRE3Te", "https://t.co/XL5vPM5wBM", "Context: Last year, as cases climbed, covid-minimizers claimed that there was no third wave. We were supposedly just in a \"casedemic\" caused by more testing.\n\nTurns out that tests follows symptoms and deaths follow tests. https://t.co/fJBgYRC24Y", "https://t.co/o2zs4NofKx", "https://t.co/G3mJddpLyK", "https://t.co/oJrmaaoUdA", "RT @BadVaccineTakes: https://t.co/jCXsIj3YbZ", "https://t.co/6vcvb3TSEc", "Answer: There's no reason for anyone to file for EUA because the drug was approved by the FDA decades ago. It's in pharmacies now. Doctors can prescribe it for any purpose.\n\nMost don't for Covid because the evidence for it is not convincing. https://t.co/DSVMnJy1V5", "https://t.co/GQPUFaU0IN", "@BadVaccineTakes It's actually the queen of diamonds.", "RT @BadVaccineTakes: https://t.co/tbMO7f94Un", "https://t.co/mNwLXlpHYr", "https://t.co/YOxhpquWka", "2. This isn't how emergency use authorization works. Even if ivermectin and HCQ were effective, they're not vaccines, so FDA could still grant emergency use authorization for actual vaccines.", "And this isn't a pharma plot either. Dexamethasone is standard of care medicine for COVID even though it's long off-patent; it's cheaper than ivermectin, actually. Why? Because strong evidence of efficacy exists for it. https://t.co/dn57MP5wiF", "Most normal doctors don't prescribe them, not because they're banned, but because there's not much evidence to support the drugs. Evidence is solidly against HCQ, and for ivermectin many of the studies are outright frauds.  https://t.co/UTjy4d2br3", "Several issues: 1. HCQ and ivermectin are not banned. They're FDA-approved drugs that can be prescribed for doctors for any purpose. Some doctors have apparently made a racket of writing such scripts. https://t.co/PkE6V4uhSy", "https://t.co/ehQwsCTX61", "RT @BadVaccineTakes: https://t.co/0Qkr3cJrw3", "https://t.co/gKA2NIFiGg", "It is impossible for a tweet to be too dumb to plagiarize. https://t.co/3CdraO9Mbc", "Context: Last year, as cases climbed, covid-minimizers claimed that there was no third wave. We were supposedly just in a \"casedemic\" caused by too much testing.\n\nTurns out that tests follows symptoms and deaths follow tests. The third wave was real. https://t.co/fJBgYRC24Y", "https://t.co/ihNUaYXDy4", "https://t.co/CyH3t0kuRP", "https://t.co/jwJRFNBJjn", "RT @BadVaccineTakes: https://t.co/GsLRQo7p56", "Iron Man is also part of the Covfefe conspiracy. And I guess maybe the author and artists? @mymonsterischic, @ValerioSchiti, @LukasWerneck. https://t.co/pBBUuEyQVW", "@BadVaccineTakes Sneaky good take?", "TBF, when folks take an adjective and turn it into a stand-alone noun for people, it tends to dehumanize them. Probably shouldn't say “the unvaccinated” for the same reason one wouldn't say “the disabled.”\n\nThere are even more dehumanizing adjectives used for people, though. https://t.co/ZqHl9Tai2A", "https://t.co/mBGKkswhNy", "https://t.co/Uni4dyovzm", "@kschoon4 https://t.co/r7IdAqlnaX", "https://t.co/grn6WS3CLk", "https://t.co/cV2qI1L9CY", "RT @BadVaccineTakes: https://t.co/fQMMUlgl12", "https://t.co/fItm5HWgpo", "@highlanderCF1 @stacey_rudin @Balgor11 I got this one, but thanks to you and Balgor (whose UChicago avi I always notice). https://t.co/LxGfiOoU6x", "@SirajAHashmi @kimKBaltimore TBF Biden did promise to build a time machine and help Britain in March 2020. Promises broken. https://t.co/YA3AzFnkuT", "https://t.co/FrByANwPcG", "https://t.co/b8f5rUFJ5C", "@KiraKiradancer @lavern_spicer https://t.co/loy8LplzcV", "RT @BadLegalTakes: https://t.co/qxsib90rO2", "Dirt: another thing misidentified as sinister creatures by quacks on dodgy programs. Short thread: https://t.co/dUJpJgMIgq", "Further context: The video makes the dubious extrapolation debunked here to claim that vaccines kill \"4520%\" as many people as they save. Unsatisfied and math illiterate, Naomi Wolf then amps this up to claim vaccines kill *4520* times as many. https://t.co/TC9ZwlYAxT", "https://t.co/zE3gQCrR2m", "https://t.co/4EfXI6ONtF", "@BadVaccineTakes Total mystery, that one.", "RT @BadVaccineTakes: 🤦🏻‍♀️ https://t.co/QvF1dQPz1A", "https://t.co/hybxSPPEXD", "@CameronTheile I wouldn't rank them so high for creativity. https://t.co/8jeJD5NZSo\n\nPoor judgment 10/10\nCommitment to dumb bit 10/10", "In front of the Governor's Mansion in Salt Lake City. And the guy in a Captain America t-shirt did nothing. https://t.co/RjidR9vVSv https://t.co/KVEzV1DWEs", "https://t.co/9rfECU3Yo8", "@jacksapussy @DisChimera I mean, no. Goodbye now. https://t.co/gGAokv5rPA", "Almost an accidentally good take, if antivax pilots are supposed to be selfish conmen defrauding an airline. But in Catch Me If You Can, he's not actually a pilot.\n¯\\_(ツ)_/¯", "@antiomi I don't believe he is.\n\nAnd if he is, earnest antivaxxers don't detect any satire. https://t.co/dfdFItzsQo", "https://t.co/RbOgJNYlie", "https://t.co/nZTVqn86Wg", "@krossny1 @ImNotOwned I don't like breaking the QTs. Sorry again.", "https://t.co/mQ4eBu6y80", "Context: I see this take from people who are still into magnets and graphene oxide. Stew Peters invites alt-med quacks to describe what they claim to have seen in vaccines under a microscope. Except they don't even recognize air bubbles. https://t.co/5Xwyh9hPMb", "https://t.co/s9GX3EaBgJ", "@RamaXMustGo @RealBootyEater It was, my bad.", "@smolderingavo It is. My bad.", "@BadVaccineTakes @ChelleStenn Yeah, my bad. You I guess you got both of us. https://t.co/BHpfKq5Vfn", "Sorry, this is a shitpost. Thought it was sincere because user had an Alex Jones video as pinned tweet, but was actually a video mocking Alex Jones. Bad BadCOVID19Takes.", "@BadVaccineTakes It's weird to me. You go the the \"obituary,\" and it seems to be a content farm indiscriminately scraping other sites. I've seen some really outrageous stuff about it, but hard to illustrate how offensive it is.", "https://t.co/2ZGU8cvsgT", "https://t.co/GwUwQx45KQ", "RT @BadVaccineTakes: https://t.co/U7To5VBJKa", "@RJ_NerdDad @Marco_Piani He's illustrating why West's percentage is wrong.", "https://t.co/i3JTcNgW6b", "https://t.co/97H8zGC4lW", "https://t.co/ZukHNmPNJg", "https://t.co/h6KqF0qCDm", "https://t.co/lWWtC5VaAQ", "“Covid is … a pagan religion.” https://t.co/hM8lMSde0K", "https://t.co/me8OzBlEbn", "It's not actually a \"horse drug\" either. It showed success in models in curbing a virus that both humans and horses get, but was not approved or authorized before now. https://t.co/q0TYrlwqXH", "@NaohaLanbatal @JuvenileBluster @BadLegalTakes Yes, they generally cite Myriad. https://t.co/4dSUd0pdrb", "RT @BadLegalTakes: https://t.co/OLFfz9chgb", "https://t.co/NyAZIu0qXh", "https://t.co/3w3mvg1zWO", "RT @BadVaccineTakes: https://t.co/GA43Eo4Yc0", "Context: Naomi Wolf is fond of posting (inaccurate) claims that 99.9% of people survive Covid.\n\nBased on her math, four-and-a-half people die for every one that gets a vaccine.", "https://t.co/eThgSkBZip", "https://t.co/MRQIUFPeiw", "https://t.co/j20J3j8NWq", "And by \"boo'd,\" he means that while the stadium chanted his name in a 40-0 win, a few hecklers said he should get vaccinated.\n❄️❄️❄️\nI hope Kansas City fans can rectify this on Sunday night. We should not let Buffalo have a home-field advantage for heckling antivaxxers. https://t.co/hCywNkz1PI", "https://t.co/l13ZjR34wj", "Be on the lookout for hyperbolic doomsday cultists. https://t.co/KcSyejGJtP", "https://t.co/c57uxa1gFh", "https://t.co/fws2Ftqkyh", "Link: https://t.co/cQLSdWwjGH", "@notkavi Explains the anti-Catholic stuff!", "https://t.co/MdJR1vxO8O", "I'd often marvel at how vaccine_Ls would fall for every obvious hoax and fake news about the vaccines. Months ago, I thought the account might actually be satire (which is why I didn't feature it much).\n\nMany of vaccine_Ls's tens of thousands of followers were equally dumb. https://t.co/9PRbOlcHy4", "https://t.co/ahvpKW0IYL", "RT @BadLegalTakes: https://t.co/oSNGJNPHPy", "https://t.co/ssofar3YPX", "https://t.co/UbQjDpqF2Z", "@LevityNYC @JangoBunBun @BadVaccineTakes Yes, and if they figure out you're previously suspended, they will suspend you again.\n\nIG antivaxxers freely start new accounts. Their antivax friends tell everyone \"X was suspended, follow new account!\" and by sundown they have thousands of followers again.\n\nTLDR: IG is dumb.", "@BadVaccineTakes Maybe, to DM. Tweeting from one will earn a permanent suspension.\n\nThe way v_Ls encouraged followers to follow the backup makes it seem like they believed Twitter works the dumb way IG does, where banned accounts can immediately restart/continue on a transparently identical acct.", "https://t.co/C8UYLxyib2", "@BadVaccineTakes They must be from IG if they think the “backup” trick works. Say what you will about Twitter: they suspend people.", "https://t.co/nKsnjqcoLI", "https://t.co/H71rebsTY7", "RT @BadVaccineTakes: https://t.co/vKn4zX0MGG", "https://t.co/XLKEGfYcOM", "https://t.co/dnBAejDD8O", "TBH, I just liked this one for the UBI references. It's as if:\n\nDec. 2021 - cases rise, lockdowns in some places\nFeb. 2022 - new variant\nApr. 2022 - carbon tax\nMay 2022 - super lockdown!\nJul. 2022 - bread lines\nAug. 2022 - carbon tax raised 5%\nOct. 2022 - martial law", "https://t.co/f1enNae86E", "https://t.co/SZcgY383NF", "There have been over 780,000 excess deaths, which is higher than the number of official Covid deaths. Some of these unexplained excess deaths were likely uncounted Covid, given how they occurred early in the pandemic.\n\nBottom line: it's not the flu, and ~700,000 died in the US. https://t.co/H2oYZFIEtN", "One could argue \"only 90% died,\" but this isn't right either. Early in the pandemic there was not much testing (as there is not in poor countries). This leads to an *undercount* of Covid deaths. https://t.co/9RZmOc7rFK", "In a few cases Covid is not the primary contributing cause of death, but these are unusual. In 90% of the cases, based on CDC's review of death certificates, Covid was the underlying (primary) cause of death. https://t.co/hBa89tQn0v", "Second, we have the idea that people aren't really dying of Covid, but of other things, and just happened to test positive. But when you look at raw total deaths, the virus's handiwork is clear. https://t.co/LoVo79nAMi", "Context: This combines a couple of ancient bad take, but they persist.\n\nFirst, this is obviously not the flu. Deaths easily exceed ten years of flu deaths. And the flu deaths are end-of-season estimates, unlike tested COVID deaths. https://t.co/Zz9r3a5Oqq", "Context: This estimate for Covid IFR was never well-grounded, and was particularly indefensible by last October. https://t.co/SF2T1cClvs", "https://t.co/e3JUFW2xGy", "@Ceacm23 Over 200,000 people a day are getting their first dose. That's four stadiums worth of people to boo Cole. People can be persuaded; many (maybe most) of the unvaccinated are not hardcore antivaxxers.", "https://t.co/peAcUw60kx", "https://t.co/ndfxt0qi2t", "Context: This is a Covid minimizer! The “mass delusion,” to her,  includes vaccines, masks, etc.\n\nFolks decry Covid misinformation from Facebook. Turns out that Covid minimizers believe no less fervently that social media is the only thing that supports Covid mitigation.", "https://t.co/c094KyhUdr", "Answering for @mcuban: that's not why more should get vaccinated.\n\nVaccines reduce but do not eliminate the chance that someone catches and spreads disease. This is why they're given universally. They reduce more disease when more people have had them. https://t.co/4bV8qYETrd", "https://t.co/vMjV4z2qbm", "To answer Dr. Wolf (D.Phil. English literature), it's a \"pandemic of unvaccinated\" because the unvaccinated disproportionately get it and die from it. https://t.co/LCa4efryLD", "https://t.co/7N21meyCjc", "https://t.co/fYkW9ge35I", "Explanation: Author uses l33t spelling to avoid being flagged by Instagram. Believes that the virus doesn't exist, but the spike protein does. Believes the gain of function talk is a ruse or \"patsy\" for the \"real bioweapon\"—the spike protein.", "https://t.co/fRi7aaGu0k", "RT @BadVaccineTakes: https://t.co/QEpvmeiwjx", "Link to this \"how it's going\" story: https://t.co/FuS3rW3PGx", "https://t.co/4Ny8KQmjrx", "https://t.co/JNdrL4oSmR", "https://t.co/ai5Mj76yde", "RT @BadVaccineTakes: https://t.co/e3FFENt4zj", "https://t.co/B6816X2fkn", "Oh my God. Do not underestimate how poorly antivaxxers interpret the world. This message was cute, but went clear over their heads. https://t.co/pxl7GY4KP8", "RT @BadVaccineTakes: https://t.co/VVFcLNIZ2u", "https://t.co/dpN5XlZ5Yh", "@BadVaccineTakes Context: https://t.co/KYfPvfmUm1", "RT @BadVaccineTakes: https://t.co/esNHjgux52", "@doritmi @BadVaccineTakes I'm continually surprised no one seems to consider implications of the term. https://t.co/7lhCXg5Cy6", "https://t.co/1VCH8E1KXP", "https://t.co/BWv1ef4gCp", "https://t.co/djJnOpVDiG", "https://t.co/rWqBipwvJw", "https://t.co/UB2FHGVvSD", "Context: A single functional group (to non-chemists: a line with maybe some letters attached to it) can make a compound act vastly different within organisms. These compounds aren't even structurally similar. https://t.co/LW0Wlavt4l", "https://t.co/bHLNIIwrBf", "https://t.co/Zi4B6LsBWf", "https://t.co/lTFZD80elg", "RT @BadVaccineTakes: https://t.co/hxe9LV5iqK", "RT @BadLegalTakes: https://t.co/ovvm1HEaJN", "https://t.co/Hp6eLOneXx", "https://t.co/Zi5W8PhexA", "https://t.co/8Zi4BjXZsq", "@andrew_croxford @BadVaccineTakes I certainly hope it's not.\n\nIf it is, it's much too dark for me. https://t.co/2mN2zcjI1j", "@BadVaccineTakes Imagine thinking “purebloods” are the good guys.", "https://t.co/vSe0fkIWLj", "https://t.co/qRtwDZYGY2", "https://t.co/t5KdYdzkIN", "https://t.co/gI9sC4xmVe", "@SirajAHashmi I need to take your phone, Siraj.", "If this seems familiar, it's probably because this stupid image has been circulating since spring 2020, along with similar lists people posted in the early days. Even if you think Covid is overblown, it clearly hasn't aged well. https://t.co/EBgyGpaHl5", "https://t.co/bwHs21ykyW", "RT @BadVaccineTakes: https://t.co/Ufq1or2J18", "https://t.co/HGdihF5gUs", "Interestingly, patients can't readily get variant results for themselves because sequencing tests aren't approved. It doesn't mean variants don't exist, just that they move faster than bureaucracy.  https://t.co/q8qNgjSX8i https://t.co/tlOlCg8uGU", "https://t.co/8EdOPM65Sz", "Can't agree on which way the semantic argument flows. https://t.co/EvE3dHok8h", "Turns out that folks can lie about videos and rely on ignorance and vaguely racist preconceptions to make them go viral.\n\nLook at these noble Cannuck people in their traditional garb protesting vaccine mandates. https://t.co/Q90KySBgyW", "Context: This is the original video (not actually the official account of the new Zulu king, whose parents died of Covid). It doesn't even look like a protest. https://t.co/1RDHi6hfqw", "https://t.co/7E3gi2mBFy", "@BadVaccineTakes I'll totally be owned.", "Context: This one circulated over a year ago, but dumb memes never die. The \"virus\" is a pasta advertisement. https://t.co/msjIMpPQqy", "https://t.co/NYEj7qW9kr", "If I wasn't clear, *some antivaxxers* believe this. #Notallantivaxxers believe *every* bonkers antivax theory. In case anyone else was confused on this point. https://t.co/BGNZNoSv3w", "@BadHippa When the vaccinated and anti-vaccinated collide, they explode in pure EMF radiation. Has something to do with graphene oxide. Saw it on YouTube.", "RT @BadHippa: https://t.co/gAYl2jsU0D", "@reallawdawg @laurenboebert @dumbtakess https://t.co/DVMxFDsJJj", "https://t.co/pwMaCyLu54", "RT @BadVaccineTakes: https://t.co/sz4wK8kQ2R", "@BadVaccineTakes He seems nice", "https://t.co/8hAEo5wyAL", "https://t.co/o73HTWZbPh", "As a bunch of folks pointed out, this is bait. I try to post genuine takes, not jokes, but I wasn't paying enough attention last night. Full refunds for everyone.", "https://t.co/LX4QuaGr9J", "https://t.co/7IhanIDzAC", "https://t.co/4FgNG7SV0v", "https://t.co/9cNZ8o3KoV", "RT @BadVaccineTakes: https://t.co/FRKMbYKdNw", "RT @BadLegalTakes: https://t.co/kXUzpHz7Nt", "@Dr_Straker Dammit.", "https://t.co/vq37DU7Gze", "https://t.co/6KayUnPsKg", "@IvorMectin1 @BadVaccineTakes The last line really sells it. 👨‍🍳🤌", "Context: Vermont still has the lowest hospitalization rate in the country, and 87% of those hospitalizations are unvaccinated. Vermont is nearing its winter peak only because that peak was low.\n\nh/t and further context in this thread: https://t.co/uwInOeus75", "@HiddenPinky @gobeavs90 Yeah, he QT'd me.", "https://t.co/rGbbbxOYom", "Context: There is a test. Testing for variants requires genetically sequencing the virus. A fraction of positive samples are sequenced in this way in order to provide surveillance on community spread. https://t.co/yhMfuwSCv1", "It's not the only theologically puzzling thing he said. https://t.co/XTRDc5ze8J\n\nh/t: @patriottakes via @claycompton", "@badvaers Kinda. A poster promoting the event. https://t.co/RqEsnIAdrP", "Pastor Leon Benjamin: \"The virus came from Satan. And if Satan is weak, the virus is weak.\" https://t.co/Zt2nMaVn5Q", "https://t.co/fdDhTQPpxx", "Explanation: Antivaxxers insist that the vaccines kill people. But most people have had one and are fine. In fact, deaths plummeted when they were rolled out. How to reconcile? Antivaxxers theorize most got placebos, to lull people into getting the next, deadly, booster. https://t.co/EiZR8ejlwY", "https://t.co/KhYt1UIfzl", "https://t.co/mZO23iadk3", "@angelaisms I'm so sorry, @EmilyMcgowin.", "@BadVaccineTakes So is she going to change the name of the account to antivaxxers posting their Ls?", "https://t.co/FGb1fguC5Y", "https://t.co/vpYbyCmCP2", "https://t.co/K5g9uvtLF5", "RT @BadVaccineTakes: https://t.co/gscWZZOagO", "https://t.co/gkJ0CO01Q3", "https://t.co/P0eRi6iqYM", "https://t.co/eOVIK6dFWB", "@BadVaccineTakes The other 25 million Angelas are more reasonable.", "I thought for sure that this was a joke, so I was not going to post it. But after looking through his tweets, find it slightly more likely he was not joking.\n\nAnd if he was, here's a solid bad take for you. https://t.co/dBl0DTuOuO", "https://t.co/rDUoHAmlZX", "She created a new account the next day; back up to 18k followers.\n\nCurrent theory: “they” created an Earthquake in Victoria to disrupt antivax protests. https://t.co/Pan54mMOgf", "h/t: @EoinHiggins_'s piece. https://t.co/oMKLEJ4Aaq", "https://t.co/881GBMSicq", "Antivax mom: We have prevention and cure at home.\n//\nThe prevention and cure at home: https://t.co/nhOhAwN0ot", "https://t.co/H0Is6eHGZa", "@iconjack https://t.co/KVm0vDNA2v", "Context: It wasn't painted in 1994. It's not a mural in the Denver airport. It was created by Filipino artist CJ Trinidad last year.\n\nThis is a screenshot of a tweet posted and debunked over a year ago. Misinformation never dies. It just gets blurrier. https://t.co/d6pXc9djVP", "https://t.co/tnAVqDsMnZ", "@dfreedman7 Mad Vax", "RT @BadVaccineTakes: https://t.co/J8s5xt4Qi5", "TIL: https://t.co/cGbiAKHMxF", "https://t.co/MtRFFJSbUC", "@hospitalnumber @BadVaccineTakes Every few weeks Bill Mitchell claimed to be shadow banned. “If you can see this, retweet!” Always worked.", "https://t.co/vufrC0aNbl", "Context: It turns out that people die *after* getting infected, even when Joel Smalley (then with a few hundred followers) chimes in to incorrectly say they're virtually all false positives. https://t.co/OqkYr1n4iY", "To translate her Instagram AI-evading l337 speak: she believe the vaccines contain graphene oxide that causes people to re-transmit radiation from 5G (which she calls “cinco”), and also shed viral spike proteins, for belt-and-suspenders, I guess. Chemtrails too.\n\n45k followers. https://t.co/AsZCy5lWIQ", "https://t.co/acAEZWG1r8", "https://t.co/Qfnsz43R8d", "https://t.co/ug6fY7k8sJ", "h/t: @NikkiMcR https://t.co/S2WtccDt78", "https://t.co/giEFI3JH7K", "https://t.co/Lp3zw0rkAH", "https://t.co/MRnrroCqaC", "Context: 1. The vaccines are available to everyone.\n\n2. Anyway, Boris doesn't control US immigration rules anyway; the United States does and demanded it.\n\n3. Racial justice champions don't usually refer to \"you blacks.\"\n\nh/t @BadVaccineTakes", "https://t.co/pjlJBTyVVe", "https://t.co/WTZHrvPyKO", "https://t.co/zdrX4qonV4", "https://t.co/IsMLekXliM", "@RealChrisKocher Satanists are about 15 feet high tho.", "https://t.co/RaVr6J8UAx", "https://t.co/ANf4i3Ky0W", "RT @BadVaccineTakes: https://t.co/19XWHXpzPJ", "Context: OP theorizes that WHO is Satanic because they have snakes in their logo. https://t.co/dPtO0gvCzH", "https://t.co/n9WHx3wno1", "https://t.co/P9omImRIKZ", "RT @BadVaccineTakes: https://t.co/toxxgUFwNg", "Note: I don't like posting people who had a bad take about Covid then died from it, or had serious illness and then saw the light.\n\nLoomer is not in one of those categories though. Her very next message told her followers it would have been even worse with the vaccine. https://t.co/2llERbZ948", "https://t.co/8kd3EP7KcH", "https://t.co/vvc3hjOvbj", "https://t.co/rqnRZyikqD", "RT @BadVaccineTakes: https://t.co/FtR1vWRbTr", "@BadVaccineTakes https://t.co/Ld1UNQWxMX", "I'm sure everyone has seen the update to this: https://t.co/6gNMpkvxWo", "https://t.co/CkXVnVoqcW", "The meme probably came via DC_Draino, banned on Twitter, but with 2.1 million followers on Instagram. He sent this story last week. https://t.co/qULAlpDVIY", "https://t.co/wT8KJkSFmf", "@HiddenPinky Yeah, I'm not happy about it, but I tend to post things on anniversaries, and one year ago now was probably the nadir in terms of a few liberals undermining confidence in the FDA.", "@f_fz @scottmccloud https://t.co/6gNMpkN9kY", "https://t.co/ZYNyxyS76T", "https://t.co/917fQozY35", "@utterlybasil @Bowen_Thaylin She posted this the day after the second image above, so no. https://t.co/KRSWDeOgi2", "https://t.co/wgxmdXkOZt", "https://t.co/gYA9iKI3zW", "https://t.co/uNNmmrmpmO", "Context: It's not cool to spread dangerous FUD for political reasons. And I don't give it a pass just because folks on the right proved to be much worse antivaxxers.\n\nThe vaccine was on track in September. https://t.co/7SBD783HAd", "Context: It's not cool to spread dangerous FUD for political reasons. And I don't give it a pass just because folks on the right proved to be much worse antivaxxers.\n\nThe vaccine was on track in September. https://t.co/7SBD77MEyd", "https://t.co/G43nbaAMdQ", "Source: @jasonkenney: https://t.co/7wN30PMPAK", "Source: @jasonkenney: https://t.co/7wN30Q4YOS", "https://t.co/dsbSTMw1rw", "https://t.co/4dxqFfnWuL", "https://t.co/GX4rNvf8AP", "https://t.co/2qSylZ5zv9", "https://t.co/RNr3jmUviC", "https://t.co/i6hAper2Cn", "https://t.co/j909HfsrGm", "https://t.co/GWxUb38RLI", "https://t.co/zzX9It51Lf", "https://t.co/r3qB954s4B", "https://t.co/Rfqm8rM2a2", "https://t.co/rebxuFlgZl", "https://t.co/QJZhrRxQ5k", "https://t.co/vzEQRifEiX", "If true, this is insane! https://t.co/JRQH2Ckxrs", "https://t.co/NXNsnwNYMI", "https://t.co/He8blb0Qx1", "A lot of Instagram/TikTok antivax commentary is about how they're named after brainwaves and military threat levels. https://t.co/7kkrhsunqg", "RT @BadVaccineTakes: https://t.co/pjmtwMnSGd", "https://t.co/VnjX2zQ6Y5", "https://t.co/WlgeowaYEL", "https://t.co/GrGkswJx7G", "https://t.co/5z96uORMOB", "Update: she posted a bunch of 9/11 truther stuff on Saturday, and on Sunday was banned by Instagram. Again. https://t.co/OpdI3lHloG", "Context: an Iowa Congresswoman tweeted a satirical article. In a statement, she claims that her own tweet was also satire. If true, this is insane! https://t.co/EeRbfhhV6E", "https://t.co/taViVYEP9J", "https://t.co/g1yP1pM8Zw", "https://t.co/TQn1wgMujZ", "Via @JanNWolfe. https://t.co/maHHqOcLXf", "https://t.co/F9kd2USPMW", "RT @BadVaccineTakes: Full-time… 😳 https://t.co/0JJ2Ob6AtR", "https://t.co/JoBChc2tnk", "Context: People previously infected with the virus are unlikely to get it again. Massie references this concept of \"natural immunity.\"\n\nBut it turns out that acquiring \"natural immunity\" to Covid by *getting Covid* isn't a good prevention strategy. https://t.co/jLXDZ0Bobb", "@dougbridgesesq @needajobbad @schneeriplaw @BadLegalTakes I was a patent litigator. Yes, that's what priority date means. This was a continuation-in-part, which means it claims priority to the family of applications dating to 2015, but also adds new material as of the date of the application, which was May 17, 2020.", "https://t.co/4so4yXZhGg", "https://t.co/F4JQAuUCu4", "@BadHippa @MollyJongFast Amazing.", "RT @BadVaccineTakes: https://t.co/I6yTu6JttB", "@JuvenileBluster The classic. My favorite part was about how the pressurized cabin compresses your organs.", "https://t.co/4B9mhdldkf", "https://t.co/cGaVoRoYQw", "RT @BadVaccineTakes: https://t.co/Z8xXkQSKtl", "https://t.co/HQ5Sb4rt1h", "https://t.co/aOk1ywx5le", "https://t.co/8BXh6nYwoe", "https://t.co/k0e3eQj4vg", "RT @BadLegalTakes: https://t.co/ljZa1Gqakt", "Not convinced by the Covfefe conjecture? Well how do you explain that one X-Men movie? Checkmate, globalists. https://t.co/QYRNbQsh3i", "Context: A Nobel Prize winner predicted Covid would be over—in the sense of causing no excess deaths above normal—by August 25, 2020. He insisted it was true well after it was manifestly false.\n\nDeath reporting lags.", "https://t.co/7WvkZysSDs", "Earlier: A sermon by Pastor Locke: https://t.co/cKtDkFIi2h", "https://t.co/BjjTKIGfkp", "Context and h/t @jmhorp: https://t.co/oJDH9cq22i", "@Kno @magizombi I got an extra MMR booster and tetanus shot for this exact reason.", "https://t.co/JratGeaIN4", "https://t.co/Bd29bRv5kv", "RT @BadVaccineTakes: https://t.co/6s9cWWLiw1", "https://t.co/ujRu9nPUTg", "https://t.co/P8stmWMmv0", "https://t.co/9BYTaqDwz6", "@cjsnowdon \"It's not balanced unless I hope they die.\" https://t.co/zmfw1gyMte", "https://t.co/P5VYn1d2YX", "Prior to the vaccines, nearly 90% of COVID deaths in Scotland were 65+, but this high-risk population has been thoroughly vaccinated. Some still die after contracting the virus, but now younger, unvaccinated people are relatively more likely to die. https://t.co/cG4EWolMj8 https://t.co/HtGrGCXTmK", "As promised. I'll probably delete these tweets to avoid confusion. https://t.co/nv9hpOPu0n", "Context: Scotland is ~85% fully vaccinated, so the 15% remaining constitute double their fair share of deaths. But it's even more misleading than that because the elderly are overwhelmingly vaccinated. https://t.co/ONxxa5QaCR", "https://t.co/a2PWfHf9Ik", "People are having trouble following this, so I'm going to delete and repost because it's important.", "Prior to the vaccines, nearly 90% of COVID deaths in Scotland were 65+, but this high-risk population has been completely vaccinated. Some still die after contracting the virus, but now younger, unvaccinated people are relatively more likely to die.", "https://t.co/n69peAO9eM", "Note: the Russian text isn't a comment on the take. I just like to directly verify the deleted tweets I run, and this one came from Yandex cache. \n\nH/t @cjsnowdon, who observes it's not a typo or mistake. https://t.co/XGSPb5ToI3", "https://t.co/kDsRjz46pq", "RT @BadLegalTakes: https://t.co/kyoEIdiBiP", "https://t.co/9MztsS3cUF", "https://t.co/D4ZCvaCgG2", "Context: 0.21% is *more than* 1 in 500. \nh/t @metabadtakes", "https://t.co/gPbyyUFc4m", "RT @BadVaccineTakes: https://t.co/489LrrKXlW", "Context: Even aside from the confusion of CPR with PCR, this take is just wrong. The \"manufacturer\" doesn't say that, and the tests are gene-specific. https://t.co/CYUUTuXmml", "RT @BadLegalTakes: https://t.co/XnmYKbhp5r", "https://t.co/oocmUjxMKQ", "https://t.co/UmczhsuDY4", "Some people asked whether this is satire. No. She tells her 42k Instagram followers that iron overload and EMF (especially from 5G) cause Covid and every other health problem. By fueling nanobots.\n\nShe sells supplements she claims will protect against iron and EMF. https://t.co/8jAPMkOZer", "https://t.co/HtS0twj3Bg", "https://t.co/qLL8cgvHYA", "A lot of time people send me tips and I don't post them because I've seen it dozens of times before. I'm sorry for that.\n\nI underestimate how popular the same dumb, goofy crap people posted eighteen months ago can be.", "https://t.co/prttCtZttN", "Remember when Trump tweeted “covfefe”? This instagrammer cracked the code. https://t.co/q8bTegfZJE", "https://t.co/1GaM8B1wzW", "Context: Don't take medical advice from the Taliban. https://t.co/LXTaOxMKNK", "https://t.co/ShstILt2Xd", "https://t.co/gYy4eCNell", "RT @BadLegalTakes: https://t.co/558IyNXVJ2", "https://t.co/JXnosGcNCH", "Context: It did not age well. Nonporous stuff sticks to skin because of oils and sweat. But partial credit for replicating this Amazing Randi debunking (and because lots of other antivaxxers still believe the vaccines cause magnetism). https://t.co/4YRlJtZ5ku", "https://t.co/D0lMLyvVmY", "RT @BadVaccineTakes: https://t.co/Z9dskOfhN2", "Context: There are 450,000 healthcare workers in NY state, not NYC, over 75% of them have already completed their vaccines, and remainder didn't necessarily “refuse.” https://t.co/LMM88MhMEX\n\nPeople often re-post screenshots of deleted tweets that went viral.", "https://t.co/Jb7jqGsaGa", "https://t.co/VqcxCLGmRd", "RT @BadVaccineTakes: https://t.co/9wRNcCiO53", "@BadVaccineTakes Read another book!", "Totally real person here. https://t.co/F6CCpluGvx", "https://t.co/Vz0qub67jX", "To be clear for anyone who misunderstood: fake news is *always* bad. It worsens discourse and makes people not trust you. And why should they trust you if you run false clickbait? https://t.co/sCDeJh99kT", "https://t.co/PjJXOdT9gq", "Technically true. https://t.co/8qn41jFaB8", "RT @BadVaccineTakes: https://t.co/59rICVdc03", "https://t.co/3OuP7bP2eu", "h/t @BadNuremburg https://t.co/tACki1Qfip", "https://t.co/szHt3IdqKC", "RT @BadVaccineTakes: https://t.co/sWZ5RepzO1", "https://t.co/Mo8XimFBwe", "Context: 1. Don’t take drugs formulated for horses. 2. Don’t run fake news about drugs formulated for horses, because folks will cite your fake news as evidence that it works (or at least that MSM can’t be trusted when it says *not* to take drugs formulated for horses).", "https://t.co/HVinS1ympn", "https://t.co/HuGd632nDZ", "https://t.co/QkMt0SMWaU", "https://t.co/4W1mlAnZP7", "https://t.co/Chjq9NfLwq", "RT @BadVaccineTakes: https://t.co/XqjzgKRVlV", "Context: The fact the people keep saying this shows how ignorant most are of Covid treatments. Dexamethasone, a cheap generic, was arguably the first drug broadly accepted for Covid. \n\n(And anyway, the vaccines are incredibly cheap.)\nhttps://t.co/BsLymF9PHD", "https://t.co/2Lj7LGRsEV", "https://t.co/onRDSiKHBF", "https://t.co/AYdbTKIZql", "https://t.co/pR3OhjMEtU", "Good additions. Not everyone is unvaccinated by choice. They matter too. https://t.co/Zc6O6SPdKu", "https://t.co/Mm9U2YJrDM", "https://t.co/LPdfVnVXVU", "@dfromthebx https://t.co/ehdX48I1sM", "Context: 1. People care what happens unvaccinated friends and family. Unnecessary deaths hurt everyone.\n\n2. An unnecessary pandemic hurts the vaccinated too, because while the vaccines are dang effective, no one said they're 100% effective.", "https://t.co/fPLT38Otqn", "https://t.co/yF4dw2UqV1", "@BadVaccineTakes @SeamusMacSuibh1 There's an app for that. https://t.co/HxCLGaocJZ", "https://t.co/M5jwLy38bj", "https://t.co/RNB9BHdFIw", "RT @BadVaccineTakes: https://t.co/orONAWGt5K", "https://t.co/bATlIFhldR", "https://t.co/MQh3ALhrSg", "https://t.co/DVNxTJ8stL", "https://t.co/GS3R8TZfCb", "To be clear: the thread wasn't just wrong in it's bottom line prediction. It contained lots of nonsense about PCR testing I'm still seeing repeated. https://t.co/n1b0NGyI9d", "Context: This was one of the many \"herd immunity is just around the corner\" takes from last year. Wildly wrong, but that never deters the audience for Covid minimizers. https://t.co/qzyEZj8fYj", "https://t.co/61d2i4ACI8", "https://t.co/pn40t1wGX1", "@BadVaccineTakes Two contain graphene oxide, but no carbon? That's a neat trick.", "Greg Locke: \"do not get vaccinated.\" https://t.co/ixqXEC1qE6", "How 'bout that. https://t.co/JsaTxOAzY3", "https://t.co/ApFqXCZ14M", "RT @BadLegalTakes: https://t.co/qcZ7TZtmOu", "https://t.co/iv8NCDIX8m", "Folks would make up stuff to explain the bogus 6% stat.\n\nFor example, this claim was perfectly backwards. Flu deaths are estimated at the end of the season. Meanwhile, CDC Covid deaths are from actual death certificates, almost all of which show Covid as primary cause. https://t.co/aPonQ28l0Q", "These Canadian photos brazenly stolen from @VaxxersAnti, who logs such Facebook posts.", "https://t.co/DtsQjDJ1T3", "https://t.co/kpQcv443ii", "https://t.co/qe3i9cqJWB", "RT @BadVaccineTakes: https://t.co/umBiz0jobw", "Alex issues some @BadLegalTakes from Fox News. https://t.co/Z0ABiWNpRp", "What I found more frustrating, however, is people who should have known better claiming that FDA actually did find only 6% died of Covid. FDA did no such thing! https://t.co/54ZIRerXMM", "https://t.co/jTTOhCvqoO", "https://t.co/VOnZKr5ZgS", "Of course, this misinformation made a bigger splash on the right. https://t.co/TnXUq7T0GJ", "https://t.co/CTOeiaTIEm", "Tons of people amplified the \"just 6%\" message a year ago. It was not limited to QAnon or even pro-Trump folks.\n\nRemember excess deaths were over 200,000 one year ago, and even when there are multiple causes listed, Covid is usually (~90%) the primary cause of death. https://t.co/SeMBqMGduJ", "@BadNuremburg @BadVaccineTakes @BadPACERtakes Love this update. https://t.co/cfJReB1cE1", "https://t.co/04wC5EdK9k", "@BadNuremburg @BadVaccineTakes @BadPACERtakes I ran this a while ago. Very low engagement. Is someone still citing the case dismissed in February? https://t.co/jMAbOlJJYY", "Then in early July, former pharma saleswoman Jane Ruby breathlessly recounted the forgery on the Stew Peters show. Ever since then, many antivaxers believe with absolute certainty that the vaccines contain graphene oxide. They do not. https://t.co/V5NbiTcS6p", "In late June, a purported paper from a university in Spain claimed that the Pfizer vaccine was \"99%\" graphene oxide, amazing because graphene is pitch black.\n\nIt was a fabrication. The university confirmed it was false. https://t.co/7H6IHtzQkg", "Context: The vaccines. Don't. Contain. Graphene. Oxide.\n\nThis idea cropped up in early June based on the magnet videos, theorizing the vaccines' nonexistent magnetic properties could be caused by graphene oxide. https://t.co/b2uXMJlfTD", "https://t.co/dxFj8MroOk", "https://t.co/p96o9uFDgW", "RT @BadVaccineTakes: https://t.co/XSrHveV562", "Alex Berenson's ban evasion resulted in the suspension of the loathsome Generation Rescue handle. Is this a record? https://t.co/SYkuNcP1ah", "@DesireeSeattle @AGHamilton29 @Barking5pider 2. If you have a particular deleted tweet in mind, can think of what someone would say in response \"to:alexberenson\" and then pull the thread from this reply off the internet archive, especially if you know the date.", "@DesireeSeattle @AGHamilton29 @Barking5pider Couple of suggestions: \n\n1. When people think that someone tweets something dumb, they often archive it as https://t.co/VgvMDU4jDq, which makes a very readable highlight list. https://t.co/j7SajFq6G3* (add asterisk to end of url).", "Context, the extremely persistent \"only 6%\" myth landed a year ago today, which was retweeted the next day by Trump and echoed by many other large accounts. This thread explains why it's wrong: https://t.co/gGAokuNQr0", "https://t.co/DdpsmgxTEz", "I mean, since they have the Covid/weather machine already... https://t.co/AduZXN4Y3G", "https://t.co/lWrSH1J3rd", "https://t.co/M3U6VehaV2", "@RachelNStephens I appreciate this. I might be overly optimistic.", "Context: Many vaccine-hesitant people are persuadable. Some are sincerely frightened. Maybe they’ve seen misinformation. Maybe they have partisan and tribal biases. We aren’t going to win them over calling them terrorists.\n\nWe remain in this together. https://t.co/rMkKDl7uEh", "https://t.co/vOREQ9oBNE", "https://t.co/qaijXIiPea", "Context: Covid is especially dangerous to the old. The median age in Afghanistan is 18. The risk is poses to the few older Afghans doesn't matter too much to warlords.\n\nSuicide bombers don't care about Covid. https://t.co/IDQUIetOLI", "https://t.co/06NBdyngn4", "A Twitter ban isn't defamation because the site doesn't even say why they suspend anyone. We don't actually know it was for the first tweet in this thread. Maybe he was suspended because he had is followers bomb abuse, here. (Like I said: he's been *trying* to get banned lately.) https://t.co/G9JldfZPk7", "If he sues Twitter, it will be because: (1) he hopes the publicity gooses book sales, and maybe (2) he's as delusional about defamation law as he is Covid.\n\nh/t for these last two tweets, @AriCohn, who had a memorable &amp; relevant exchange with Alex. https://t.co/yDKCFqx261", "Alex is back to his @BadLegalTakes that a Twitter ban constitutes defamation. And he's simultaneously asking whether Twitter can really ban him entirely (half confessing to ban evasion). \n\nAnswers: No, Yes. https://t.co/fwJS6R3vC9", "Silver lining: Maybe this also causes Twitter to ban a \"vaccines cause autism\" antivax account for ban evasion. https://t.co/lbQ0flFXgc", "https://t.co/UvribMsLhC", "Correction: The first tweet was not his last tweet, but it's one a few of you sent me before I realized he was suspended. It might be the tweet that got him suspended, however.", "To be clear: he isn't just careless. He intentionally misrepresents in order to cultivate his audience. https://t.co/P1MRNItc7N", "In March 2020, he had 7700 followers. His platform became 50 times larger, 50 times more lucrative, thanks to popular lies and careless errors he never corrected. Here's a thread of some of them. https://t.co/Q6ZeCdAPZy", "Context: He's been trying to get banned for a while to promote his book sales. He understands this grift better than almost anyone. It's why he tried to create the impression that every one of his pamphlets was \"censored,\" while selling hundreds of thousands of them. https://t.co/ODQRETz2LD", "https://t.co/rNKU3ENaVX", "https://t.co/ud94i7Er73", "https://t.co/jd4DyduPPh", "https://t.co/HPdiBKxRBV", "https://t.co/vnVWVufre0", "RT @BadVaccineTakes: https://t.co/tn01EfwHt5", "https://t.co/cuhWUl4maG", "RT @BadMedicalTakes: https://t.co/OZLuj4ugmi", "https://t.co/m6ShsspWA1", "Context: It turns out that delta was more than a \"scariant,\" and that Florida smashed records as it became dominant over the last two months. h/t: @Marco_Piani https://t.co/CQfMz3yULb", "https://t.co/CluayELiSO", "@angelaisms Health Warning: Do not play the HIPPA-tweet-drink game with @BadHippa.", "https://t.co/OQeF6Vndvd", "RT @BadLegalTakes: https://t.co/ZhMOZp7eG5", "https://t.co/j4FhjUj3vq", "RT @BadVaccineTakes: https://t.co/kqz1bgzjOu", "https://t.co/DjGCTEifdF", "https://t.co/JLlvr9mY9E", "https://t.co/LUNNNgp5kd", "@TonyTrupp @RealCandaceO https://t.co/GZmoGnM4i0", "https://t.co/d53FtbOFqO", "https://t.co/VMlzu3E5Z2", "RT @BadLegalTakes: https://t.co/NrIPFI6xxz", "For references, this is the Owens/Taliban tweet. https://t.co/GZmoGnusTq", "https://t.co/lC0PXgZcJa", "Context: User seems to be calling for affirmative action to remedy the discrimination against him, analogized to Jim Crow. https://t.co/hozhbN9Ff8", "https://t.co/q1OiVDP6gt", "https://t.co/y1VwJykUAb", "Guys, we're back to our regularly-scheduled Hitler comparisons. Especially because, according to Candace Owens, we should take vaccine advice from the Taliban. https://t.co/8mVQYA2ChR", "https://t.co/94cMs8UEIJ", "Context: Famously FDA did *not* approve Thalidomide in the 50s and 60s. Good thread on the subject. https://t.co/k8B3ozof8k", "https://t.co/HmJqdq98VU", "Context: A year ago cases were rising in Europe, so corona minimizers declared it a \"casedemic.\"\n\nBut like the earlier \"casedemic\" claimed in the American South, it turns out that deaths follow after cases. h/t @WrongAgainIvor, plot by @greg_travis.", "https://t.co/LBM7cQzMF3", "As for why the Taliban bans vaccines (including the one for polio), it's probably for the same reason they blow up ancient statues. They're superstitious authoritarian warlords, not great role models https://t.co/pR7Ki3Yc2o", "And that's before considering that the nominal government in Kabul probably didn't do a great job keeping vital statistics. Hard for any poor nation to do, let alone one in civil war. We know from stable developing countries that Covid deaths seem undercounted. https://t.co/zqD2cj1R24", "Context: I'm astonished how many people have replied to Candace that these are good questions. So let's try to answer them.\n\nNobody says that the virus kills everyone, but it's especially dangerous to the old. Median age of Afghanistan is 18. There aren't many old people there. https://t.co/pJNm3OGfGT", "https://t.co/rfUkUrcQyz", "Context: Trump recommended the vaccine at a rally, and some supporters struggle with this. https://t.co/JXPDjnjQxr", "https://t.co/OvbOi3UdbN", "https://t.co/HcT76O30pN", "RT @BadVaccineTakes: https://t.co/A5VeqOcmM7", "https://t.co/2rUWdZOYkY", "@HarrisonStarr_ @MartinKulldorff https://t.co/DC65ItYGIG", "Update: https://t.co/SYapFgIEw4", "https://t.co/imee8Y0VqF", "Context: Antivaxers have been posting these cards online for at least 15 years. They've been especially silly since 2015, when the  quoted California law was repealed. https://t.co/ZOGgYI2wfk", "https://t.co/pXjS0Gqfy4", "https://t.co/eLOfljqelO", "@ProofofBurden I regret to inform this was premature. https://t.co/njM2Dj0vvc", "They've definitely identified themselves as something. https://t.co/4gJ9jErj9o", "https://t.co/6YfL7XShRq", "RT @BadLegalTakes: https://t.co/lTdwuOoksw", "@joshuak08 @jswalden @patrick_r_TX I try not to post trolling/jokes except in marked troll threads. Poster had a number of generic antivax posts. I think he meant it when he posted it.", "If Vermont's low Covid hospitalization rate was to increase at the same high rate for another 18 weeks, then it would finally have as bad a hospitalization rate as Florida does right now. https://t.co/ubSuzT3jbg", "Context: It turns out that when you have one of the worst Covid hospitalizations rates ever, like Florida now, it's hard for your state to increase hospitalizations as quickly as a state that has the lowest rate in the country. https://t.co/YX6yhJgrOj", "https://t.co/q29WAG2RmW", "Context: https://t.co/7Yaf0CxEkg", "https://t.co/TMzNUVDZK3", "RT @BadLegalTakes: https://t.co/1gjpG8FV88", "https://t.co/nPRZmYwDKS", "https://t.co/zLbzUfR0dM", "Context: Kirk does not link to the Axios article, but it's a writeup of this preprint. Based on Minnesota data, the Pfizer vaccine is less effective against Delta at entirely preventing infection, but it remains highly effective against serious cases. https://t.co/kKIrGD7yYG", "https://t.co/H2IKqIdl97", "https://t.co/evxwsrvQdo", "Note: The source of this image, \"Dr Utsava\" on Gab, claims to be Australian.\n\nI'm not sure whether an Australian would know that's clearly not Sydney, but as a midwestern Yankee, I'd realize it's not LA or the Jersey Shore, for example.\n\nI doubt \"Dr Utsava\" is a real person. https://t.co/4SlbMDoNJN", "https://t.co/NSoFkhsC4d", "RT @BadVaccineTakes: https://t.co/atlZsousLD", "@BadVaccineTakes The essence of antivax.", "Context: This is a twofer. The Bloomberg headline and tweet are unsupported. At best, \"more than previously thought\" is \"much less than the unvaccinated.\"\n\nText from the article, on the right, is why Alex screenshots the tweet rather than post this link. https://t.co/iQ8a127kb5", "https://t.co/jCEAYw3H2C", "Some folks are contorting themselves to not take Trump's recommendation literally. https://t.co/8s3UEFN0Qy", "Context: At a rally last night, Trump endorsed the vaccines, was met coolly with scattered boos, so pivoted to \"you do have your freedoms, you have to maintain that.\" https://t.co/SJYRlM1wSf", "https://t.co/bufQ4QC5Ba", "https://t.co/up7E8oMBEv", "RT @BadVaccineTakes: https://t.co/Rx3SgC4V08", "@leelu5the @1984_will_fail @BadMedicalTakes https://t.co/7oL90UFpQI", "https://t.co/f3FyORD6OD", "https://t.co/iqhNgDxafT", "Turns out there are multiple sites manufacturing vials of multiple vaccines, each of which contain multiple doses. https://t.co/Xsjyi27KTx", "@DragonCon @Woodlandhil2431 DragonCon is cosplaying as @BadHippa!", "https://t.co/DYmGzkx2xD", "https://t.co/SBhQUWL4S1", "https://t.co/YxlqCEFyd3", "@cjsnowdon Best Downfall video I'd seen in years was also prophetic.", "RT @BadVaccineTakes: https://t.co/acniVN6HQg", "https://t.co/Polhr7yxXm", "RT @BadVaccineTakes: https://t.co/Tc7hG1BJAZ", "The video clip cuts off the context. She was explaining that people who got vaccines moths ago have less protected than recently vaccinated. The unvaxed have less protection. It's not vaccine-caused ADE. https://t.co/r5an2eYOr2", "https://t.co/gHCDh2zJ1d", "https://t.co/MxWdvm29D5", "@BadMedicalTakes OnlyFans is going to ban mitochondria xxxx tho", "Purportedly serious Libertarians: you have to hand it to the Taliban. https://t.co/UR0k14r3B4", "Says further evidence in support of the Mark of the Beast theory is graphene oxide, which she believes to be a metal (it's not) in the vaccines (it isn't) and has six sides. SIX!\n\nIt doesn't really; it's a plane of hexagonal carbon, but many sugars *do* have six sides. https://t.co/W9ryBxLhb8", "Context: Instagrammer with 42k followers shares video appearing to show a woman's veins glow under blacklight. Concludes that vaccines caused this and that vaccines are the Mark of the Beast.", "https://t.co/CRKYbe1k6G", "https://t.co/VxTrIe5th8", "@Datahead68 @penipulation It's on his Telegram from last night; about 23 hours ago.", "@BadHippa https://t.co/vZpNZMeY0S", "https://t.co/nW7yWddhQT", "So @BadVaccineTakes, who you should follow, posted this before I did. https://t.co/3jhkhKxUHD", "https://t.co/kbVeVdkhhm", "@BadHippa @awscloud Should have a trophy case for these sort.", "https://t.co/D7npDHDhVd", "If you have access to the Covid misinformation reporting feature, maybe visit the tweet I QT'd, scroll up, and report his stupid lie-for-clicks grift. https://t.co/rGSwjx1syj", "Context: He cut off her statement. She reported that those vaccinated earlier have less efficacy than those vaccinated later—both groups are better off than the unvaxxed. \n\nMaybe he explained it in a later tweet? Nope, he just posts a shitty referral link. https://t.co/qlRc3ZG8Et", "https://t.co/vRenKUDNz1", "RT @BadLegalTakes: https://t.co/LDNucBkDam", "https://t.co/ZZU3tPJ5yS", "@BadVaccineTakes Jelly.", "If you think smoking is good \"statistically speaking,\" wait until you hear about the low percentage of Covid patients who own a Porsche or are left-handed! https://t.co/sGjM17S32g", "Context: Base[d]...rate fallacy takes.\n\nAbout 60% of Britons are fully vaccinated, so 40% hospitalized demonstrates vaccine efficacy, especially because the high-risk elderly population is over 90% vaccinated.\n\nMeanwhile 13.9% of adults in the UK smoke, https://t.co/jA5uQwMStj", "https://t.co/Hy029OTOKm", "https://t.co/3QpicFadYD", "https://t.co/VPw9wtX1Jg", "RT @MiddleEastTakes: https://t.co/7tICURSmOd", "@samuel66645198 @tweetinontheT @RoomsForRent7 @jaketapper Pretty sure it's a joke.", "RT @BadLegalTakes: https://t.co/hBBVeD1a4P", "Covid minimizer commentary has taken a Great Leap Forward in the last few days. https://t.co/vVkIkFE8FJ", "@jmhorp I hadn't seen that Tucker one.", "https://t.co/0aVU9VwwS9", "https://t.co/58xpFZkDgl", "https://t.co/AFtkf0Dn3O", "https://t.co/y71sY0vdOK", "Johnson County, KS board of commissioners meeting: “There’s zero evidence that COVID-19 exists in the world. … you will all be tried for crimes against humanity.” https://t.co/oKRhjXZ440", "https://t.co/KFDn7OPyEV", "RT @BadVaccineTakes: https://t.co/CY1rMP0qe5", "@BadHippa Thinking of going to @DragonCon, as I have many times. Today's announcement makes me likelier to.", "@HawkInATX @moragmcalpine @HiddenPinky @MaureenStroud @SHurrell1 @talkRADIO @TVKev @ClareCraigPath @BadVaccineTakes Nuremberg 2.0: the Bavarian city reinvented! Cooler medieval castles, spicer gingerbread, smoother beer, meatier bratwurst!\n\nNo wait, it's the war crimes thing.", "https://t.co/thW4bwXauf", "Formatting note: this individual did not know how to make threads, so I manually rearranged these last four tweets so one can appreciate the odd comment about the Counter Reformation.", "https://t.co/QtHEn8k8RO", "https://t.co/tT5AtU0sPS", "https://t.co/2w2cd6oru7", "https://t.co/4rWuXo4s23", "Accidental good take h/t @BadVaccineTakes.", "https://t.co/xn1cheaZ8a", "RT @BadLegalTakes: https://t.co/2jqNIIkbjg", "https://t.co/gIviZcrRTZ", "@BWStripes17 @kennedytcooper @BadMedicalTakes That's a @BadVaccineTakes post. I RT'd it because I try to give credit to good accounts that product good content. https://t.co/1DGmSzPBzg", "https://t.co/vBTQrAdcxa", "https://t.co/J7OiqlOpl8", "Adding this intentional trolling so that people can stop sending it to me. It's not actually a take; it's a putative humor account. Thx. https://t.co/g7d2Mczp9H", "RT @BadMedicalTakes: https://t.co/zJwpP4Wj0Y", "https://t.co/A6HITA0Pii", "@Navarp @BotheredBoy @BadVaccineTakes @BadMedicalTakes Troll account. https://t.co/MCIZiaSlUA", "https://t.co/ro6qzI0XUH", "@Mr1nteresting This guy carbon-12s.", "https://t.co/0CcnpFvz5X", "https://t.co/2OexzRu7eN", "Memes don't die, they just get blurrier. https://t.co/J4Z1fTMPuU", "RT @BadVaccineTakes: https://t.co/2WUsUlrpgi", "https://t.co/MhoSpIrZJh", "@BadVaccineTakes What is with antivaxxers and semen?", "RT @BadVaccineTakes: https://t.co/fTsyZTj9hN", "https://t.co/XwBpGULdMf", "RT @BadVaccineTakes: https://t.co/GFGokjlSpm", "h/t: @BadWritingTakes", "https://t.co/bgxVFOtFuS", "@BadLibertarians Again, people love getting clicks. And also: another funny analogy. https://t.co/XwvQ1zFI5x", "https://t.co/WNktFpWZaG", "https://t.co/YVK71msuOu", "https://t.co/XmaeADBUvN", "https://t.co/4HT1WcD0zZ", "https://t.co/mZPPyBVrsn", "😬https://t.co/HbyOZGD78w", "Context: Bill was a bad takes machine before he was banned from Twitter August 14, 2020. I guess he's still got it. On Gab. Here's a thread with about 155 mostly pre-ban Twitter Bill Mitchell takes. https://t.co/4nBg5yh5gV\n\nh/t: @patriottakes", "https://t.co/iGD3zgvNVc", "https://t.co/nHY0gDbLMb", "RT @BadLegalTakes: https://t.co/RVj2TjE1WV", "https://t.co/fhH65uvEU0", "https://t.co/0fYgaKQc0n", "https://t.co/3GgtHehcQF", "RT @BadVaccineTakes: https://t.co/k2wriswErU", "@ZDoggMD TLDW: Masks might be a marginal intervention for kids, but most of the rest is dangerously wrong. Vaccines do not make the disease worse; the vaccinated have milder cases. Treatments aren't solutions. Unremarkable that a family doctor who treated 15 had none go to hospital.", "Context: There are so many things wrong with this video. The summer 2020 wave is just the easiest-to-illustrate error. @ZDoggMD made a great video where he walks through the claims. https://t.co/IqwKdIQPkL", "https://t.co/7yWecTYBmc", "@BadVaccineTakes Couldn't figure out what he was banned for, so ran a classic I never posted as an excuse to spread the word.", "@BadVaccineTakes EncouragingVaccineTakes", "@IvorMectin1 Is the “Ivor Mectin” joke original? I guess not because of the ‘1,’ but I’m a sucker for puns.", "RT @BadVaccineTakes: https://t.co/k5a2aL6mr8", "https://t.co/TJIZj2cybP", "https://t.co/plA2O2xL2Z", "Cummins oddly believed Lukashenko's \"pretend there's no virus\" policy was the one weird trick to end the pandemic. Turns out that dictatorships are not known for reliable official statistics. Also, not counting COVID deaths doesn't make them disappear. https://t.co/re6Dx5XDQ2", "Context: More information on how hackers exposed the fake official COVID death numbers coming from the Belarus dictatorship. Most people assumed they were fake all along, but not Ivor Cummins.🧵 https://t.co/lBWK16Wd7W", "https://t.co/yp2FYJnOc8", "@DesireeSeattle @BadVaccineTakes (What I mean is: I tend to just RT rather than replicate content, and he posted this before I did, but I didn't RT.)", "https://t.co/SojIcdDXxm", "@BadVaccineTakes Missed this. You're on top of things, as always!", "https://t.co/NTwIFz7eTN", "https://t.co/lXAaj0VEHB", "@BadVaccineTakes https://t.co/uJae3b7SAZ", "I meant to post a link: https://t.co/VfdVAylHXy", "@keith_giles https://t.co/gDTPGnxKVo", "He poses as a censorship victim, but has sent 45 tweets since this one two days ago, while fantasizing about using lawsuits—machinery of the state—to silence people who comment on his ghoulish grift. https://t.co/OnXWWa9COl", "@JoshuaDHunter It's not just that he's said things carelessly that turned out to be false. The Atlantic article cited covers one of the clearest examples of him promoting something he knows to be false. https://t.co/P1MRNItc7N\n\nAlso covered on this account. https://t.co/VLe12ZTUzX", "@JoshuaDHunter Alex fantasizing about suing people again, based on weird belief he's never said anything false. See thread above for examples.\n\nHe never revisits his whoppers, just moves on, sometimes repeating exactly the same mistake enough times it can only be called lying. https://t.co/drRclPEEcC", "https://t.co/QqdsTPPl8K", "https://t.co/SwG3Y8YE4S", "Context: https://t.co/BGRY0Zd9zY", "https://t.co/C6ItlC3m8j", "https://t.co/pFajGxt5th", "https://t.co/As3P7FxVUf", "https://t.co/YZtkHWvt4v", "https://t.co/W2zUmie9nn", "RT @BadVaccineTakes: https://t.co/uA8NEwVM0f", "https://t.co/He8tY21laT", "RT @BadLegalTakes: https://t.co/YKyN1n8jRB", "Context: The CDC didn't do this. It seems to be a mutation of another false claim that has been further warped through the game of telephone. https://t.co/h99jx2ZtVK", "https://t.co/IqlTbZVJtW", "Source for the @mtgreenee clip. https://t.co/IcEqz8PEAm", "“Well what they don't know is in the South we all love our Second Amendment rights.” https://t.co/yV3xvRYol3", "Context: People who believe the vaccines literally kill people come up with elaborate theories for why that actually hasn't happened. Also: antivaxxers on IG often apply pro-vaccine stickers in hopes that the algorithms won't flag them.", "https://t.co/rp6dJ502Vr", "RT @radleybalko: https://t.co/lLlvjhs9yL", "https://t.co/tkiTLU72IB", "https://t.co/M5ZSuGwNpL", "@BadHippa Big fan of the @BadPACERtakes account, though in my experience it's hard for tweets with so many words to take off.\n\nHope they continue to post more grifter/CHD/AFLD type stuff than random crazy pro se plaintiffs. Good curation so far.", "https://t.co/J27Ffnpzc6", "RT @BadVaccineTakes: https://t.co/JlTSIRpE4f", "https://t.co/JtytuyNTRm", "One week later, still false. https://t.co/IYhzJJ0fTL", "@mybearsnme @BadVaccineTakes https://t.co/1ZgWwY0Dbq", "@hrafnkat @BadVaccineTakes Some people believe that vaccines literally inject people with 5G transponders (and also that 5G is deathly lethal). It's on the graphene/magnets end of the antivax bonkers spectrum.", "https://t.co/Jdd1Y3OQUl", "https://t.co/mIlWZg9cmf", "To clarify: The bad take here is “fascism.” Primary schools aren’t run by Mussolini.\n\nOthers can opine on whether some folks' newfound concern for racial disparities is cynical. This is a one-issue account. It expresses no view about whether disparate impacts are “racist.” https://t.co/WvSdoF7qRZ", "https://t.co/ET2wiry66e", "https://t.co/q5Uh9U9b1f", "@BadLibertarians @jaystooksberry I will post this, but just did two bad libertarians in a row and need to space them out a little or it might result in some sort of Galt's Gulch scenario.", "RT @BadLegalTakes: https://t.co/ON4v7LQ31R", "https://t.co/0x2Swq7IHu", "https://t.co/kAdqs4eU6v", "https://t.co/ktZQxkQz4o", "https://t.co/y76dDA9DEb", "@BadVaccineTakes First verified account to run this line? Bitcoin, glowing eyes, checks out.", "RT @BadVaccineTakes: https://t.co/sQCjb9ng8K", "@BadLegalTakes Meta", "https://t.co/6Pmb41BaL7", "https://t.co/W9eDm9ZcuA", "RT @BadVaccineTakes: https://t.co/4FxuF5zFtq", "@BadVaccineTakes Starting to think we're not dealing with a reliable narrator here.", "https://t.co/yoyJBzBUBc", "Thread further breaking this down, which QTs and embeds many of King's confused videos.\n\nTLDR: No evidence \"material to\" and \"available\" for King's bonkers (quashed) subpoena does not mean the virus has never been isolated. It has been. https://t.co/6BpXRW3vCu", "https://t.co/JFXjsIBEK0", "https://t.co/tXYVpEVaQ3", "Wish I could post documents from the case, but as far as I could tell, it requires sending a lot of Canadian dollars to Canada. (I guess that's what I get for ever complaining about PACER.)\n\nIn his TikTok, King mentioned distributing them by thumb drive. Will tweet if I get any. https://t.co/SAt08rhKsg", "As far as I can tell, King lost. A week ago he told his TikTok followers the case is over. He complained that the magistrate gave bad advice. But when Alberta announced they were lifting restrictions, I guess he decided to declare victory after the fact. https://t.co/SE217WaeeI https://t.co/OODjnIhdrc", "It seems to be a motion to quash his subpoena. It argues that Hinshaw has “no material evidence” related to King’s $1200 fine. King complained on the Stew Peters Show that opposing attorneys argued that it was irrelevant. Yeah, that’s their point—not that the virus doesn’t exist. https://t.co/E9Fz5KStos", "Context: I’ve seen a lot of this today on Facebook and Instagram. Basically King contested a social distancing fine last December and tried to serve a subpoena on Alberta’s CMOH Deena Hinshaw. This paper was allegedly part of Alberta’s defense. But it doesn’t admit anything. https://t.co/uopgA35q6h", "Australian soap opera actress says that the “scamdemic” was single-handedly brought down by Albertan man who proved in court the virus doesn't exist. https://t.co/hvLPkDen6k", "https://t.co/XZlgUmYFxi", "https://t.co/vfPQ2BzVYE", "@BadLegalTakes @BadHippa And the 2013 \"HIPPA\" bill that never passed? Here's the complete text. \n\nEven if it was law, it would not create allow lawsuits having anything to do with vaccines. https://t.co/WRuFq1ReMO", "@BadLegalTakes @BadHippa Oh, and to avoid my own plagiarism, this is the blog post Flanagan serialized in \"her\" thread: https://t.co/UudRnfGDc0", "@BadLibertarians @MotherLura Yeah, weirdly started about week ago, several accounts, but same schtick, might be one person? I blocked one but let this one continue because it used to write \"this is a great take, sadly unfollowing,\" which I found funny. This particular trolling attempt I find less inspired.", "@BadHippa Bothers me I didn't capitalize the 'p' in \"plagiarize\" to match the others. Or maybe the imperfections make it more viral. Yeah, let's go with that.", "h/t (plagiarized in large part from): @BadLegalTakes and @BadHippa, who are way better at this than I am and you should follow if you don't already.", "https://t.co/0673YaFdSO", "https://t.co/H84Oy7AWQs", "RT @BadLegalTakes: https://t.co/61CMQY1fOo", "@SpecAlt @BadVaccineTakes Genuine urban legend. They're really blacking out the antivax bingo card though. https://t.co/3RaDXst24t", "https://t.co/ITxdUuFsP2", "https://t.co/hbKOd5nkSu", "Context: Normally I'd just point out that the vaccine doesn't alter DNA, and even if it did, this would not cause \"slavery.\"\n\nBut I also doubt the U.S. Patent and Trademark Office has jurisdiction over God. I could not find it in the Manual of Patent Examining Procedure.", "The vaccinated are “no longer owned by God.” https://t.co/QM1qiyyOmv", "https://t.co/2YATlcwMwj", "RT @BadVaccineTakes: https://t.co/cTDsn7oCCs", "https://t.co/wSnwLPZMKq", "https://t.co/9tiSUp5FSN", "RT @BadVaccineTakes: https://t.co/HGiIroquXP", "@BadLibertarians Two observations:\n1. Dumb tweets that get numbers are imitated no matter how dumb they are. \n2. When Twitter disables likes and retweets, it's not hard to evade. https://t.co/Brz3DvDOvW", "RT @BadLegalTakes: https://t.co/WG1BPMazz0", "https://t.co/VdvF7kkWew", "https://t.co/nTLpC7BiQK", "https://t.co/61XNUqz9BU", "https://t.co/2m7KR3DItJ", "NYT still hasn't deleted this. It was on almost every antivax IG account, and all the usual suspects came out to celebrate it. \n\nClicks &gt; Context, I guess. https://t.co/RBbN4JrgCU", "Imagine making holocaust allusions to help market your shitty books. That's Alex Berenson. https://t.co/klr4S8ywUe", "As context for Alex's recent tweet, arbeit macht frei (“work sets you free”) was put over the entrance of Auschwitz. Impfung macht frei means “vaccination sets you free.” It's a pander to the “vaccine holocaust” theorists and incredibly gross. https://t.co/qOpz1B9FiW", "Context: U.S. Senator doesn't understand what censorship is. Johnson uses his platform to endorse the next phase of Alex Berenson's grift (milking a one-week Twitter suspension to go on Tucker, etc.) https://t.co/VoAXUC1TbV", "https://t.co/FnFdbEHwMn", "Several followers point out that he's not only terminated from Baylor University Medical, but Baylor has sued him for misrepresenting that he's still affiliated. (h/t at least to @corinhoggard, @TimDammon, and @Balgor11.) \nhttps://t.co/p9MWtBsWGz", "RT @BadVaccineTakes: https://t.co/EhXpYVi3se", "@Marco_Piani Further context to explain the plots I mangled above: These show cases/million and deaths, both smoothed, and on different scales. From this you can see that deaths previously followed cases by 2-3 weeks. They still do, but at a *much* lower proportion than before. Vaccines work. https://t.co/ocQo7c1mjC", "@Mrtraveler02 @BadHippa @BadVaccineTakes Here it is. Starting to wonder if this is performance art after her \"siting [citing]\" confusion earlier today. https://t.co/iEZbE6iOYp", "Plots created by a sheet @Marco_Piani gave me, who has some good observations about Berenson's related misrepresentations. https://t.co/1nmuhl9X4L", "Context: It's been a month after the date Berenson says cases exploded, and two weeks since he repeatedly claimed imminent \"vaccine failure.\" It was a weird flex for him to basically turn into a \"wait two weeks\" doomer, but I did wait and—nope, the vaccines continue to work well.", "https://t.co/CEnuhTrP4I", "https://t.co/dTmn0QbU9b", "https://t.co/dofFM8kQB5", "Context: With half of all Americans now fully vaccinated, sure doesn't seem very lethal! \n\nAs @gorskon explains, McCullough is a \"vaccine holocaust\" theorist with acquired immunity to evidence. https://t.co/kgAHEAlHPb", "https://t.co/ApoTNIemWa", "Every headline this week: You get a base rate falacy, and YOU get a base rate falacy! https://t.co/tAPBoKCR6J", "And this has hardly been the only example. https://t.co/0fnb7HZEk6", "A lot of people are pointing out the headline is also bad. I agree. Two-fers are a thing, and it's been a bad week for MSM clickbait failing to convey context. https://t.co/so6kgVKIQT", "https://t.co/7L0brOjLJw", "https://t.co/05EhJCzHc4", "Update: https://t.co/3yyksy0ckP", "https://t.co/Gx4stsJ6fI", "https://t.co/wGENVasTzD", "https://t.co/gafVGOyV82", "https://t.co/HelpbYe1Hg", "https://t.co/bPyozCiXpv", "Context: Godwin's Law, but for coronagrifters. https://t.co/jm2SnpYnLB", "https://t.co/cQjc30pl4j", "@BadLibertarians If ever find yourself falling from a plane, do your own research about the risks of parachutes. https://t.co/4fztwtxNxn", "https://t.co/eApuH4bxmf", "https://t.co/MgUTNHEDJO", "RT @BadLegalTakes: https://t.co/NAEVZUVSzN", "https://t.co/EJepWLzaDt", "https://t.co/CYUBXt1NA2", "This account posts a lot about WVU sports, doesn't seem to be a shtick, and also doesn't seem to write like someone proficient in English. Therefore, I am filing it here in this new thread for possible troll takes. https://t.co/oPVrcKGm5D", "https://t.co/JRfdTLOL2e", "@BadLibertarians And of course I made mine wrong anyway. Full refunds for everyone. https://t.co/n5JnYzn6ob", "@BadLibertarians An even better one: https://t.co/MJkenQ1JPH", "@Edward_Carney Goddamn, this is better than the one I just made. Should have checked my comments.", "Context: it turns out the probability of risk matters. h/t: @BadLibertarians https://t.co/6JOSGpjPY4", "https://t.co/WQcd3oejK7", "Context: NYT *tweet* is wrong and has been spread by antivaxers. FDA is concerned that *breakthrough infections* may be just as transmissible, but the very same report shows vaccinated are less likely to have such infection, confirmed by int'l data. https://t.co/42NC7v4nCN", "https://t.co/RugbS3JTp3", "Earlier thoughts on Delta, which exits in other countries, BTW. https://t.co/Gsx6fO5SPv", "@KindrachukJason @nailbomb3 Before my time. My Commodore 64 had one of these. https://t.co/zS3jJuPHut", "Alex theorizes that maybe Delta isn't so deadly. False. South Africa (~5% fully vaccinated) has almost double its normal mortality right now; this would be like 6,500 COVID deaths a day in the US, and South Africa is a younger nation.\n\nTLDR:\nCOVID kills.\nVaccines work.\nAlex lies. https://t.co/3qowrI5ri9", "If for some reason you don't trust health ministries, you can see it with your own eyes. Relatively few deaths follow spikes of cases—in wealthy, vaccinated countries—while COVID continues to hammer less fortunate nations. These vaccines make the virus much less lethal. https://t.co/tyz87TbPyQ", "Of course, this is \"not the only data we will ever have.\" In fact, we have lots of real-world data showing efficacy. https://t.co/JWoao4THDv", "Context: Alex Berenson, who tells deadly lies in order to sell crap, misrepresents a study that was never designed to determine reduction in deaths (although more did die of COVID in the control group). It proved efficacy against symptomatic COVID. https://t.co/HDpbKXM706", "https://t.co/w49Ka2Kf7L", "https://t.co/y1fZePxTJe", "https://t.co/RkXQ1NtYbD", "https://t.co/C4RGedpR6o", "https://t.co/Rzw0XUyPdI", "Context: Incorrect. The test is meant to capture any variant, but positive results are sampled for sequencing that determines which variants are spreading. https://t.co/9JgztVf9EO", "https://t.co/XRYbHurlpp", "RT @BadLegalTakes: https://t.co/K8sHQylBWm", "h/t: @GYamey and @RachelAlter007. https://t.co/nQg5LvfUAi", "https://t.co/WX33x3srSk", "https://t.co/tqKoIbPhd7", "https://t.co/I4J51enH81", "https://t.co/a96zyIhUFP", "Toby is an antivax economist who had 32k followers on Twitter before being banned. Here are some of his last tweets..\n\nh/t: @thereal_truther https://t.co/Mc0RPi5vsJ", "https://t.co/8yUbKkKLsE", "https://t.co/F8rB9qS4Lr", "https://t.co/OHIqN2tZmg", "https://t.co/HtsF4gGfRC", "RT @BadVaccineTakes: https://t.co/7n3LUSIbpn", "https://t.co/FXYKP6sb59", "Context: The effects of the disease are worse than the vaccines, for all ages, so the “get infected with Covid!” strategy doesn't make sense even cynically.\n\n(I'm QTing former Surgeon General Adams here because Alex has praised him several times.) https://t.co/iYIARrm3lN", "https://t.co/UBZ2TekRnC", "People knew about infectious disease over two thousand years ago. This knowledge apparently hasn't filtered down to certain TV actors. https://t.co/vBUfBRmkTG", "Biblical context: https://t.co/XHjiaUJwV7", "Context: Offering effectively a senior discount is Satanic now, I guess. \nH/t: @OldMackIsBack.", "https://t.co/bY5V8uje5S", "https://t.co/sn9CzNWoHf", "RT @BadVaccineTakes: https://t.co/bK3Va1bxg4", "RT @BadLegalTakes: https://t.co/l428l7ISt1", "https://t.co/KypjwJQSFt", "RT @BadVaccineTakes: https://t.co/fv3wmNolTk", "https://t.co/H9D3L0beJx", "https://t.co/xKMJSPef3g", "RT @BadLegalTakes: https://t.co/KGUFpXMirm", "Context: Thoughts on why the prediction was so far off the mark. (And important note: current deaths are likely elevated again, but this isn't clear due to reporting lag.) https://t.co/QuHJDfb22x", "https://t.co/B08p4APbVg", "Finally, the claim about cases is bunk; a deliberate misrepresentation popularized by coronagrifter and liar Alex Berenson. https://t.co/SB7yPLcrXi", "While some deaths might have occurred anyway, many more people are incorrectly not counted as COVID deaths. Hundreds of thousands of excess deaths have occurred, exactly when COVID deaths are high. https://t.co/OYarhRakiK", "The rate of false positives from PCR tests is very low. From real-world experience we've seen positive rates of a small fraction of a percent. PCR tests are gene sequence specific to the virus and don't pick up the flu or anything but SARS-CoV-2. https://t.co/CYUUTuXmml", "Context: The headline claim is false. Neither FDA nor CDC have pulled anything. There remain dozens of RT-PCR tests authorized. CDC is just phasing out the oldest test, which can still be used until the end of the year. https://t.co/h99jx2ZtVK", "https://t.co/ICxVUFPh4z", "https://t.co/InAsAPJfn8", "https://t.co/EUfc9pFIzA", "https://t.co/MIDmMaVGTZ", "(Sorry it's no longer July 24 in Ireland; should have checked my list in the morning.)", "Context: https://t.co/VZqVRx0HKo", "https://t.co/xAyNZM4daQ", "Shemirani also told the crowd to email her their doctors' information so that maybe they can be executed. https://t.co/vi920Fl5Ei", "The more recent bonkers nonsense is the bit about graphene which conspiracy theorists incorrectly imagine the vaccines contain, and further that these somehow channel 5G communications. Or something. https://t.co/JvdVBRIFk9", "Shemirani was almost certainly referring to *patent* 060606, which is not actually a patent but a publication. Has nothing to do with vaccines. The application was filed in 2018 and abandoned after a final office action (rejection) by USPTO in December.  https://t.co/6Z56mKvKrT", "Context: Kate Shemirani mixes old and relatively new bonkers conspiracy theories, and you should really read the whole thread. https://t.co/k4Frit8hFC", "https://t.co/tEZlE9Draz", "https://t.co/gfoG169x8R", "A more polished version of the point above, with a Drake meme thrown in for good luck. 🧵 https://t.co/A318SOg6cf", "Context and h/t: This is a lie in several ways. There are dozens of authorized PCR tests, not one. The (old) CDC application is just being withdrawn—not revoked and not recalled. https://t.co/U9Do1H0Ue4", "https://t.co/NIk8ivvnxx", "RT @BadVaccineTakes: https://t.co/IsJJYBIGxo", "Some folks struggle with the codes. https://t.co/2oP6RB0m3N", "This thread explains how and why antivaxxers use codes. https://t.co/VMZ9GfHIoB", "https://t.co/HkZWCGcvno", "@BadVaccineTakes Surely no “unvaccinated sperm” take will top this one?", "RT @BadVaccineTakes: https://t.co/CwMJjjcv01", "https://t.co/etWVWQytVP", "https://t.co/E0o2ZIcMlg", "RT @BadLegalTakes: https://t.co/D0ctGE1Ix9", "https://t.co/cx5zM8Wmiv", "@ReedCoverdale @SirajAHashmi @BadHippa @AnOpenSecret Whoa, @BadHippa I think this means you're part of the cabal now! I'll be sending you our secret medallion (it's a \"69\" with \"420\" on the reverse, @SirajAHashmi's idea), along with instructions on the faces you should stamp with your boot, forever.", "@ZaackHunt Neat! Cable news imitates Twitter. https://t.co/lIuAVoc3JI", "https://t.co/WtGlcc9NI0", "RT @BadVaccineTakes: https://t.co/0tVm5J9BaF", "https://t.co/rjEyxEJqzt", "Note: I never ran this card when it circulated months ago because I was pretty sure it's a joke to mock Christians. I mean, just read it.\n\nBut user complains about COVID restrictions in other posts, and I am not sure he knows it's a joke.", "https://t.co/yxMcjqSiTo", "@BadVaccineTakes It's worth mentioning that this is an incredibly common trope in antivax groups. If someone says they were vaccinated and it was a sore arm and NBD, a half dozen responses claim they probably got the \"placebo.\"", "Source for the plot: @numbers_truth https://t.co/V2ELKOjkzN", "https://t.co/UGDPepEnkJ", "RT @BadVaccineTakes: https://t.co/yTXArEeu9m", "One year ago today: Ted Cruz gave his guarantee. https://t.co/g9pRpr2Xlg", "https://t.co/nAiBuhRMKc", "Good thread on the reason for codes in antivax social media forums. (Dancers, swim meets, unicorn emojis, etc.) https://t.co/nnKuOXNglG", "https://t.co/AGIiPYnK5E", "https://t.co/MuCSRwjLey", "https://t.co/qPm5ROtONk", "RT @BadLegalTakes: https://t.co/XvJxHA8G2n", "https://t.co/931JMqonVm", "And Tim leaves off the most important endpoint: death. The vaccines might only be ~65% effective at preventing a Delta infection, but data suggests they're still highly effective against death. https://t.co/8s9uUqrUNZ", "Context: In fact, the vaccines are effective (but not 100%) at preventing all of these things. Although the vaccines were authorized because they prevent symptomatic COVID, they also seem to prevent COVID infection (and therefore spread) to an extent. https://t.co/Jjk7DqiKLP", "https://t.co/PAOKn9thXA", "RT @BadVaccineTakes: https://t.co/uogKRfOwhz", "This comment makes a good point. I usually try to feature bad takes from people with influence or intentionally grifting. I should have at least redacted the name.  https://t.co/r3Bzef5RoI", "https://t.co/u3qxjSvsWa", "Context: a year ago, Trump tweeted a pro-mask, pro-patriotism message. Many supporters did not interpret it literally. 🧵: https://t.co/n55zdt4AhS", "https://t.co/6F2BoNLxQh", "Context: I probably should have captioned this “HIPPA,” because that's clearly the fictional concept MTG invoked. A helpful chart: https://t.co/WhucZMdOLH", "Marjorie Taylor Greene invokes her “HIPAA rights.” https://t.co/4cgODNeljy", "https://t.co/9mXK1VVT20", "https://t.co/j6a1hJIKvB", "@Brian_Orak @nataliexdean Me too. Great communicator and domain expert. I meant to write in the thread: highly recommended follow.", "@wastetime @nataliexdean The short answer is that I did... once. https://t.co/pgiagxmBxV\n\nOne excuse is that I tend to post things soon or wait for anniversaries, and I didn't post it last summer because I thought maybe she had a bad day. Nope.\n\nThe honest answer includes cowardice and procrastination.", "https://t.co/SnkDpkpP7I", "RT @BadVaccineTakes: https://t.co/ukwBsODvVj", "RT @BadLegalTakes: https://t.co/TPTdoxkJSZ", "BTW, I’ve never had a conversation with @nataliexdean. While I’ve sometimes linked to her helpful tweets, she had no role in this thread. I'll delete it if she asks.\n\nI just keep track of a lot of anniversaries, and one year ago today, I learned who Rebekah Jones is.", "Jones was permanently suspended from Twitter about 45 days ago. I've seen conspiracy theories about this too, but it was most likely for buying followers and perhaps for evading a temporary suspension with alternate accounts. https://t.co/hcX5miwqMt", "Jones wrote a rebuttal to the NR piece (it’s no longer free on her $$$ substack). NR hardly mentions Prof. Dean, yet Jones rebuttal included this nasty smear. Again, Dean didn’t say this at all. If anyone’s juvenile and resentful here, it’s not Prof. Dean. https://t.co/02de28YYrN", "It should not be a partisan issue. I'm not a fan of DeSantis, but I'm even less a fan of misinformation about the virus. Spreading anti-DeSantis conspiracy theories makes it harder to dissuade people from pro-disease conspiracy theories. I believe that. https://t.co/lXbSvwM7lJ", "It’s got receipts; Jones exaggerated her role, attacked people on flimsy pretexts, and hoovered up hundreds of thousands of dollars from donors who wanted to hear a particular story she let them hear. https://t.co/a1ouFbVDGS", "The best summary of Rebekah Jones’ schtick remains this National Review post. Yes, I know it’s the National Review, where most writers probably love DeSantis, but there’s not a significant thing wrong with this story. https://t.co/MpxzgtTYMD", "This makes sense. Most Florida DOH staff, including Jones’ former supervisors, are career staff—not appointees. These professionals aren’t “in on it.” Florida’s overall death numbers confirm they aren’t undercounting Covid deaths more than other states. https://t.co/Fjgisf3TAd", "More recently, Jones said that she *never* claimed to have been asked to delete COVID date. https://t.co/URyKZM73mY\nMany people believe Jones accused the state of something that she herself does not claim—not when she’s trying to be precise, at least.", "But when Jones was fired, she did not allege “tampering with data on deaths…hospitalizations…new confirmed cases, or overall testing rates.” It was an issue of presentation, and what Florida DOH called “insubordination” in talking to the press. https://t.co/qvzxnMJFGu", "An earlier thread discusses myths about Florida “cooking the books,” and Rebekah Jones was—by far—the most commonly-cited response I’ve not already addressed in that thread. People claim that DeSantis baddies asked Jones to delete deaths or something. https://t.co/cp4kaSyIYT", "Jones was just wrong about the science: antibodies indicate *past* infection, and someone with a false negative won't engage in risky behavior like someone with a false *positive* might, but Jones’ smear of Dean is what makes it reprehensible. https://t.co/nGMdVwuzJq", "Context: One year ago, @nataliexdean asked Rebekah Jones a pointed question, and Jones blasted to her followers she was being “harassed.” One pointed question was all it took for Jones to smear a scientist and a phenomenal communicator during the pandemic. https://t.co/fINR0f7GX7", "https://t.co/jRRN89h7LB", "More generally, the rates of vaccination among the elderly in UK are &gt;90%. That fewer than half of hospitalizations are among vaccinated high-risk groups shows that the vaccines continue to work very well. https://t.co/wG7zZszJi0", "Context: First, Candace doesn't mention this correction, covered in the article. https://t.co/5KWVK3J1w8", "https://t.co/fzIqT9smXC", "https://t.co/NEBruozrwt", "@keith_giles I agree. https://t.co/1vdvAKDFUi", "https://t.co/dT7sY6Q2Ob", "https://t.co/BHMtOL36NS", "When a bad take gets likes/RTs, no matter how dumb, it inspires imitators. https://t.co/UAE7N8fi56", "h/t: @BadHippa, who also has commentary on Bad Homeopathic Takes: https://t.co/3J468uiorN", "@emmaheath94 He QT'd the post, so a bunch of his followers came to demonstrate they're unique and beautiful snowflakes with highly original and mature thoughts. https://t.co/FhtArYie2R", "https://t.co/aSPBUIwD3g", "@BadHippa @KalmenBarkin3 @badtakesbad @NYTHealth @BadVaccineTakes But the blank space contains the *memory* of homeopathic takes that used to be contained.", "@MuthrJones @1c3B3rgMama @DannyReeves33 I'm not really into ghoulish spite, especially not based on a comment from March 2020. We are actually in this together, and deaths are a tragedy even when you don't agree with the person. https://t.co/y3HFnVvZQh\n\nI hope you make it, Danny.", "https://t.co/vFZiV5j8XD", "RT @BadVaccineTakes: https://t.co/HgtP4itsFU", "https://t.co/uoO3vYsoik", "https://t.co/yJhHss3bPK", "Context: Of course the unvaccinated *are* dying. Disproportionately so. https://t.co/sgxybFvJ8B", "https://t.co/UXEcz5htuI", "https://t.co/V1GntaHMT3", "H/t: @BadHippa https://t.co/BsOhq1TLod", "@pabnau @thepolicyprof @BadLegalTakes TIL! Was not a satire account because not funny, but Chinese troll certainly explains the funny sentence.", "https://t.co/fanPSx8pQV", "https://t.co/6aLC35nQaY", "RT @BadVaccineTakes: https://t.co/8rwmMPnNd0", "Note so there's no misunderstanding: This. https://t.co/7oJOPcPIPo", "@BadVaccineTakes Sorry, someone sent this to me; should have checked.", "@ncanarchist Two-fers are a thing.", "https://t.co/tJBQ1WPzMk", "Context: https://t.co/oJxPNPbAZm", "https://t.co/Y5vlCmHMnM", "RT @BadVaccineTakes: https://t.co/eLYB9eWDki", "RT @BadVaccineTakes: https://t.co/eJobMnGvgq", "Context: in previous waves, COVID minimizers at least initially called the waves a “casedemics”—supposedly fake pandemics caused by excess testing. But lots of people died weeks after cases rose.\n\nUnironic use of term “casedemic” is the fastest way to identify a bad coronapundit. https://t.co/6DU9Dnq2vV", "https://t.co/XuHT7x2msr", "@BadVaccineTakes Nice screenname though. https://t.co/DtN2SpnHgz", "Context: @BadVaccineTakes and others have pointed out this lie, but it continues to do numbers on Gab. https://t.co/Ro8tA9EPVm", "https://t.co/4Q3Kd9ZVD1", "https://t.co/Jd2EZJG6bz", "@RachelAlter007 @ENirenberg @AmyOztan My uncle's bookie took modern dance lessons and now 🍴 sick to him when they crank up the sinko ghee. https://t.co/XWjtf1PeqN", "RT @BadLegalTakes: https://t.co/KHaf1EV5Bp", "https://t.co/BGry0QGaab", "RT @BadVaccineTakes: https://t.co/7XUP4up5dn", "@BadVaccineTakes They're replaying all the classics. https://t.co/Doq8SI8Szk", "https://t.co/WEIyvF5r7F", "h/t: @BadHippa.\n\nIncidentally, sorry for the slow rate of posts; I'm crazy busy with work.", "@BidenKnuckle @BadHippa Oh, I should add: h/t @BadHippa", "https://t.co/Eqgv2ME2oa", "https://t.co/lgr2aUEZAF", "RT @BadVaccineTakes: https://t.co/AQVIKG0mfG", "Ben Tapper sent a similar tweet yesterday, claiming that these three presidents might have been killed for opposing vaccines. His Twitter account is now suspended. https://t.co/iTCYw6WPGR", "RT @BadLegalTakes: https://t.co/BJfYtF5s0I", "@scotbot @jonhorsley1 My mistake. To be even more fair, even if she were English, she's often bonkers because that's how she is.", "TBF, she is English and may be especially punch-drunk today because of the game. \n\nThis is part of a series of quarters that's been in the works for years. https://t.co/4OmEc9tV5a", "https://t.co/w8mQJkEX6r", "https://t.co/9jaCIlJAFx", "@LarissaMVLopez You're right. Deleted.", "https://t.co/yGtHPpVndP", "RT @BadMedicalTakes: https://t.co/pOAM8cntcS", "https://t.co/AiwZekAdyn", "https://t.co/QbMiz1mB6L", "https://t.co/49Q8L4DKt7", "https://t.co/NzSFlL3Amw", "RT @BadVaccineTakes: https://t.co/miFBqonDmM", "@BadHippa In the replies to my tweet: planning a class action lawsuit against the supreme court(s). https://t.co/q9oM4Hf0ti", "These are popular takes among woo anon accounts right now. It turns out viruses spread even when you don't test for them. https://t.co/Hiagigwpl6", "Context: Two of the three likely died of COVID after proclaiming that God/prayer would protect them and suppressing information. And Burundi's president died June 2020 (before vaccines) when he was already on his way out of his presidency. https://t.co/Ba2Smevpuk", "https://t.co/AG5ik3LwQB", "@mistahbuhau @NiceMangos Can you send me a link? This image has been kicking around over a year, but not clear to me woman wasn't trolling. Sincere celebration of it would be a bad take though.", "@BadHippa No one reads to the end. https://t.co/SToJDmojRK", "https://t.co/YCf6eqrLID", "https://t.co/FzZbRsaXOg", "https://t.co/PR8GQ8AFcZ", "As a reminder: I've never accepted a penny from anyone for this account, and I was reluctant to give a macro beer mentions, but the replies are bonkers. Earlier, by @BadVaccineTakes: https://t.co/gkr04q5zek", "https://t.co/hZY1Wj3egA", "@jholloway83 @laurenboebert https://t.co/okcqq3qjAv", "RT @BadVaccineTakes: https://t.co/FX2SArqvVx", "h/t: @BadHippa, who is pretty much a Twitter art dealer according to PDUFA and the Magna Carta.", "https://t.co/AasruvlW53", "Context: The video doesn't contain \"proof,\" it's just Jane Ruby breathlessly describing a document that doesn't actually measure graphene oxide, while calling it \"murder\" and \"genocide.\"\n\nBunk. https://t.co/uazeJB8j8r", "https://t.co/MgQANVibI6", "https://t.co/7K4KELhiTi", "@RichardPearce @Rschooley @BadMedicalTakes Thanks. As is often the case, an account confidently saying something bizarrely wrong was just copying a huge account that did it a few hours earlier. https://t.co/2HCMdR84jn", "https://t.co/Uca1ZZjsdp", "https://t.co/RDVkwOE6Pw", "@BadVaccineTakes Also #BadAIDSTakes", "https://t.co/yILnSuKWsK", "RT @BadVaccineTakes: https://t.co/NZuRQ6BnP7", "Context: Turns out Magufuli's Covid denial and death may not be entirely coincidental. https://t.co/Hiagigwpl6", "https://t.co/HJ0H7VyHEn", "https://t.co/AqVoXv8XTr", "https://t.co/49SMMszxGy", "RT @BadLegalTakes: https://t.co/L6c7n6QPVv", "https://t.co/gBnWlOhDi6", "https://t.co/DYp6SdMYLZ", "H/t @BadHippa for flagging this take from the “Kent State gun girl.”", "https://t.co/3N2ghlfTsp", "RT @BadVaccineTakes: https://t.co/R8zSTmr4u9", "Context: A few days ago this fringe theory was blasted by Jane Ruby, who we've seen here before. The vaccines don't contain graphene, graphene is not identified microscopically, the report is not from the Spanish university; all of this is a fabrication. https://t.co/7H6IHtRrbO", "https://t.co/B41nQz6o0R", "https://t.co/9TstywUu1t", "https://t.co/amz11F6HXO", "Partial list of folks who go door-to-door in America:\n\n✉️ Letter carriers\n👨‍💼 Mormon missionaries\n🧳 Salespeople\n📋 Census workers\n🤦🏼‍♀️ Marjorie Taylor Greene https://t.co/3LDoBnlAgm", "https://t.co/2Tb4X2J8JY", "https://t.co/tlQAizfPAf", "@NichSmith @AlejandroPotre1 @BadVaccineTakes @ksorbsinnrvoice @Ducky68257909 @BadMedicalTakes OP is the one arguing that people running the study logged a death, unblinded the data, and then researchers (including the independent data monitoring committee) were like \"nah, let's keep going, but report it to VAERS instead.\"\n\nThat's not how it works.", "@BadVaccineTakes @AlejandroPotre1 @ksorbsinnrvoice @Ducky68257909 @BadMedicalTakes According to VAERS, a 1 year-old got vaccinated in December and then committed suicide with a firearm. It turns out data entry errors are a thing. https://t.co/15kv9u3979", "Finally, even if only younger deaths count for some immoral reason, ~150,000 people under 67 died of COVID. That's over seven years' worth of homicides. And orders of magnitude more than illegal immigrants or Roma people kill. https://t.co/XbB5K4DveW", "This makes sense if you think about it. If you don't die during childhood or in an accident, natural causes should tend to kill those *older* than life expectancy at birth.", "COVID-19 is not unusual in this respect. For example, the median COVID death is *younger* than median heart disease death.\n\nWhy doesn't Tucker say \"take that, doctors\" for heart attacks? https://t.co/pBIQ75xJeq", "I don't know whether of not Tucker knows how life expectancy works, but he's playing into the trope that maybe COVID deaths don't exist at all because those who died are so old. https://t.co/2fHoeVSYEC", "Context: First, the life expectancy of someone 78 is not -1. It's almost ten years (although life expectancies dropped significantly last year because of the virus). https://t.co/2lYWw0qGhN", "https://t.co/Axmpkst8iZ", "Context: Biden didn't say anything about violence or coercion, but that's how antivaxxers are framing it. https://t.co/GrJiOwjQ4d", "https://t.co/ghV7xPieUS", "RT @BadVaccineTakes: https://t.co/RORsPWPYk1", "Context: Turns out that people who believe in one conspiracy theory sometimes believe in several.\n\nh/t @kendallybrown https://t.co/0SDYAFGRR3", "https://t.co/4tMMJ8UNzO", "https://t.co/uSLnAbAs9a", "https://t.co/pWCowSx7Af", "RT @BadVaccineTakes: https://t.co/C1ZXWYNhHn", "https://t.co/Ki5qMOl5s6", "https://t.co/4mTjXHWFDl", "Context: It turns out the vaccines greatly reduce mortality, and most infections are among the unvaccinated, but Alex has ironically pivoted into \"wait two more weeks.\"\n\nh/t and additional commentary, @BadVaccineTakes: https://t.co/9lOWFwIJ2T", "https://t.co/4NCOMgjNYg", "https://t.co/5CTshsKlUw", "https://t.co/p7TsTif04S", "Context: A meme circulating among antivaxxers is that there are many more ambulances now because of covered-up vaccine injuries.\n\nTurns out that when people start noticing things, they start noticing things. Deaths are about normal in US/UK (unlike during the COVID waves). https://t.co/S6SE6VUVdA", "https://t.co/0FCKbl9t7e", "RT @BadVaccineTakes: https://t.co/JmSQLAWOew", "https://t.co/ZyOBszD3P9", "https://t.co/YCM3Ne46ds", "Sherri Tenpenny on Lindell TV. https://t.co/D8sjahc3bT", "https://t.co/IBkgE3WNEn", "https://t.co/PWYivDTJ0t", "https://t.co/nDeXaNUjEA", "RT @BadVaccineTakes: https://t.co/IkjwlpS35c", "https://t.co/CprGYw5KBv", "https://t.co/ylX7gVMAN2", "https://t.co/LIlNgjxb77", "RT @BadHippa: https://t.co/gvNZZUILu0", "@TrudgeDrudgery Worst bluelight ever. “Someone who isn't me took two hit of BNT162b2 with some molly and Doritos, but otherwise empty stomach. Then a magnet stuck to SWIM's arm. This totally happened.”", "“Swimmed” is algorithm evasion speak for “vaccinated.” https://t.co/Hix0wGDUvP", "@seannotandrew @BadLegalTakes @AriCohn When you elicit material you become liable as a publisher.", "@BadLegalTakes https://t.co/SEyuCSJ5hj", "Context: This tweet is still on Twitter 14 months later. It's a doctored photo. But the folks on CloutHub feel pretty smug about how their screenshots of blurry nonsense aren't taken down. https://t.co/QWuL1pZRv0", "https://t.co/dtYQfGLnB4", "@BadVaccineTakes Of all of the persistent tropes I see, fantasies about the value of \"unvaccinated sperm\" make me feel the ickiest.", "RT @BadMedicalTakes: https://t.co/7Bkvc4rhub", "https://t.co/H5lbWayEEf", "As it turns out EUAs are defined by law, and the “emergency” is determined by the HHS secretary, and has been ongoing since February 4, 2020—before any lockdown occurred, and before most people had even heard of the virus. https://t.co/IrMNqzoRiq", "Except that past EUAs issued for: anthrax, ebola, MERS, and zika, among other things. Remember the zika lockdown? No? Well, apparently EUAs don’t require a lockdown. https://t.co/bcoGrGf3nG", "If there are no lockdowns, the bad take theorizes, no EUAs can issue, and so approval for the vaccines must be revoked! \n\nHere’s corona-grifter Alex Berenson promoting the half-baked, legally-uninformed idea in April. https://t.co/BllWs4x0Fb", "Context: This is an old take that’s passed it’s sell-by date. Where exactly are the “lockdowns” in America?\n\nThe theory was that since “Emergency Use Authorization” has “emergency” in the title, this requires a lockdown (because hundreds of deaths a day is NBD, apparently).", "https://t.co/aU5KoKKXCu", "OP deleted the post, but wants a follow. https://t.co/sxN5iyWjO6", "A shitty YouTuber read the bunk copypasta as part of his his stupid channel reading stuff. YouTube took the video down, but it has circulated ever since among the credulous as if it actually depicts a doctor who ran these tests. \n\nMisinformation never dies.", "Context: Last year, viral misinformation spread on Facebook purporting to be from a doctor who found that all COVID samples were just flu. It was bunk. It's not even how one tests for flu. https://t.co/mRu0nSBzQs", "https://t.co/PWPL17eKtx", "@oponiak @BadHippa @HermitRambler @BadVaccineTakes @BadMedicalTakes @Antivaxxtakes @BadLegalTakes @BadJointTakes Might be worth a follow-up post: I love when the conspiracy theories bump into each other.", "Context: In most of the world, most excess deaths are uncounted COVID deaths. This is particularly clear in places like South Africa, where excess deaths peak exactly during COVID waves. (Another one happening right now, BTW; only 5% of ZA has first vax.) https://t.co/gbU3Z6tkjC", "https://t.co/PpG8uhgFXU", "RT @BadLegalTakes: https://t.co/tToTcoFX8i", "Context: The main problem with this take is that the mRNA vaccines don't alter DNA. https://t.co/SSfUz7NMTg\n\nBut the patent litigator in me must also observe that the Supreme Court didn't even decide the § 101 patent eligibility question for modified DNA sequences. https://t.co/LgzC8TYM5C", "https://t.co/z0QrBJxRpe", "Also, cynically hypocritical. https://t.co/fFvmorouvy", "Malone has decided to become a coronagrifter, proclaiming himself to be the \"inventor of mRNA\" on the basis of being the middle author of a handful of publications. It's a stretch. https://t.co/Dk03xohq9E", "Companies disclose things that could go wrong so that if something does go wrong the board can defend a lawsuit by saying it was properly disclosed.\n\nModerna notes their mRNA products don't alter DNA, but if another company's is bad, mRNA tech could be viewed with suspicion. https://t.co/cnbUVhsvqx", "Context: It's not gene therapy. Malone is citing an SEC document from a year ago he knows is misleading. https://t.co/X5DOQFoxyZ", "https://t.co/zRVaj6Lkhj", "https://t.co/lct6EaZH4s", "https://t.co/w4MZDhwJ4S", "https://t.co/ojpKk4MusI", "Context: Sampling acidic food breaks the test. “If you completely ignore the manufacturer’s instructions or in fact use the test for something completely different, then you shouldn’t really be surprised if you get a silly result.” https://t.co/WREaC8MMwT", "https://t.co/CeRi4xR7gj", "https://t.co/NOqe5Ry7IU", "@Noahpinion I redact handles when it appears to be a personal account with few followers. My followers often complain about it, but screenshotting is broadcasting a bad take, not a dialog of equals.\n\nSocial media mobs are not known for nuanced proportionality.", "RT @BadVaccineTakes: https://t.co/ulSfrsx5t6", "https://t.co/yRzbdJ5eTe", "Context: It turns out that's what an exponential chart is. https://t.co/odL2u6g55M\n\nh/t @cjsnowdon, @OldMackIsBack", "https://t.co/X8sUrJNKI1", "RT @BadHippa: https://t.co/76Zstgjq4Y", "h/t @BadVaccineTakes, who you should really follow if you want more (vax-specific) bad takes.", "https://t.co/AxNf88X4DZ", "https://t.co/pUwDVQch0j", "@BadVaccineTakes Naomi Wolf was banned, but her spirit tweets on. https://t.co/LnnUMvUS2A", "https://t.co/knooSv2trB", "https://t.co/nnDUNa8iRN", "https://t.co/dV3h4aRjmr", "https://t.co/dOqHoOgZnH", "@DanielleFong @DrKellyVictory https://t.co/H0wndYSfq4", "As for the magnet videos: smooth objects stick to people just because of oiliness. https://t.co/G1Zr7RZuf7\n\nDid others not have a goofy uncle when they were young? You know, the one who claimed to be magnetic and put a coin on their forehead?", "One possibility is that they're very careful scientists who produced reliable data. The other possibility is lol, no.", "They have also recently reported on the Nazi-reptilian alien alliance allegedly covered up by the Bilderberg Group. https://t.co/utCS194Ndp", "Context: A French-language conspiracy website claims that magnets stuck to 29/30 vaccinated people and 0/30 unvaccinated people in Luxembourg. https://t.co/RR58p29LsD", "https://t.co/kj9KsEimTF", "Context: Viruses have in fact evolved to be more and less lethal over time. There isn't much evolutionary pressure for it to become less lethal. An interesting thread on this subject: https://t.co/FSc5buzq36", "https://t.co/UsUFKEHLsf", "RT @BadVaccineTakes: https://t.co/iLWFFMNQVc", "https://t.co/Rwr0ckOTw3", "RT @BadVaccineTakes: https://t.co/ykc9Z9EY2L", "Context: It turns out if you ask 981 people who were vaccinated, most did not have \"scary\" side effects. https://t.co/PFSJZgja6T", "https://t.co/IxLeHuclzr", "https://t.co/xocipecrvK", "h/t: already flagged by lots of cool people (@cjsnowdon, @s8mb, @StuartJRitchie). Sorry, I've been very busy this Toby Young Day. https://t.co/5a2peqcRbn", "https://t.co/EN56VTbLCQ", "Context: I'm halfway sure the folks who made the video intended it to be a joke. https://t.co/dUy6WTKaxJ", "(I hope cosplay court lawyer Reiner Fuellmich adds dot matrix printer manufacturers to his list of “Nuremberg 2.0” defendants, because they clearly knew about the pandemic in 1996!)", "The main “machine” involved, a thermal cycler, has been standard lab equipment for 25 years. The detection and automation has improved over time, and they’ve gotten cheaper but every lab dealing with biological material needs them. https://t.co/47Z0d2mNIO", "To elaborate: the poster and a lot of the engagement to this tweet seem to think “PCR” is something like a home pregnancy kit for COVID. In fact it’s a broad technique used for all sorts of DNA-amplification purposes for decades. A thread on it: https://t.co/KoompjVj7i", "Context: Say you have no idea what PCR is without saying you have no idea what PCR is. https://t.co/gas2nJBeTN", "https://t.co/Dk9WVvSA4j", "https://t.co/7jr73GrfV6", "https://t.co/dkv8STidIe", "https://t.co/Q0r4OVKvbu", "RT @BadVaccineTakes: https://t.co/ap33Kafdz1", "https://t.co/EbWUwSQ5Yd", "Photo credit @FrankCogliano. I don't normally run random signs because they could be forgeries, but the website on this one is real and as nutty as you'd expect. https://t.co/DxZsgQJk2a", "https://t.co/NzfhkAGuYc", "https://t.co/ocDudZt93j", "@BadVaccineTakes 1 for 3 on conclusions is pretty good.", "https://t.co/cC9zl8Pn2y", "@davidbix Link to this hearing?", "RT @BadVaccineTakes: https://t.co/80pHHkX1Lr", "https://t.co/EGmOclYagO", "https://t.co/uFOSVOSTGJ", "RT @BadVaccineTakes: https://t.co/RF1MsN2TPs", "h/t: @patriottakes. TIL that there's an app call CloutHub, where bad takes breed like rabbits. https://t.co/qX6PiGWKme", "https://t.co/Q5K3cIFs1w", "https://t.co/Ff9asSlVUu", "https://t.co/c1vhdgMiCg", "https://t.co/q2qoyIiOkc", "RT @BadVaccineTakes: https://t.co/iexqLfEfzB", "Context: \"They\" are doing a terrible job suppressing knowledge of the immune system. https://t.co/E4eEMDstg0", "https://t.co/2RmCXUzpSn", "https://t.co/9rWT4JByYa", "Context: Apparently wicked scientists don't repeat their villainous scheme in parentheses to make it easier for dumb Instagrammers to understand.\n\nNot this time, anyway. https://t.co/MxvgvSh4UH", "https://t.co/eccFYXrWSQ", "https://t.co/1UCjdBzLyU", "https://t.co/cKVGOGlAbS", "https://t.co/t2mU963Th2", "https://t.co/1tJBMsPOpe", "RT @BadHippa: https://t.co/BFpO5ZDDuE", "@Popehat @BadLegalTakes Figuratively tho.", "https://t.co/K64HxEJf6B", "https://t.co/Mb25nh4EIn", "https://t.co/JCqfS7DxUG", "RT @BadVaccineTakes: https://t.co/rCwyh4ieIX", "@mmyotis https://t.co/SIC3bmBtdy", "David and Gareth Icke have promoted the idea that COVID deaths were only caused by midazolam use—that NHS doctors more or less conspired to murder tens of thousands of people. They did not. https://t.co/OqKrt6PRj7", "Context: Patients with painful breathing are often given benzodiazepines like midazolam. For this reason, it was in short supply at the height of the pandemic. COVID-19 is a painful way to die, the drug is palliative care as it has been for years. https://t.co/C629W5k5l6", "https://t.co/oECBXLPtTY", "https://t.co/uraRF6wN77", "https://t.co/CUdB9l6JXG", "https://t.co/2T9sab8Clx", "https://t.co/62gkqZ7KnT", "RT @BadVaccineTakes: https://t.co/lW9GVv8qds", "https://t.co/UeMeKDoygd", "https://t.co/skymGmEoOd", "Context: Apart from neither fatness nor heart disease being contagious, the biggest risk factor with COVID is age. By far.\n\nVery obese people might have up double the risk of death by COVID, but very old people can have hundreds of times the risk. https://t.co/xvuZWfT4UZ", "https://t.co/0Hv4arrYJK", "RT @BadLegalTakes: https://t.co/SxH6Ew8RHj", "Context: “dancer” = popular antivax term for those who've been vaccinated to avoid being flagged by algorithms on social media. This IG story claims vaccinated people smell like chemicals.", "https://t.co/xf2hGpkEVd", "RT @BadVaccineTakes: https://t.co/LqdraQRqnJ", "Context: Something like 75% of New England is vaccinated, with no uptick in overall mortality. Even with the delta variant, UK continues to have negative excess deaths.\n\nYet panic pornographer Alex Berenson continues hyping anecdotes about the vaccines. https://t.co/rX5OjPI3Lq https://t.co/Nbim04IxpC", "https://t.co/Mfnj8IRbJF", "https://t.co/3JUpQYOsvW", "https://t.co/VN05WwoLI6", "Context: this one has been kicking around for a while. Totally made up = 6k likes on Instagram. https://t.co/vIulSSk75m", "https://t.co/ZP9G3ozOit", "https://t.co/P83B7ZwVSL", "https://t.co/g79P6RXUnD", "https://t.co/wcKD9wjQkI", "@BadVaccineTakes Next hot vaccine side-effect! You heard it here first. https://t.co/BKclwu2taP", "RT @BadVaccineTakes: https://t.co/xduUO0kBEe", "@BadVaccineTakes Dang, I was waiting for this one. Earlier ones were more ambivalent about whether could instead be explained by “cinco gee,” chemtrails, “m0rgellons,” or one of her other figurative (but sometimes literal) imagined demons.", "@jmhorp Well-deserved.", "https://t.co/dEOHHnLYkS", "RT @BadVaccineTakes: https://t.co/oE7FQNhdnU", "https://t.co/AmrEdQZnYd", "https://t.co/Py5o1PKLMQ", "RT @BadVaccineTakes: https://t.co/AT3NYJirTL", "Context: A common hydroxychloroquine trope is that pharmaceutical companies or some shadowy establishment has colluded to suppress HCQ because it's not profitable.\n\nYet the first treatment proved effective is a cheap generic. https://t.co/LNHNSRLKbd", "https://t.co/rtd0LpzgrK", "RT @BadVaccineTakes: https://t.co/W42lmeSsHj", "https://t.co/BA9uaiSkUt", "https://t.co/DqvslCuXpd", "https://t.co/K158pK8ryt", "RT @BadVaccineTakes: https://t.co/8ZPlyzQFNb", "R0, the basic reproduction number, is an estimate of how many new infections each case causes on average. When one infected person infects fewer than one new person on average, the disease simply dies out. https://t.co/9qJb8ORQpf", "Context: Stacey either didn't read her own screenshot, is cynically misrepresenting it, or doesn't know what R0 means after 15 months of bad corona punditry. \n\nFauci was saying (in early March) ***if*** social distancing could make it so that R0 was less than 1, it would die out.", "https://t.co/l2ZrTvkYKR", "https://t.co/J0REj5YwEw", "https://t.co/u6rjJ2ti27", "RT @BadMedicalTakes: https://t.co/IiynPr20Qv", "h/t: @BadVaccineTakes. The second image is just to verify the first image was not making fun of preposterous side effects reported by antivaxxers. BOLO for crow attacks, I guess.", "https://t.co/aWxdJD5inr", "For example, when Tomi Lahren said that compliance was \"willful slavery.\" https://t.co/E6kbr6XHxj\n\nPeople would scoff at such a Tweet, right? So search &gt;&gt;to:TomiLahren \"willful slavery\" until:2020-4-28&lt;&lt;\n\nScroll down until you see direct replies. https://t.co/PXSryG1Qzq", "Context: Covid skeptics and QAnon truthers are actually quite gullible.\n\nBonus tip: When someone claims a tweet is real, but deleted, search for obvious things people would have replied to the outrageous tweet with. That's the best way to find deleted tweets.", "@robjGoldberg @AmosDuveen It is falsifiable though; people would respond to now-deleted tweets. In fact, I find that's the best way to locate them. CNN had this tweet up for 12 minutes and no one on the planet responded to it?", "https://t.co/sE2O0imnkA", "https://t.co/V1EZyAtoXN", "I've been inconsiderate for not tweeting the video itself. https://t.co/zTpasQAxgX", "Thinking strongly about a new background image. https://t.co/4FniL4sowV", "Context: It turns out that Americans, thankfully, are mostly not like Alex Berenson. In fact, 100 million was too low a target.", "https://t.co/V4vZ0tbRVP", "https://t.co/leJNvIAcOs", "Context: Dumb memes never die, they just get blurrier as they're copied. \n\nQAnon folks like to claim *millions* of American children are sold into slavery every year. It's a disturbing fantasy.\nhttps://t.co/59fCU89ADO", "https://t.co/7DYXkEJQze", "To be clear, Suboxone seems to work for lots of people. My brother suffered from opioid addiction. No insult to the drug itself.\n\nBut might help explain why a person goes from being pharma poobah to posting Laura Loomer videos and spreading insane FUD about vaccines.", "Maybe kids take it by mistake? Turns out that the manufacturer looked into that, and found they did more than alternatives. But medical affairs dept. (which communicates with drs/insurers) lied, said the opposite. Ruby's supervisor pled guilty last year. https://t.co/N1PCo0ZfcU", "See, Suboxone is a combination of an opioid and naloxone, the opioid agonist intended to treat addition. The naloxone makes it possibly impossible to overdose on, so it was Schedule III, making it way easier to prescribe (sell) than methadone. But it's a dissolvable film.", "I once worked for a generic drug co. trying to win approval for a generic Suboxone® (buprenorphine and naloxone). Her profile says she worked on Alzheimer's research, but her publications are mostly Suboxone. I have a theory why she doesn't say that. https://t.co/ACDPA7yAzH", "There's nothing connecting this to the vaccines, which is why I was surprised that Jane Ruby actually does have publications. In fact, her name was familiar to me.\n\nI don't like talking about myself much, but what seems like a lifetime ago I did pharmaceutical patent litigation.", "Ruby doesn't say which PubMed article she has in mind, but I've seen this one cited. It has nothing to do with approved mRNA vaccines. In fact, as the title says, it's about DNA vaccines. https://t.co/nLvLq1lzqR", "Context: The purported expert Jane Ruby here encourages viewers to \"do the research yourself; you can look at the government's website PubMed.\" But PubMed hosts all research. These vaccines don't use what Ruby calls \"magneto infection.\" https://t.co/MmD7urx1DC", "https://t.co/6fBZyz16Fa", "RT @BadVaccineTakes: https://t.co/VYglzdgtRC", "https://t.co/2IuzhmNkor", "RT @BadLegalTakes: https://t.co/q8e8cloAJ4", "I've been reluctant to post troll-looking accounts, because definitionally I'm not sure troll farm output counts as a “take.” But they're often funny, sometimes illuminating, so I will confine them to this thread with my old Bill Mitchell rules (no more than one post in ten). https://t.co/ACOYs3iKR1", "h/t: @cjsnowdon. Ivor responded to the criticism by posting a picture of David Cameron at a Jewish funeral because that's a totally normal thing to post. https://t.co/gbUhD3IFpn", "https://t.co/1SlZCA4dwu", "@BadLegalTakes When you need HIPAA 'splaining, ask for @BadHippa by name. Accept no substitutes.", "RT @BadVaccineTakes: https://t.co/spj8kNBxWw", "https://t.co/Geo94YZvmU", "https://t.co/MsNYx8o2Si", "RT @BadLegalTakes: https://t.co/BJX1LkQ8Mu", "https://t.co/6MOWFyD4eu", "One country's president tested this idea. Turns out viruses spread even when you don't test for them. https://t.co/Hiagigwpl6", "https://t.co/sV24fDVTLh", "RT @BadVaccineTakes: https://t.co/R5VTsxUOX8", "https://t.co/Xnx9mXq2SD", "https://t.co/x7BeEBW0pN", "Perhaps the judge is referring VAERS numbers (we can't tell because he gave no citation). Those aren't deaths \"from\" the vaccine; they're simply reported deaths. With half of the country now vaccinated, a lot of people will coincidentally die. https://t.co/4hzdTGguAQ", "The CDC determined that 3 deaths are \"plausibly\" linked to the J&amp;J vaccine out of millions of doses administered. Even the recent San Jose VTA shooting is more than that.\nhttps://t.co/AoAzSneKXD", "Context: I looked through the docket. It doesn't seem like anyone argued for or against this claim. It went from being a Facebook meme (or misremembered Fox News segment) to a federal decision with no intermediate steps.\n\nIt's false. https://t.co/FPfqh2JG4Q", "https://t.co/qS5xj4oWhS", "https://t.co/StJukU6ckn", "Context: Offering a chance for a prize isn't coercion by any sane definition. Perhaps he means the taxes are coercion, but the same taxation funds his salary which benefits no one except Massie (who favored this appropriation, BTW). https://t.co/52esrpINXN\n\nh/t: @jmhorp.", "https://t.co/8M0vnioHy1", "https://t.co/qLt6diGwTt", "h/t: @BadVaccineTakes. https://t.co/jJop1DSsIC", "https://t.co/QnI7UNuKNK", "https://t.co/kW6eNGcYi4", "https://t.co/Z6v33Yqn4K", "@DocMCohen @Twitter This is true. She may have been the goofiest, but was unlikely the most influential. More damaging accounts exist.", "@SirajAHashmi inshallah, habibi", "@BadVaccineTakes @BadHippa Suspending her seems almost gratuitous. So much goofy material; she's almost a pro-vax PSA. (Though maybe I'm wrong; she did aquire tens of thousands of followers recently.)\n\nI suspect the most damaging antivaxxers don't tweet about time travel and suspicious clouds.", "While this might have been her last bad take on Twitter, I'm optimistic we'll hear more about shedding, square clouds, impeachment, and time travel nanopatticles from her visiting fellowship at @aier, the super serious think tank that hired her in March. https://t.co/gzhkyIhJHR", "Death recorded. https://t.co/jt0G6S1OCR", "https://t.co/okOlm6yv3S", "This reply from a verified account with 515 followers is serious. https://t.co/rFreoiDod6", "@DimensioT @BadVaccineTakes @VaxxersAnti @TinFoilAwards Nanopatticles! https://t.co/CXbgbZ9wms", "https://t.co/JLIPuwuWi0", "@BadVaccineTakes @VaxxersAnti @TinFoilAwards A lot of people apparently don't remember being 8 and seeing their goofy uncle stick a quarter to their forehead. It's strange. Maybe I have a lucky upbringing?", "RT @BadVaccineTakes: https://t.co/GQV0KEUSdv", "@turts__ Yes, they're all deleted except the tweet where he loves being on Twitter. There were a few more besides these. https://t.co/Ps1xdeKGZL", "https://t.co/X1t76KsPgI", "https://t.co/F5KciBVJHG", "RT @BadVaccineTakes: https://t.co/9QACwPkXRr", "https://t.co/VcSRY39vmk", "https://t.co/2RiN9hbFT7", "https://t.co/tJKrgV8wjW", "https://t.co/bK4Dg4aC9f", "I'm getting old, because I totally forgot this isn't even her first impeachment-related bad COVID take.  https://t.co/hNdI02T6IP", "https://t.co/RRpaajvsRZ", "TBF Naomi Wolf might believe the Biden administration has access to a vaccine-induced time machine, so with that assumption maybe it makes sense. https://t.co/CXbgbZ9wms", "https://t.co/IRw16C8yst", "Context and h/t: @walterolson. The rule is pretty simple, but that's not it. Also tagging @BadHippa on general principle. https://t.co/BVYLqiRcwz", "https://t.co/FgWScS35yN", "https://t.co/h2VfzjuGqk", "h/t: @patriottakes", "https://t.co/TXud12VmrN", "h/t and fact-check via @gorskon. Everyone dies. Also: https://t.co/vdtybL7lsX", "https://t.co/0pRe2ffHI5", "RT @BadVaccineTakes: https://t.co/HlTASzftOS", "Context: For those unfamiliar with #magnetchallenge, bunch of people seem to actually believe the vaccines turn arms magnetic due to nanobots, on the basis of videos like the one posted. https://t.co/64XdTSteo2", "https://t.co/NooXt2eNv6", "https://t.co/ZKBVe1yGP1", "https://t.co/A6WTNHNuBD", "https://t.co/WbY8Zm95ga", "https://t.co/qVH8j1ruyU", "RT @BadVaccineTakes: https://t.co/2Hv2B6Dlon", "https://t.co/rmM7LAMhU6", "RT @BadLegalTakes: https://t.co/R0LRunH0B7", "https://t.co/dVXAV8y4Ro", "RT @BadVaccineTakes: https://t.co/I6JR6lEwHY", "https://t.co/UsytsndKQ2", "As for the tweet itself, \"CryptoPirate\" from China screenshot a tweet sent almost a year ago by a QAnon theorist banned from Twitter in the post-January 6 purge. https://t.co/hDhy82WqoP", "Context: This is an old, old one, but misinformation outlives everything. The opening ceremonies routine was celebrating the NHS, hence old-timey hospital beds. The virus symbol was doctored, and it was the Queen of Hearts in the bed, not Boris.  https://t.co/UITOlCkG44", "https://t.co/b5vaZWKcUR", "@BadVaccineTakes That's why the EMA, reviewing these same studies, wasn't concerned. https://t.co/cyUcdPzN0r https://t.co/mk5By0Su2t", "@BadVaccineTakes Especially true in the case of the mRNA used in these studies. Less than one tenth of one percent of megadose made it to rat ovaries.\n\nOh, and it's not a leaked document. Antivaxxers love to get clout by rehashing old stuff as \"leaked.\" Rarely true. https://t.co/gSMn6Zzk4V", "Context: The tweet cuts off a the first page of results showing that nearly all of the massive overdose injection stays at the injection site or goes to the liver where it's metabolized.\n\nh/t: @BadVaccineTakes for tracking this down. https://t.co/kwAn69o8H2", "https://t.co/hJ8qg2VXS9", "@SirajAHashmi Nice", "https://t.co/Y11AUjg5yQ", "https://t.co/fVwCwTA6Ur", "https://t.co/6YEG9Fqd3D", "RT @BadLegalTakes: https://t.co/57PSoFcGYc", "https://t.co/OAvz70H5xW", "https://t.co/Ci7XE0M2Kz", "Second: there are no fetal cell lines at all used in the production of the mRNA vaccines. And the cell lines used to test the vaccines were derived from fetuses aborted decades ago. In vitro testing on existing cell lines simply does not promote abortion.  https://t.co/wASa0JtlkD", "Absolute risk reduction just isn't a measure of efficacy; it depends on the study protocols. Fewer people get infected over shorter studies. And authors of the paper admit that relative risk reductions have held up in Israel close to 95%.", "Context: Bunch of folks are misunderstanding this comment to mean that vaccines are ~1% effective, but the absolute risk reduction is misleading too. The background rate of COVID was 0.9% in the Pfizer control group, and 0.06% for vaccinated. Huge drop. https://t.co/FGpJ9EjV7e", "https://t.co/ZYfP6u5RaV", "https://t.co/lztna3ah1q", "https://t.co/iFFOul7XBo", "RT @BadMedicalTakes: https://t.co/Mw5OIwlnCi", "https://t.co/UCI97wUa0U", "Via Minnesota Public Radio. https://t.co/vOo6M7tF4P", "Context: This motion is as bonkers as you'd expect from something filed by America's Frontline Doctors, the folks who introduced us to the demon semen lady. The ALLCAPS argument is just false, as I've previously covered. https://t.co/SB7yPLcrXi", "https://t.co/oK1ztm3K9w", "https://t.co/qkxqyieOdU", "https://t.co/spn0grVINA", "RT @BadVaccineTakes: https://t.co/BM6aTJHO26", "Very sorry, I meant to attach this tweet as an example of his cynical election fraud grifting phase.\n\n(This story was obviously a lie because of, wait for it... COVID. The Supreme Court had been meeting remotely for months.) \n\nAlso h/t for OP: @thereal_truther https://t.co/taLQRvn7Jl", "https://t.co/ZTJeVYZ82s", "@BadMedicalTakes Some sort of EGOT for bad takes in progress. https://t.co/SQNHiWaCTT", "Context: User gained 80,000 followers and started a subscription website based on mostly wrong pronouncements about the virus\n\n(Before losing 20,000 followers after January 6. To be fair, the virus was not the only thing he picked up followers and was wrong about.) https://t.co/jwJf3F2hKM", "https://t.co/9yCVyCqzIn", "@BadMedicalTakes https://t.co/3jGRjfsPyz", "Context: Garret thinks investigating the origins of Covid is means identifying which \"toxins\" cause it, because he is certain viruses don't spread disease. https://t.co/SODxPs7zCL", "https://t.co/2XTAhM94oF", "@BadVaccineTakes Oh, sorry, someone DM'd me this and I didn't realize you'd already posted.", "https://t.co/oQcr3J0CzA", "https://t.co/LBlA8Ou2p8", "https://t.co/ge7MTLESok", "https://t.co/ejaabUiFkJ", "https://t.co/3XBAzXg7pH", "RT @BadLegalTakes: https://t.co/TXNOeJ6m7M", "RT @BadVaccineTakes: https://t.co/l5CRo6D14L", "Context: It turns out that when you have  33,000 antivax followers, you can go from never having heard of an alleged “shedding” side effect to being really sure that vaccinated people cause it within one hour.", "https://t.co/TgZPYnUX2F", "https://t.co/uh6rKTgUZ2", "https://t.co/Z7ONFr70BH", "Context: This FAQ answers a bunch of goofy COVID/blood donation theories. https://t.co/bhILt67vP9", "https://t.co/B4wMSEyY2n", "He does this even even though the most obvious example—the United States—has seen an almost continuous decline of cases throughout vaccination. Alex wanted it to be true so badly, and has never acknowledged how badly reality conforms to his theory. https://t.co/ohth6V58WT", "Recently, he's come close to admitting he was wrong about the vaccines. But he could only do it without admitting that he, Alex Berenson, promoted the unfounded fear. And he did it while promoting another unfounded theory—that vaccines cause a spike in cases. https://t.co/kyqXBZIeCB", "Context: Israel confronted a wave as it rolled out vaccines. Alex said this was proof the vaccines didn’t work. Later, neighboring countries saw a larger spike and Alex blamed the small numbers of vaccines administered in these countries. It's unfalsifiable dogma. https://t.co/hshiC5wlFR", "https://t.co/O1JNxVONEd", "h/t: This tweet from ten months ago was featured in @cjsnowdon's excellent history of Ivor Cummins' evolving bad takes. https://t.co/QcKsJJv0Qu", "https://t.co/yk2r7to78b", "https://t.co/E3OypStMBe", "https://t.co/Q2i1sSJx5b", "RT @BadVaccineTakes: https://t.co/7xZKD7nAN9", "RT @BadLegalTakes: https://t.co/WF2QqTX5ZE", "Michael Flynn, May 21: “I've been taking hydrochloroquine for 30 years!” https://t.co/yjh2rt653m", "Context: No, Japan says you shouldn’t give blood *for 48 hours*, which is actually less restrictive than the guidance for some other vaccines. https://t.co/C0TBeYzHMm\n\nh/t @BadVaccineTakes", "https://t.co/S1zQ6wSXr0", "Update: https://t.co/5qDeXq0apl", "This is an old antivax trope that's been getting a lot of traction on Instagram and antivax Facebook groups. One problem for the theory is that the vaccines produce barely-detectable concentrations of spikes in the bloodstream, let through pores. https://t.co/XB55pmVCNx", "Context: An example of the “shedding” meme where unvaccinated people (who can't complain about side effects themselves) claim to have health problems by being *near* vaccinated people who supposedly “shed” spike proteins. Earlier 🧵:  https://t.co/UN3qFp9Whg", "https://t.co/y6qzgdybZc", "Context: One could read this statement as saying that it a trial run on dealing with an infectious disease; that now we can iron out some kinks.\n\nBut that's not what supporters of this tweet mean. They're courting the conspiracy theory demographic. https://t.co/dzwWovKCyE", "https://t.co/wvfkAR64Yj", "https://t.co/8Efw9VEN25", "Thread on why it would be great if it were true. https://t.co/CCtgod4uIf", "h/t @BadVaccineTakes", "Context: almost certainly they misunderstand part of the Pfizer protocol, which doesn't suggest anything is \"shedding,\" as explained in this thread. https://t.co/UN3qFp9Whg\n\nh/t @cwarzel.", "https://t.co/MfLBdjrXbR", "https://t.co/PVFV6a4UY8", "https://t.co/YsaGxnokoF", "https://t.co/Dy7LomGN00", "RT @BadVaccineTakes: https://t.co/42yuSLgfrh", "https://t.co/qUWby2t5V1", "@M_Jensen23 @NickJFuentes @adorned_heart https://t.co/jbEc7sPxiF", "https://t.co/8Y76lN0ZIR", "RT @BadLegalTakes: https://t.co/ZDIvn9hw09", "https://t.co/yTyk7kmdMF", "https://t.co/VOuenfLxQi", "RT @BadLegalTakes: https://t.co/gC9sZhUnWT", "https://t.co/r7K2kUSckd", "https://t.co/DV7JD074cJ", "RT @BadLegalTakes: https://t.co/7ZoO5ZMOTC", "https://t.co/MVbX50Soqh", "https://t.co/lEDICUq9pc", "RT @BadHippa: https://t.co/d9wpT1OPXM", "Instead, variants are discovered by sequencing the RNA of sampled viruses. By sequencing *thousands* of samples. https://t.co/tSVyXb95J0\n\nIt's not a photogenic process. You'd not be able to see variants microscopically; often just a few amino acids are different.", "Context: There's a segment of skeptics that excited proclaims that PCR cannot identify variants, which is true-ish. PCR usually primes for sequences to capture any variants, but variant-specific tests exist and could emerge by accident as well. https://t.co/tovzaJXwiF", "https://t.co/N2HKxLAf7T", "https://t.co/UYCN1QYJiY", "https://t.co/2ybh7RWenT", "https://t.co/TEEL5Vfthe", "So close, yet so far. https://t.co/5q8Ayy39Gy", "https://t.co/kBwnH7Wadc", "https://t.co/1zFg7JtUyP", "https://t.co/4KAQLkGePo", "https://t.co/bhvgOPHJZS", "RT @BadVaccineTakes: https://t.co/IJ7NEbuXR9", "...rest of message. https://t.co/0gdAjeMsP5", "https://t.co/QNWChqnEWJ", "Context: It's still not the flu.\n\nIoannidis' 0.15% estimate was not adopted by WHO and is clearly wrong because many countries (including USA) have higher population fatality rates, let alone those infected.\n\nh/t @MarcoPiani, who annotates the many errors. https://t.co/3OH9BY8Ndr", "https://t.co/oILrsFsVyz", "Context: Airplanes exist and fly between these countries.\n\nAlso, many other countries have sequenced this variant. https://t.co/89cey6G4bi", "Anyhow, MSDSs are silly documents.  Sand has a cancer warning. Sand. Chemists never look at them because everything sounds hazardous; they're written by manufacturers' lawyers to hypothetically minimize liability. https://t.co/M5aRxwgs7E\n\nTLDR: Don't listen to antivaxxers.", "In fact, the vaccine contains no chloroform, so the data sheet is irrelevant. https://t.co/WTGvYYUNsw", "Context: A famous antivaxxer is promoting the idea that the Moderna vaccine contains a hazardous compound by linking to a material safety data sheet (MSDS) for a non-pharmaceutical grade mixture that's 90% chloroform. https://t.co/gmahyllyRk", "https://t.co/P55XeiSMzH", "https://t.co/SxhnCppjux", "https://t.co/GTmAk6NyUk", "https://t.co/sqTpuAY4UK", "https://t.co/FvPU3UpQj7", "RT @BadLegalTakes: https://t.co/JBR2CYn9nr", "They also misrepresent a CDC document concerning development of PCR testing protocols in early 2020, when \"quantified\" samples of the virus were unavailable. This doesn't mean is hasn't been isolated now. In fact it was isolated earlier but not quantified. https://t.co/LeLvjBOjph", "Context: They claim COVID has never been isolated because someone sent NHS England an FOIA request for such documents. This is because NHS has no obligation to research public documents, but they did cite this in their response, which describes isolation. https://t.co/BdSGaRSUBY", "https://t.co/0qtnIiHg1e", "Mental illnesses exist when they can be blamed on masks, I guess. https://t.co/Gk4WiJ7HMY", "One year ago, Knut Wittkowski on Laura Ingraham Show: “after 3, 4, 5 weeks, the whole thing is over.” https://t.co/9tiK0JQ9UA", "Oh, that explains all the frog avatars in my mentions. https://t.co/C22ME5nW6h", "RT @BadVaccineTakes: https://t.co/KcPTKJ0S94", "https://t.co/Wyr20ZGQ4j", "https://t.co/PhjzrdhLtY", "RT @BadVaccineTakes: https://t.co/1iQU0i8eTY", "https://t.co/2Io3ZDAeOl", "@jmhorp Similar. https://t.co/vKfhNFJt2Q", "h/t @jmhorp https://t.co/fZoxa9gFPr", "Accidental good take? https://t.co/iHpyKCBLAi", "https://t.co/gUFJXLlGGQ", "https://t.co/eRT0lXXFKY", "https://t.co/cX2Qpwv9Hd", "h/t (stolen from) @BadHippa.", "https://t.co/ytV3FoyfAx", "Sorry, not sorry for all the @BadLegalTakes crossovers. https://t.co/YFShnD0Yg5", "https://t.co/7Z2PZuzGjQ", "https://t.co/8uVhajjz4t", "https://t.co/Ouy58n47nW", "RT @BadLegalTakes: https://t.co/Td2FLE6hAs", "https://t.co/2cFF0pqmXJ", "https://t.co/PTbxxB1u55", "RT @BadLegalTakes: https://t.co/mmxSflpfTV", "h/t @StarsOfCovid", "https://t.co/wiOKQdqCVp", "https://t.co/b2ZpNJzGxW", "RT @BadVaccineTakes: https://t.co/mEi29qqf26", "https://t.co/mP3H91yixm", "RT @BadLegalTakes: https://t.co/9bFyjlC6wS", "https://t.co/JwyUKtZrgi", "https://t.co/PLEjpB6g8y", "RT @BadVaccineTakes: https://t.co/wIEs7Z0epU", "https://t.co/HbrkXPCv7Y", "https://t.co/RFhJ68Ufiw", "Except for getting the investment, law, corporation, and technology wrong, AIER's visiting fellow nailed it. \n\nWe'll see her next time (unless Wolf is put in Twitter jail). https://t.co/ihkncoVaUA", "Biggest problem: 4. Testing for Covid does not collect DNA at all; this is a conspiracy theory. https://t.co/KCC31elEfn\n\n5. Such test results would be protected by HIPAA, so if Wolf wasn't wrong about the other things, she'd lose that too.", "3. 10X Genomics doesn’t even do diagnostic Covid testing; they're a research company. Their business is oriented researching gene expression in single-cells. You can get a favor of what they do from Google scholar. https://t.co/P8o8cldtp3", "A partial list of issues: 1. CalSTERs has invested literally 0.004% of its portfolio into the company Wolf hates. 2. CalSTERS is legally obligated to protect its members’ retirement savings, and so can’t really make decisions based on Wolf’s unique theories.", "Here Naomi Wolf suggests criminal prosecution might be necessary for a teacher’s union that invested millions into a company she says harvests DNA from children without HIPAA protections.\n\nTLDR: They don’t. That’s not how this works, that’s not how any of this works. https://t.co/Ixcetb4xQj", "https://t.co/tHYsV3VyV3", "https://t.co/sNw0uxsrkv", "Ok, fine, context: OP made a collage with a Sam Raimi movie poster and suggests that the vaccine will cause your children to go to hell. Gematria is involved? Not clear.\n\nAnyway, the Sam Raimi movie says nothing of the sort. https://t.co/tSD5s8umgI", "https://t.co/PZmLUPRpiH", "Proof? @AlexBerenson: delete your account and I'll offer you four hundred twenty Powerball and Mega Millions tickets that could be worth up to $598 million dollars! That's a life-changing sum, much, much more than hundreds of thousands of pamphlets you've sold! LMK!", "In fact, they're even more coercive because people can by endless tickets, and some in fact do ruin themselves this way. A chance for a single lottery ticket only constitutes \"coercion\" if you don't understand what a lottery is.", "Context: Alex Berenson casually suggests the Ohio governor is guilty of war crimes because lottery tickers are \"coercive.\" But by this logic, lotteries themselves are—they offer life-changing amounts of money for only $1, which even less commitment than getting the vaccine!", "https://t.co/h3IFwcdULl", "https://t.co/eFMTYDnd45", "@skeptical_nurse @thegoodgodabove @BadVaccineTakes Earliest version of this image I could find was posted by a troll, and could not find anyone sharing it unironically. If I could be sure it's a real take, I'd post it, but the \"antibody of Christ\" leads me to believe it's satire.", "NEW: The definition didn't change. Zuby tweeted something false and watched it go viral, so Breaking911 decided to call the false tweet news in hopes of achieving the same outcome.", "https://t.co/f5fMNBOnSF", "https://t.co/KEI5yN4e2h", "https://t.co/ufJ7F3FRbv", "Another claim I've often seen: that Florida has an unusual number of pneumonia deaths. This is an old idea that came from an incorrect reddit comment shared by people who should know better. https://t.co/KyykEYSfHG It's not true. https://t.co/W7iiwTNr1O", "A commentator suggests that maybe this one is a joke. No; this channel is very serious about offering genuine takes, and this is a real colliding conspiracy theory take (or, less likely, a very long and remarkably unfunny troll). https://t.co/JMDBFg50ka", "https://t.co/sCtEAb3zJp", "Context and potential silver lining. https://t.co/4G4Dz4zmzG", "@cov19treatments In fact there was just 1 stillbirth out of thousands of enrollees. The V-Safe tracking program suggests that pregnancy outcomes are right in line with what we'd expect if the vaccines had no effect on pregnancies at all. https://t.co/8kBMBwes3w https://t.co/QQWNVUKXU1", "Context: @cov19treatments, which claims to be run by doctors, knowingly lies about this study, and the highlighted quote shows the misrepresentation. There were not 14% stillbirths; almost all miscarriages were early. Their lies got hundreds of retweets. https://t.co/i8nl70CdFt", "https://t.co/oF1QtyfjQl", "RT @BadVaccineTakes: https://t.co/1jb39BWgZS", "https://t.co/fkfLbzH2wG", "https://t.co/EgXVwY9MJt", "RT @BadLegalTakes: https://t.co/ThJ2FuniG3", "https://t.co/GU8gNLjbJP", "https://t.co/VmXduJPym2", "h/t @BadWritingTakes", "https://t.co/kml7YGrzsj", "https://t.co/nrqVInhrgV", "RT @BadVaccineTakes: https://t.co/PN0UXdwbaL", "https://t.co/ZQH1tSOqd3", "RT @BadVaccineTakes: https://t.co/twfN0HCX41", "https://t.co/lQKmNjGWaj", "https://t.co/LeFbDxxzHx", "https://t.co/a9vFz7i95A", "Update: https://t.co/d9TUNJ4oYz", "https://t.co/XnmoT2E5Pu", "https://t.co/gGcLkkWWl1", "Of course, she's back. https://t.co/AnuuMq0PgU", "Turns out viruses don't care how good your musical tastes are. https://t.co/nIkvtJQ8m9", "https://t.co/yGxpvJ87RK", "RT @BadLegalTakes: https://t.co/emrKMewRrG", "Finally, yes, the vaccines work. Other mitigation played a role, but the positivity rates of Israel and the UK are absurdly low. Lower than seen since at least August; lower than anyone except countries that completely suppressed the disease.\n\nThis is our future.\nIt's bright. https://t.co/fDxfsXt6Km", "(Israel and Palestine aren't even the most mismatched counter-example of seasonality.) https://t.co/DCuuxYc5HA", "Third, seasonality! Virus is gonna virus until the summer sun, right?\n\nWait, are Israel and Palestine experiencing different seasons? Like even before the vaccine? So it turns out human behavior alters the spread of the virus? Oh. https://t.co/ACx54jNiZS", "Second, speaking of \"false positives,\" where are they? The positivity rate in Israel is less than 0.2%. Whatever false positives exist must be less than that. This was always a bogus talking point. https://t.co/jvGitklgS6", "Well, Palestine had much less testing throughout. In fact, Israel was testing SEVEN TIMES as many people as Palestine when goddeketal tweeted. It still tests five times as many people. Goddeketal abandoned his narrative as soon as it allowed him to make an antivaxx theory. https://t.co/iPG06XNtKR", "First, Covid skeptics almost uniformly denied that cases were meaningless—up until they could snapshot a plot and blame the vaccines. They'd always claim that there are lots of \"false positive\" and that unnecessary testing created a \"casedemic.\" https://t.co/S2K5zLdRGt", "Context: I'd like to walk through this, because this plot is sort of a Rosetta Stone of debunking bad takes. https://t.co/Y6vXKujVP8", "https://t.co/1z7XUXtmUc", "https://t.co/WIrZmUhbd7", "Context: Rando was arguing that reporter encouraging people to get the vaccine violated the FDA's Emergency Use Authorization because it was \"advertising.\" Turns out people expressing an opinion without being paid isn't advertising.", "https://t.co/29VmFJoc97", "https://t.co/EJGjCQcGEL", "https://t.co/qJaHXLSRjI", "To be clear: the main difference in response is not that we had a (relatively ineffective) vaccine, but that the 1957 flu epidemic was much less deadly than COVID proved to be even a year ago.", "Another good thread for those who might distrust blue checks or people on the political left. https://t.co/MNsPti1FlB", "https://t.co/OyOxngmoKF", "Update: Joel appended to his thread with this message. He didn't say \"my claim that only 4000 minors got the vaccine was wildly false, as was my claim about 0.2% fatality rate.\"\n\nHis first tweet got 2k more retweets after this.\n\nIn the last couple hours, Twitter has removed them. https://t.co/XIYfey32aP", "https://t.co/vYoipIH1Xd", "RT @BadLegalTakes: https://t.co/zbW5E2WgXY", "To be sure: masks outdoors are not necessary if you're not in a mosh pit or something, so he's arguing they're a political symbol. OK, but it's a symbol identified with being cautious about protecting folks from disease, not racial superiority. https://t.co/BFGUTyK3gu", "@HunterUtes @RealJoelSmalley Yep. https://t.co/15kv9u3979", "https://t.co/fH9rq9zZgC", "RT @BadVaccineTakes: https://t.co/MLJGHQM8Kb", "Another thread that hits these same issues. https://t.co/Vu4QNlfFcc", "Great thread on the disingenous monologue. https://t.co/ZiZWXvtkoz", "Source video clip posted here: https://t.co/z6RbvIT2x2", "This is a well known antivax trope, and it's unfortunate to see someone scaring his millions of viewers with breathless reports of 30 VAERS-reported deaths per day. https://t.co/vrRhiGECqH", "Context: So 7,700 Americans die daily on average. Many of them in strange ways. What happens when you give 44% of Americans vaccines? Well, some of them die and get reported to VAERS. That doesn't mean vaccines caused any of the deaths. https://t.co/0B3cwKUAiC", "https://t.co/ETjLrNb4Qy", "The death rate of 15-19 year-olds in the USA is about 50/100,000 per year. So if you picked 2 million at random, you would expect 80 of them to die within one month. This is less than you'd expect by chance, and it includes obvious errors and a hoax. https://t.co/m887tWfJxu", "In fact, none of the Pfizer vaccine trial events could even be reported until the results are unblinded; Joel just made that up, along with the bogus stat about 4000 minors getting shots. The actual number is over 2 million (remember 16-17 year-olds are authorized). https://t.co/AIJueyZGNy", "Here’s one of the three “permanent disabilities.” It complains about blurred (noting other possible contributing causes), but seems clear the author is not actually 5.25 years old as claimed. Data entry error. https://t.co/cOaLTegLRS", "Another of the 9 reported deaths, of a supposed nursing infant, didn’t even take vaccine, and the report appears to have been submitted by someone who saw a outright fraud on Facebook. Anyone can submit! https://t.co/e6U65fOHEq", "Context: VAERS is self-reported data and not even error-checked.\n\nSo the report of the infant vaccinated in December shooting herself? Uh, that’s not a Pfizer trial participant, Joel. That's a data entry error. https://t.co/lYccTFAssc", "https://t.co/gT5d3M48j7", "Here, @gorskon places this into the broader context of antivax tropes. I'm still seeing a lot of this, and will keep posting these bad takes while they remain popular. https://t.co/TvsWd2NWHh", "Here, @DrJenGunter explains what the Pfizer protocol document actually means. https://t.co/5CYxT4G0kY", "Context: Again, this non-leaked, public document describes which pregnancies should be monitored during the trial. It doesn't suggest \"shedding\" exists (which can't because there's no virus to shed). https://t.co/UN3qFp9Whg", "https://t.co/KU041DnoY8", "RT @BadVaccineTakes: https://t.co/GV6WsLlqaR", "https://t.co/2uF4tS7cFN", "Context: Wolf keeps saying that most people have not gotten the vaccine, but 74 million Americans are not adults, and most of them cannot legally take one.\n\nAmong adults, we passed 50% weeks ago.\n\nAntivaxxers are a minority except by including infants. https://t.co/Das1sBK6y1", "https://t.co/wmqTYO6fyr", "RT @BadVaccineTakes: https://t.co/NKhacv3wU1", "In fact, real-world data has shown the vaccines to be very effective, even if you're not convinced by Israel's cases approaching zero for the first time since last July while its neighbors have double-digit positivity. https://t.co/XMHG8NH7ms", "Jordan said \"this, but unironically.\" https://t.co/LHjOqiGVMd", "Context: Jordan denies that Israel's current level of cases (approaching nil, with a positivity rate of 0.1%) is remarkable, says it doesn't show the vaccines are working, even as neighboring countries went through recent surges. Wrong. https://t.co/4zhUUHo8i4", "https://t.co/UvA64N3xP1", "For some reason Jeffrey keeps bringing up this example—America in 1957 where we had a vaccine—even as we've blown the doors off the 1957 death toll. https://t.co/cvrT6hUfwr", "Context: This was one of a series of tweets last year suggesting that the response to COVID-19 was mysterious because 70-116k died in 1957 and we didn't shut down anything!\n\nIn fact, we had a vaccine prepared within months to blunt the impact of that flu. https://t.co/pk0ADhVJmn", "https://t.co/ejrpO79PSi", "Another issue: Florida separates deaths by residents and non-residents, and prefers to show only the total for permanent resident deaths. This is true, but transparent. They report age, sex, county, tests, and date of death for both groups. https://t.co/8LnYjZoq0c", "To be clear: this isn't an endorsement of any policy and certainly not of any politician. Simply that Florida's numbers are not “massively underreported” as the take claims. https://t.co/nuAlFN9lKx", "But even Florida’s under-reporting counties are not too remarkable. Counties all over the country reported suspiciously low percentages of COVID excess deaths, and Florida ranks about the same spot in excess deaths per capita as it does COVID deaths per capita. https://t.co/ky0vTpfoXw", "Some of the same authors found that Florida overall has average excess deaths. While some rural counties have higher proportions of non-“covid” deaths than normal (suggesting undercounting), these are offset by urban counties with high rates of counting. https://t.co/7JAYJmpX6A https://t.co/eOKILvTmxz", "Some people cite coverage of this article, but it’s not actually about Florida in particular. Rural counties across the country have larger numbers of uncounted deaths, and Florida is not exceptional in this regard. https://t.co/9BVW1lcwo8", "The slowdown exactly coincided with this review, but it was subsequently cleared. Was the review a political pretext to slow numbers? If so, the DOH caught up, which we can tell because dates of death are reported. Lags from FL DOH are transparent. https://t.co/DDpthIWrTE", "Some folks cite this example, where Florida death reporting slowed down before the election. https://t.co/cI7hMJraPA The article itself explains it. “Oct. 21: Florida Surgeon General Dr. Scott Rivkees announced the state would impose another layer of review on deaths.”", "To be clear: Florida health department data is reliable. This doesn’t mean that *politicians* don’t misrepresent things; they have. https://t.co/vLROH54pI7\nFlorida currently has one of the highest positivity rates in the country. We know this *because DOH numbers are reliable.*", "https://t.co/pTS1qSGdb6", "This is far from the first time Ivor has done it, as this plot by @Marco_Piani shows.\n\nIt's not that I'm surprised that we keep repeating this error; it's just tiresome. https://t.co/POAv6rEqop", "More than a year! Here's Alex Berenson, April 9, 2020, pointing to lagged Euromomo data to claim it still wasn't as bad as the flu. Wrong. https://t.co/C4gm01eDWr\n\nDeath. Reporting. Lags.", "Context: Guys, we've been doing this for a year. How long will it take to learn that CDC and Euromomo figures have significant reporting lag? See this thread by @Marco_Piani (also h/t) https://t.co/hIJq8XjWfh", "https://t.co/Mimn4465Jv", "h/t @gorskon, who wrote about the creator, nicstinson, an influential antivaxxer that seems to have been banned on Instagram since this article was written yesterday. https://t.co/TvsWd2NWHh", "https://t.co/lvsatNDlIy", "@jschjei1 @RealCandaceO Thank you, BTW. https://t.co/oossV8R1hg", "https://t.co/4Ni8FPZJaI", "Here @gorskon wrote a survey of \"shedding\" claims, which have roots in older antivax tropes. https://t.co/TvsWd35xyP", "https://t.co/VFOpH2aofg", "h/t: @Rschooley", "https://t.co/BdSQylkcX9", "Instead, the fixation with Florida appears to be an example of what @zeynep calls polarization eating our brains. https://t.co/tYFU8jF70a\n\nAntivaxxers are bad enough casually claiming that public health statistics are fraudulent, why on earth is anyone trying to imitate them?", "Maybe you’ve heard about a study that Florida “cooked the books”? First, it didn’t quite claim that. More critically, it made a fundamental mistake in not correcting for time of death. Check out this video by an epidemiologist (especially starting 16:45). https://t.co/3M6S8Xo3E1", "Well, maybe Florida is hiding COVID deaths by misclassifying them? Does not seem so. While all states have undercounted COVID deaths to an extent, Florida’s excess deaths per capita are right in line with normal. https://t.co/DATK2Pel4q", "Context: There’s no support for this tweet at all. Currently, the positivity rate in Texas looks good. Florida is higher than most states, but in terms of deaths per capita since the beginning, Florida ranks 28th, a skosh less than average. https://t.co/9fNqF0Xrxt", "https://t.co/qz1fCZBMuT", "RT @BadVaccineTakes: https://t.co/PsDjFGNXpm", "https://t.co/ZPisaSoHWN", "Reminder: The threshold for cases didn't change, and most positives turn up in 30 or fewer cycles, so the 85-90% claim is a lie. https://t.co/dNvglmwx5W", "https://t.co/uQQfp4sThh", "https://t.co/QqPTMcP12m", "@aier Context: Naomi Wolf's cloud yelling predates COVID-19.  https://t.co/NFwWWBh2yi", "https://t.co/EIA6HKO4U0", "https://t.co/GwxOo2LhlC", "RT @BadLegalTakes: https://t.co/goJohEgxo5", "https://t.co/P9wDNRkvGY", "Peter Hitchens: Smallpox is not a virus. https://t.co/3cn36GBzty", "https://t.co/WRdsXWMVMZ", "@RajivShah01 @GYamey I guess maybe I should have shown the WSJ article itself. https://t.co/gyTHaHdKNu", "Context: When a \"how's the weather\" quickly leads to a crazy conspiracy theory, you might not be on Twitter much longer, but maybe @AIER has thinktank fellowship for you! https://t.co/BZdLdxuiVl", "RT @BadMedicalTakes: https://t.co/6gySas9XbC", "https://t.co/oRQW6v2Fob", "Context: No, the Pfizer protocol defines monitoring to ensure there are not unusual adverse events with pregnancy. It did not \"warn[] men to stay away from pregnant women,\" much less suggest any kind of harmful \"shedding\" occurs. https://t.co/UN3qFp9Whg", "https://t.co/q0LH8b5WaV", "https://t.co/LezGLxhLG2", "In fact, the number of post-vaccine miscarriages was incredibly low because virtually no one of child-bearing age in the UK had been vaccinated. As more younger women are, the background rate of miscarriages means more events occur, but doesn't suggest an actual increase. https://t.co/fmuXYrXJ6L", "This claim is based on misunderstood UK reports poorly headlined as miscarriages increasing 366% or some similar number. This isn't an increase in the total rate, or even the risk to vaccinated women.  https://t.co/T6ygJ7TPF4", "Context: CDC is monitoring pregnancies and the vaccines, and so far nothing unusual seems to be happening. https://t.co/8kBMBwes3w https://t.co/UKvanUKi8s", "https://t.co/I63712Y9ci", "https://t.co/rbPD9pDDYA", "RT @BadVaccineTakes: https://t.co/k26ZY1Lzrl", "Alex misrepresents documents like this get attention, Fox News appearances, and ultimately to sell books. He's made hundreds of thousands of dollars doing this. https://t.co/P1MRNItc7N", "Also false: his claim that \"90+%\" of COVID infections would not be found after 28 cycles of PCR. This isn't true. The *median* positive in the UK is at about that level. https://t.co/Z72aHehTi7", "Not clear to me whether he understands this, but he's written the tweet to give this false impression. https://t.co/pHdzDB9H35", "Context: Alex has written this to suggest that the threshold for counting cases with PCR cases has changed, but the document doesn't change anything about counting cases. It's about selecting samples to genetically sequence. https://t.co/k95xURxrhA", "https://t.co/xknD8GzURu", "Context: The video has nothing to do with a \"vaxx brigade.\" Police wanted to shut down a fair during lockdown, not forcibly test or vaccinate anyone. https://t.co/wHJppWxjzx", "https://t.co/dfmtydd8Ke", "Again, I'm optimistic we can get there soon, but only through vaccination. https://t.co/vAWEccStsN https://t.co/9eiArtyXho", "Weirdly, Makary cites Manaus as a triumph of herd immunity, when it famously had not achieved herd immunity. I don't understand how he overlooked the surge of death widely discussed a month before this column. https://t.co/reW6KQucW1 https://t.co/ykNNa6hmiw", "For example, the WSJ piece relies on Ioannidis’ 0.23% IFR estimate, which is wildly wrong. If it were correct, 120% of the people of New Jersey got infections. Using unbiased surveys, the figure is almost double that. https://t.co/vAPem73IGz https://t.co/sheWKfkauB", "Context: The article Cardillo linked has a lot of questionable claims, but I haven’t run it until today because I’m optimistic we will soon have hard immunity like Israel seems close to having, if enough people ignore antivaxxers like Cardillo. https://t.co/7tIA5tZw8P", "https://t.co/9xsFbzqvsv", "https://t.co/87rQfw8Vjy", "Context: It turns out that folk like Anthony Fauci were right. In fact, they *underhyped* the timeline. They were experts, no scare quotes necessary.", "https://t.co/8g6eYiF7y4", "https://t.co/dMHsClz9Id", "Context: It's not the flu, bro.\n\nPlot on the right and h/t: @dr_barrett https://t.co/WvA9xzRAqT", "https://t.co/H5HVl2pqmA", "https://t.co/gWzyPsHOvI", "TLDR: https://t.co/GVagMvl0zX", "https://t.co/joawJ1hjMh", "Kushner April 29, 2020: country rocking again by July. https://t.co/R1TDnLRNs9", "https://t.co/rRY11A26wI", "@BadVaccineTakes Glad I'm not in his family. https://t.co/JWjPxhAG20", "So, no, Pfizer did not \"warn men to stay away from pregnant women,\" much less that the \"results were devastating.\" The protocol just describes what events will be reported. It's good that it sweeps broadly.\n\nDon't get vaccine news from Xia Brookside. https://t.co/gB3GY8htB7", "Moreover, the \"study intervention\" means the vaccine. These sentences refers to, for example, healthcare workers who might have dropped some of the vaccine on their skin. The protocol requires their data to be collected. The \"study intervention\" is not touching vaccinated people. https://t.co/q4s9lN12la", "They're citing this page, which mentions \"inhalation or skin contact,\" but it doesn't say that the vaccine can be transmitted. Instead, the protocol simply requires such pregnancies to be monitored until 6 months after the second dose. https://t.co/YxAf629Rj5 https://t.co/2HrunL6OvT", "Context: This NXT wrestler promoted a hot antivax meme. Basically, they're misunderstanding part of Pfizer's testing protocol, that was established before the Phase 3 trial began. https://t.co/O49af4TItN", "https://t.co/ivsOcdKQCi", "https://t.co/JFIbuowFMY", "He deleted embarrassing election tweets not because he cares what his followers foolishly believe, but because people were dragging him for these bad predictions.\n\nBut when he's fomenting baseless panic port about vaccines? He leaves them up. https://t.co/ETPu4OW9Na", "Context: URGENT! Alex Berenson cares more about his Twitter metrics than conveying accurate information about the vaccines.\n\nHe knows that false tweets continue to spread and that the only way to fix it is to delete them. https://t.co/JJHnzC6rdm", "https://t.co/Kt3zKeCago", "https://t.co/C6yS7eruF5", "RT @BadVaccineTakes: https://t.co/60LZuADyE4", "https://t.co/XXh8KCCV7X", "https://t.co/Q47XhmZLnJ", "https://t.co/KND7CwiD04", "https://t.co/CARkYd5VRG", "https://t.co/p0QLiWnoy9", "Turns out the virus *does* exist and people are *not* shedding because the vaccines don't contain it.\n\nUnfortunately, this is not clever satire. https://t.co/lgdKyCEIx2", "https://t.co/dj1hSl0TSx", "https://t.co/CMZjRRDL1F", "RT @BadMedicalTakes: https://t.co/TcPjNUIHcy", "https://t.co/CGbxruVP8X", "Context: The vaccines approved in Canada and the USA do not include the complete virus, so cannot cause infection, let alone \"shedding\" of the virus. https://t.co/cfDAZw5Wnh", "https://t.co/PqXOsg3S9h", "RT @BadLegalTakes: https://t.co/J7dIBuzrcn", "But now he theorizes China had COVID years ago. And Australia, New Zealand, and India too, apparently. That's preposterous. https://t.co/pTeIRTcrdH", "Context: This account previously theorized that COVID was spreading harmlessly through manure because people in the upper-midwest tested positive but weren't dying (until a few weeks later when lots of them died). https://t.co/o5MVxJisTH", "https://t.co/p7of0EkSDm", "https://t.co/iUsrJDMuCg", "Don't repeatedly call the police. Thx. https://t.co/ZtaMD8rMa9", "https://t.co/0p6guOI2Wx", "https://t.co/SCNuvnph5p", "Earlier 2020 Elon Musk COVID takes. https://t.co/oUyX88Q2th", "Context: @nehonotlishatan posted an excellent thread explaining some of the irresponsible errors of this piece. https://t.co/sZ5Q7wRFHV", "https://t.co/l6FSsDrEfS", "https://t.co/suavdADmPB", "Context: School purports to ban teachers from getting vaccine based on antivax nonsense. https://t.co/U2VNkj2VCw", "https://t.co/5tf0o21dyQ", "Shortly after the video was popularized, it was condemned by two physicians' groups as misinformation.  https://t.co/ok2Elzk72T", "Context: If the IFR were 0.02%, then 2.8 billion Americans have had the virus (9x the total population). Turn out that tests of people who suspect they have the virus aren't representative!\n\n@gorskon detailed some of the errors last year. https://t.co/d4VNlM26Xb", "https://t.co/OXf8Ld2djh", "https://t.co/TQLMvmDzFj", "https://t.co/Nfth82e9dL", "plot and h/t: @jneill", "https://t.co/tKorlIgQla", "To be clear, I really appreciate Stephanie McMahon's post. Some of the reactions are bad takes. https://t.co/ISJROEgui0", "RT @BadVaccineTakes: https://t.co/2MzyLI71iV", "https://t.co/cbU49zGq6R", "h/t @patriottakes", "https://t.co/gFSp4ES4gt", "Context: I didn't know @dakami. I'm sorry that I only learned of him because of this grifter ghoul. Seems like Dan was a great guy. https://t.co/6gMM4gB4ZK", "https://t.co/WeI160J4Os", "https://t.co/ye0Y6vypDB", "https://t.co/vhdszj3Gb4", "Context: Self-proclaimed Coronapundit can't imagine any reason the virus has become less deadly among the people previously died from the disease. https://t.co/9LuwxwfiZD", "https://t.co/2bOtnv45CA", "RT @BadVaccineTakes: https://t.co/joihXoYJoM", "Context: all of this is false. https://t.co/Y1pIIUFTnY", "https://t.co/fZB2KPTTvG", "https://t.co/FjkXOdmWRk", "Note: Twitter added to this tweet. Probably because the point of vaccination is to remain healthy. https://t.co/YZmgj7vDG0", "https://t.co/U9wd0nPBKP", "@RachelAlter007 @Daniel_Klahr Oops. I usually redact names, but I think the context makes clear this was a mic drop and not a bad take.", "https://t.co/J1NwqNIWri", "RT @BadLegalTakes: https://t.co/HS3WdFxWtO", "Context (and h/t): https://t.co/2CDUHfspO8", "https://t.co/y1fYfv6JBc", "https://t.co/lrvYGJl2fC", "https://t.co/pFjJ8yeMB2", "https://t.co/1uUHccrsVj", "https://t.co/agMSdwWPGi", "https://t.co/3aTyo47hSM", "@LAppiah @zackbeauchamp @TimOBrien @juliaoftoronto The follow-up was inspired by Zack. His point is well taken. Dunks are bad. It was cheap.\n\nWhile we're talking about accountability, is it normal @voxdotcom practice to delete paragraphs and write new material without notice? https://t.co/dBemN1CnVI", "@MWStory Sometime between Jan. 30 and Feb. 19, a new lede paragraph was written, instead criticizing the United State's measures, which were comically voluntary on January 23, and deleting references to Wuhan lockdown. No notice flagged this change. Odd! https://t.co/LpTKBL7auk https://t.co/fcJT9dAckM", "@MWStory Context: The January 2020 article is it was originally written to criticize China's strict lockdowns, ultimately successful. The article shows a lot of confidence China was making a disastrous mistake, might have considered their actions should alert us. https://t.co/lJmNN5RZzv https://t.co/hBKDJasB9L", "@MWStory Worth reading the second story, because it's valuable when people consider how they might have been wrong. It's a very good piece. https://t.co/KV2SwoW3VD", "h/t (brazenly stolen from): @MWStory", "https://t.co/zKbjDfgURg", "https://t.co/ZJjXbIjh9p", "A prediction from one year ago. https://t.co/zsPqgBdrSa", "https://t.co/oV73ZhDTfe", "Context: It turns out that without vaccines, we would still be a long way from herd immunity. h/t: @andrew_croxford", "https://t.co/EeRbsqZGpn", "RT @BadVaccineTakes: https://t.co/7Ad9j1pfmB", "https://t.co/MOzR9tSu1f", "The Post says: we're not antivax, really! https://t.co/clDJfWovDz", "https://t.co/Ww0nqOm737", "RT @BadVaccineTakes: Maybe try social distancing? https://t.co/majvNHj808", "https://t.co/myfqtOiLRn", "RT @BadLegalTakes: https://t.co/Nv9UY0R3p9", "https://t.co/w8yzPAsWqT", "https://t.co/FmNsPZj4iQ", "h/t: @WrongAgainIvor", "https://t.co/PQY7mcmIBp", "https://t.co/HcjVDRBhkp", "Context: Almost three years ago, yet no one was upset about the \"discrimination.\" https://t.co/mYb7ILdhXS", "https://t.co/IF3pfbY3IV", "https://t.co/EKnDLzmFYN", "RT @BadCOVID19Takes: https://t.co/v8DX0j0wj2", "RT @BadVaccineTakes: https://t.co/ZlyDxJJbtl", "https://t.co/chXqoB3KIx", "Even though the connection didn't pan out, and cases in high-pot use states remain low, Berenson later found coverage for a different proposition he thought vindicated him. cc:@HeerJeet https://t.co/99IxNNyJIP", "RT @BadLegalTakes: https://t.co/IOEVVTHm7M", "New York Post really covering themselves with glory on vaccine coverage. https://t.co/dAN4ZYb5R9", "https://t.co/llOo6uEc1I", "https://t.co/pVAtj0oy4Q", "Context: The “pineal gland” comment is an older bad take, but it checks out (which is to say, it remains a bad take). https://t.co/hf9zZtHB5Z https://t.co/f3rEYYit18", "https://t.co/weMUmbm7AM", "@HawkInATX I honestly can't tell. It's from an antivax community, and some commentators seemed to unironically be into QAnon. https://t.co/VxsTJ9isCs", "https://t.co/2QS0K3SAWm", "RT @BadVaccineTakes: https://t.co/Hyati7FlvJ", "Context: There's no viral infection caused by the vaccines, so no shedding. \n\nThis is not the first time Doctor (of English literature) Wolf promoted an odd idea about sweat glands. https://t.co/cS3valq4lv", "https://t.co/qrI69CFdeI", "https://t.co/2Adn09q3wK", "https://t.co/kK4FiQTfrr", "https://t.co/WVIG0g2RJg", "https://t.co/FROiy0XnWs", "h/t @SirajAHashmi", "https://t.co/m8NO5JVKDE", "https://t.co/uWfwhqxzFJ", "Context: It's not the flu. \n\nMore than 0.15% of Americans have already died, and that in some places more than 1-in-200 have, so 0.15% is not the IFR. For a longer thread criticizing the paper, see here: https://t.co/pho3EfMHDo", "https://t.co/L3ZlbfPe9h", "https://t.co/3Gup9WbSfX", "And by \"all comers,\" I mean blue checks. Plenty of people told him he seemed to be wrong, but Alex generally only responds to blue checks, doubling and tripling down. \n\nHe has never been able to understand ambiguous meaning when he has a thesis to support. https://t.co/d5TP7hQO9H", "Context: I'm posting this old take because it's illustrative of the pandemic's wrongest man. Here, Alex took a quote that was at best ambiguous and insisted against all comers it meant only 3000 people had died in NYC. https://t.co/P1MRNIKMZl https://t.co/AoSWfQUS8e", "https://t.co/STw0SUFQ9h", "https://t.co/46JzZbmqil", "https://t.co/0ZP6oBziCc", "RT @BadVaccineTakes: https://t.co/ufkfB43As9", "https://t.co/otMAR0az6h", "https://t.co/u39L0urXO8", "3. NINE MONTHS LATER, Gold reposts this old, erroneous plot, says it's data \"coming out of Switzerland,\" and gets 5000 likes. \n\nActual data coming out of CH: four times as many people died since HCQ (never suspended) was allowed again in Geneva because it doesn't cure COVID. https://t.co/XVpOjDRVwV", "2. In July, France-Soir jumped on data from Johns Hopkins that appeared to show a jump in COVID deaths. It wasn't real, but a glitch from reconciling data. No more than one person died any day in June in Switzerland. https://t.co/chMxWWv9Y9", "Context: This was a popular HCQ meme. IN JULY, when it was clearly made. But bad covid takes will outlive us all,\n\nThe facts are: \n\n1. Switzerland never stopped dispensing HCQ. One of its 26 cantons required certain prescriptions because of shortages.  https://t.co/HIKYD0bNYa", "https://t.co/ep8w3ShBrc", "Context: https://t.co/BVACpPHPPX", "https://t.co/JzvaOwXUid", "RT @BadLegalTakes: https://t.co/MCIdz2gHyd", "https://t.co/SljzgsacQC", "https://t.co/JI8eL0HRKb", "Meant to add: h/t @BadHippa.", "@danmac800 These photos are definitely a starter pack for... something. Thanks again, @danmac800! https://t.co/9jLBeKRpaC", "https://t.co/Nb8jwB3jqi", "@AnneUrsell @xjcr_j In you expert judgment, the fourth photo here's fake, or what? https://t.co/aW21Mg97wX", "@BruceHalperin They draw vaccines using ordinary syringes, but you can tell this is a Pfizer vaccine. BioNTech's address is in frame! A conspiracy theorist about ordinary CVS photo will not be convinced by video evidence; they'll just find it more suspicious. https://t.co/B8nnTWf1D3 https://t.co/y56i4F0X9Q", "https://t.co/fGHvPCPJMW", "h/t (source): @danmac800. I like to verify images. While I could not personally verify this store actually posted this sign, seems credible to me. https://t.co/Qw5dT3nwC9", "https://t.co/2HCmf5Qsda", "@SamGrundman @BadMedicalTakes https://t.co/vGhx8PyYoB", "https://t.co/3b15oUsyBI", "https://t.co/2lWhni6jp1", "RT @BadLegalTakes: https://t.co/XvSnSRPeBD", "Context: Bad takes never die. This now-banned account was spreading an desiccated OAN video arguing only 6% of deaths were \"really\" caused by the virus. This is wrong as I explained at the time. https://t.co/gGAokv5rPA", "https://t.co/3JSMUqJpnr", "https://t.co/yueMEmP6az", "RT @BadVaccineTakes: https://t.co/VS5ykehPwx", "https://t.co/dz9Fn0mHWg", "Some people find this suspicious. There isn't 98% less human interaction, so why a 98% drop? Answer: When an infected person on average passes the disease to less than one person (R0 &lt; 1), the vanishes through exponential decay. Flu simply less infectious. https://t.co/kW7DDwHYri", "Context: It turns out that mitigation used against COVID (like reduced travel, WFH, masks, avoiding groups, handwashing, etc.) is even more effective against less infectious flu. We still test for the flu, and it really is very low. https://t.co/l0252GC9jB", "https://t.co/dfsNhE5NEc", "https://t.co/YTLAWPvG1b", "https://t.co/9iYbxzkYH0", "https://t.co/mbbpiFMPmY", "https://t.co/zIwEw8zy4K", "Context: To be fair, he said Sweden wouldn't have a second wave, and they've moved on to a third wave. h/t @jmhorp, cases/deaths plot by @greg_travis.", "https://t.co/1OiGUmaavJ", "https://t.co/GFsUrzxPqg", "https://t.co/QE7R8WCypy", "https://t.co/2Xk9VyOjox", "https://t.co/gYDfDmIQEQ", "Context: The vaccines are highly effective, but they work better with more vaccinations. When most people are immune, the reproduction number of the virus drops below 1 and infections die out—even among people who can't or won't take them. https://t.co/ZhZlB2pmal", "https://t.co/JjDkcKin6x", "Context: Breakthrough infections happen, or vaccine efficacy would be 100%, and yes, even Fauci talks about this. h/t @AndreasShrugged\n\nThe underlying thread is worth reading though, so I guess Brit isn't all that bad for sharing it. https://t.co/JrrVRPeQjK", "https://t.co/4GSsIgo6De", "Context: The UK may soon reach herd immunity of a disease significantly more lethal than the flu, thanks to vaccines—not due to infections as Robin had repeatedly claimed on his 33k follower account before it was suspended. https://t.co/cDkgA6TS6k", "https://t.co/O7Xzw6lxQ3", "https://t.co/2CNZZ4Sb9x", "https://t.co/3ZmqGfVnD7", "RT @BadLegalTakes: https://t.co/lRXYiiQFMV", "@BadLegalTakes BWONG https://t.co/t9axDiS7xA", "Guys, the life expectancy at 70 is 15 additional years. Next in this video she claims anyone in their 30s who got it will die in 5-10 years. https://t.co/NhfmfOhXGs\n\nI'll do a better job providing context for life expectancy over the next 2-10 years.", "Context: This is part of a raft of videos produced by antivaxxers. https://t.co/p9dDHs1PB0", "https://t.co/32ZIgnewJx", "https://t.co/fgCEMrpSOJ", "https://t.co/Nn2nEgG6cq", "Source: https://t.co/upvgpyL5jc", "https://t.co/jToblU6Mtr", "Again, the whole point of herd immunity is that it protects everyone because the disease cannot thrive. https://t.co/wsnCVGtKdF", "Now that overall cases are racing to zero in Israel and the UK Alex argues it would have happened anyway. (By “Farr’s law” he means it burned itself out.) Sure didn't happen for the first year of pandemic and isn't happening places without high vaccinations. https://t.co/9I6FDAMPx8", "Ironically, Alex used to mock people who pointed to the collapsing cases among older vaccinated groups in Israel. That meant nothing, he claimed, because overall cases had not dropped enough for him. https://t.co/jUpPZxa4hh", "Context: Yes, when a population has enough immunized people that R0 &lt; 1, then infections for everyone drop to zero. Israel has tons of immunizations, and you can see in the very image Alex posted that the drop happened first in the elderly. https://t.co/tXzhmOqtFJ", "https://t.co/Goqo8fey4W", "TLDR: Trapt probably not a good source of mortality data or medical advice. https://t.co/lxJssCIYXG", "The idea became popular thanks to a popular but misleading graph that seemed to show pneumonia deaths collapsing. Not true; deaths lag. https://t.co/YuE5E7Ppxn", "Context: This was false, but widely believed at the time (and people still spread variations of the idea). Pneumonia has been higher than normal because COVID patients often develop it. https://t.co/1yHvLLayrL", "https://t.co/1qQCt24XPw", "https://t.co/UaDrIIUG1u", "https://t.co/qBR7FpaJn6", "https://t.co/MG11muLSwp", "@Not__William @ThekidJ_c What did it say? Might be cached somewhere.", "https://t.co/BuDc5cBQTF", "RT @BadVaccineTakes: https://t.co/G80vwdCPxS", "RT @BadLegalTakes: https://t.co/SsijTtDap9", "https://t.co/jgJl9EvyhW", "https://t.co/74WdZ2jKzi", "RT @BadMedicalTakes: https://t.co/CBOf3042tF", "RT @BadLegalTakes: https://t.co/tKxXFxo8U5", "This is even more clear when you look at the places where much more than 0.15% of the population has died of COVID. For the most part, these are places hit hard by the disease, but not with especially strict lockdowns. \n\nCOVID is really not the flu, bro. https://t.co/h9Y15aH4KZ", "The most common response to point out over a half million people died is to assert that a long of these are lockdown deaths. Yet lockdowns without COVID don't cause net excess deaths. https://t.co/ohZQqNOVcT", "Context: The short answer is that more than 0.15% of Americans have already died, and that in some places more than 1-in-200 have, so 0.15% is not the IFR. For a longer thread criticizing the paper, see here: https://t.co/pho3EfMHDo", "https://t.co/iWsQxyDBWj", "https://t.co/yIzJsK8h9U", "Context: If COVID had a 99.97% survival rate, then 1.8 billion Americans must have been infected. But it turns out that's six times the population of the country.", "https://t.co/2noCnX9RGw", "@tlcesq @chrislhayes Sorry; I deleted and reposted to fix graphics. https://t.co/1ob3ak6gdK", "Context: A year ago today, 19k had already died, but the IHME model that originally said 100-200k by Aug was revised downward to 60k, prompting Trump to take a victory lap and a variety of other bad takes. The IHME model incorrectly assumed COVID would end as fast as it began. https://t.co/xJ3tIq5DZR", "https://t.co/VH5W8yoDzV", "@BadHippa Frameable. @BadLegalTakes", "RT @BadHippa: https://t.co/wVog934Uv2", "https://t.co/wVvBuf9KEQ", "https://t.co/GAF9VfU2qw", "Kulldorff concern trolls about the lack of vaccination now, but he advocated circulating the disease—causing deaths!—to create herd immunity. It was impossible to protect the vulnerable with this strategy, but though broad immunization it'll happen. https://t.co/gzw7KAPqwO", "https://t.co/gMmTMCor3y", "RT @BadLegalTakes: https://t.co/TILmIGTQa2", "Context: The vaccines are very effective, but not *perfectly* so, and not everyone can take them. Our goal is to achieve herd immunity, where the disease cannot thrive. Lower vaccination rates makes herd immunity less likely. https://t.co/ZhZlB2pmal", "https://t.co/zAdaNnyxLE", "RT @BadCOVID19Takes: https://t.co/5MtSRta74z", "https://t.co/OjibIfhi6w", "As always, a great read on Alex Berenson. https://t.co/P1MRNIKMZl", "Berenson sometimes suggests that a lot of those deaths are \"lockdown\" deaths, but places with strict lockdowns like Australia, New Zealand, and Hawaii have had no excess deaths. Thus, excess deaths are mostly virus deaths. COVID did not end April 6, 2020. https://t.co/CH5yWeXayn", "Context: Berenson mentions PCR based on his theory that not many people actually died of the virus, but sensitive PCR testing people who were going to die anyway. But the argument doesn't work because an extra half million people *did* die last year, and not from PCR. https://t.co/FqZC5FRKdf", "https://t.co/R6uuTPkpum", "In fact, the US simply will not allow export, not even of millions of doses of the AZ vaccine we haven't approved. Op-ed concern trolls about encouraging marginal vaccinations, but says not a word about the policy actually harming the third world. https://t.co/mYn3wrvZbB", "Context: This op-ed claims that encouraging vaccinations is bad, actually, because it would encourage low-risk Americans to take vaccines ideally allocated to the third world.  That's not what's preventing the world from getting US vaccines. https://t.co/qVtcAbrlmi", "https://t.co/TCObDVW1tq", "https://t.co/nkkKVZBRUm", "RT @BadMedicalTakes: https://t.co/bgHJGVFvua", "https://t.co/kCUlO1iiud", "https://t.co/V3JdBpfaNe", "https://t.co/41KlAur2jL", "Maybe Toby believes the human lives are a fair price to pay. If so, I encourage him to say what he means. What he actually said is a bad COVID take.", "Context: To put this another way, if the UK had a death rate equal to the much less dense state of South Dakota (so doubtful they'd be that low), 22,500 more Britons would be dead. https://t.co/D2Fmau9lyU", "https://t.co/vnKuXzppKg", "@Bullwong Damn it.", "RT @NC5PhilWilliams: ONE YEAR AGO TODAY: Nashville-based @FoxSportsRadio talker @ClayTravis blamed his previous @BadCOVID19Takes on bad dat…", "https://t.co/obBhFP8lad", "Note: I cited US mortality figures above, but the same is true in UK: the vast majority of deaths list COVID as the underlying cause of death. https://t.co/HnzopDOGf8", ".. and (2) there have been hundreds of thousands of excess deaths, which are occurring when and where COVID-19 deaths are occurring, regardless of lockdown policy. Lockdowns aren't causing the excess. The virus is. https://t.co/CH5yWeXayn", "Context: Zuby suspects there are a significant number of people who \"would have died anyway.\" In fact: (1) the vast majority of reports show that as the leading cause of death, even if there are other underlying conditions... https://t.co/lxSqr94TpX", "https://t.co/XSyH1dz85z", "Context: I admit that I never read Das Kapital, but I strongly suspect @jimcramer is not a communist. https://t.co/CpKJxhTTXV", "https://t.co/6PAnvY2D29", "But other than that, nailed it. https://t.co/V1sPIZ7Vrq", "Also, check out this piece of Berenson's turn into antivax panic pornographer. https://t.co/P1MRNItc7N", "@misguidedsoul7 @jeremyfaust That's what so striking about it. It was a nuanced, considered answer. Says it should be a case-by-case choice for little ones. The replies by Ziegler and others are astonishing: they're responding to something that exists in their heads.", "@mattyglesias OK, but Dr Pepper doesn't have a period, @Twitter. #BadDrPepperTakes https://t.co/X4ANYzOgbG", "https://t.co/3SGHLKoh7N", "RT @BadLegalTakes: https://t.co/zcGDbIrdog", "@GeorgeNewman_62 BadCOVID19Takes' grammar efficacy: much lower than 95%.", "Moreover, it turns out the spread of infectious disease *does* effect other people—starting with those who catch it. And because human beings are not emotionless and fungible widgets, this effects others as well, including those who chose to get the vaccine.", "Context: Apparently this thought experiment is set up to demolish a strawman. No one said they were 100% effective; but 95% effective is *really* good and makes herd immunity (where COVID cannot thrive) a feasible and worthy goal. https://t.co/xsxHqWGT8U", "https://t.co/bXat7huelX", "https://t.co/Y6tUKmkdUa", "@christopher_mcb @BoingBoing @BadVaccineTakes @BadMedicalTakes https://t.co/Y2JjbNmTZf", "Context: The best kind of immune system is a healthy one, which will greatly help you with COVID.\n\nBut it's also not a mask. https://t.co/hcqrGMXcg1", "@lichtenbrent https://t.co/Y2JjbNmTZf", "@DanIrizarry @drdrew https://t.co/Y2JjbNmTZf", "https://t.co/U5wKeLw3ZQ", "Many people flagged this, but I'm using the same contrast as @mattyglesias, so h/t for that.", "https://t.co/LOkg4gXgBF", "I should add that the picture is much bleaker than the deaths chart I posted suggests: testing is very poor in Brazil, and positive rates in Ukraine, much of Latin America are &gt;20%. Very likely COVID deaths undercounted. \n\nIt's not the vaccine causing the rise. it's the virus. https://t.co/rMqtZmTPQ9", "This excuse is getting tiresome. Alex blames vaccines because they emerged about the same time as variants.  But see South Africa, where fewer than 1% vaccinated: deaths tripled! Would be like 14k COVID deaths a day in US. Vaccines aren't causing the increase; they reduce it. https://t.co/nfk0uFmDpJ"], "description": "Stunningly bad COVID-19 takes. Inspired by @BadLegalTakes. DM or @ me. FAQ: https://t.co/pfQMZ0pQG7", "location": "", "lang": null, "friends_count": 561, "entities": {"description": {"urls": [{"url": "https://t.co/pfQMZ0pQG7", "expanded_url": "https://twitter.com/BadCOVID19Takes/status/1253025643786391557", "display_url": "twitter.com/BadCOVID19Take…", "indices": [76, 99]}]}}}