{"id": 1233340625090760705, "screen_name": " CoronaEnglish", "name": "English Coronavirus updates for Switzerland", "statuses_count": 5499, "followers_count": 9953, "tweets": ["The Netherlands reports more than 16'000 positive cases within 24 hours. This is the highest number since the beginning of the pandemic in March 2020. The country discusses a 2-week-lockdown. #CoronaInfoCH #Nederland https://t.co/zorWbTnDZA", "3886 new lab-confirmed cases\n10,5% positivity rate \n37'105 tests\n35 hospitalisations\n6 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "Very sharp increase: \n\n4150 new lab-confirmed cases\n38'840 tests\n10,7% positivity rate \n55 hospitalisations\n14 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "2986 new lab-confirmed cases\n28'468 tests\n10,5% positivity rate \n64 hospitalisations \n7 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "2848 new lab-confirmed cases \n35'422 tests\n8% positivity rate\n31 hospitalisations \n0 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "Wankers. :)", "Positive cases and positivity rate still increasing: \n\n2931 new lab-confirmed cases\n31'180 tests\n9,4% positivity rate \n42 hospitalisations \n6 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH #Corona #coronavirus #COVID19", "Left activists are campaigning against the Swiss Covid law – with ads on Pornhub. \n\n#CoronaInfoCH https://t.co/kKhOF1aQPm", "I'll keep tweeting throughout the whole autumn and winter! If you want to support me with some coffees, you can do it here. https://t.co/kojxpNz1IB Thanks a lot! #CoronaInfoCH", "Rather sharp increase:\n\n2607 new lab-confirmed cases\n27'400 tests\n9,5% positivity rate.\n57 hospitalisations\n5 deaths\n\nRelated to Coronavirus in the last 24h in Switzerland. #CoronaInfoCH", "1949 new lab-confirmed cases\n22'471 tests\n28 hospitalisations\n8 deaths\n8,7% positivity rate \n\nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "Info about the Swiss national vaccination week: https://t.co/Hfl0HGCVsR #CoronaInfoCH", "Information about the national vaccination week: https://t.co/Hfl0HGCVsR", "Around 18 million Swiss francs are being invested in the national vaccination week.", "Preparations for the vaccination week is in full swing, according to Rudolf Hauri, Cantonal Doctor Zug. \"The range of vaccinations is being expanded and include shopping centers, mosques, trams, clubs and much more.\"", "Masserey (BAG) explains that the volume of new infections is highest amongst young people. But: \"It is reassuring that, despite the high number of infections, admissions to hospitals do not get out of hand.\"", "Currently 64 percent of the population is fully vaccinated. 75 percent have had a first vaccination. The current amount of vaccination doses administered daily is 13,000. According to Masserey, this is far too little.", "(Thread) \nToday's press conference. \n#CoronaInfoCH", "More than usual people in Switzerland are having a cold right now. Experts are concerned that this will exceed test capacities this autumn and winter – they suggest wearing a mask. #CoronaInfoCH https://t.co/D7lzbOhdLv", "Swiss employers are now allowed to withhold salaries for people that don't have a covid certificate. \n\n#CoronaInfoCH \nhttps://t.co/wyghghYO3C", "1792 new lab-confirmed cases\n24'828 tests\n7,2 % positivity rate \n18 hospitalisations \n8 deaths \n\nrelated to #Coronavirus in the last 24 hours in #Switzerland.", "1846 new lab-confirmed cases\n27'981 tests\n6,6% positivity rate\n45 hospitalisations\n4 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "BAG expects the numbers of cases to double every two weeks. #CoronaInfoCH https://t.co/7aliQSu2NY", "Booster shots (3rd shots) for over 65-year-olds start in November. The federal government announced this yesterday. https://t.co/fpVmajUjy0 #CoronaInfoCH", "Around 10'000 people protested in Bern yesterday. Against Covid measures. #CoronaInfoCH https://t.co/aBRBBAtxmp", "Numbers of Coronavirus infections are are currently rising rapidly in eastern Europe. Latvia is planning a new lockdown. #CoronaInfoCH #Covid  https://t.co/1k0Qc2SSUR", "1478 new lab-confirmed cases\n27'347 tests\n5,4% positivity rate \n13 hospitalisations\n7 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "The Federal Council discussed if they should waive the mandatory certificate rules. But they agreed that it'd bring too many risks at this point. #CoronaInfoCH https://t.co/5qLVCImFt1", "1442 new lab-confirmed cases\n24'926 tests\n5,8% positivity rate\n34 hospitalisations\n5 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "@lelitico Statistics (dark green = fully, light green = one shot). Updated yesterday evening. Source: @srfdata https://t.co/g5XbDm1Wbc", "Switzerland: Over 50% of hospitalised covid patients aged 60+ are fully vaccinated. Which indicates that the protection of the vaccine lessens over time. Swissmedic is still working on approvals for booster shots. Status: Pending. #CoronaInfoCH https://t.co/I61HGEog4i", "=&gt; Returning to «normal» is not easy for everyone.\n=&gt; Over the past few months, many have grown fond of isolation or fear normality.\n=&gt; Experts call this «the cave syndrome». \nCan you relate? \n#CoronaInfoCH \nhttps://t.co/qpGlyRAd9h", "Source: https://t.co/NDyaPNdzbr", "Starting from today, covid tests for restaurant visits etc. aren't free anymore. \nException: Tests for people who have received a first shot, as well as for people who cannot be tested for medical reasons. Those tests remain free until the end of Nov. #CoronaInfoCH", "Happy week, everyone!", "Federal bureau for statistics: \n- Especially younger people suffered mentally due to the pandemic \n- People living in rural areas of Switzerland were mentally less affected by it \n#CoronaInfoCH https://t.co/NoYMg7xvDC", "Vaccination against Covid-19 can relieve long-covid symptoms or make them go away completely. A US-French research team reports on this.#CoronaInfoCH  #CoronaInfoCH https://t.co/5LqNsvBdqJ", "Mental Health: \nImpact of COVID-19 on poor mental health in children and young people ‘tip of the iceberg’ #CoronaInfoCH #MentalHealth \nhttps://t.co/Uq2GWa8REN", "According to the BAG, 1241 people have been reported to suffer from Long Covid. «We are aware that Long Covid is a serious problem» says Virginie Masserey. However, she does not want to further comment on this number.", "«The situation continues to improve. The number of hospitalizations is decreasing», says the BAG. The intensive care units are also less busy. According to BAG Virginie Masserey, 19 percent of all beds in Switzerland are occupied.", "(Thread) \nIn Switzerland, 64.5 percent of the population have now received at least one vaccination dose. At 58.9 percent, more than half of the population has already been vaccinated twice, as reported by the BAG. #CoronaInfoCH", "Twitter. 💙 #Twitter", "Swiss Vaccination „boss“ Christoph Berger sees possibility that the vaccination rate will increase by 10 to 15% by January - the certificate requirement and the mask requirement would no longer be necessary. #CoronaInfoCH https://t.co/CjmAVXZZqQ", "The BAG has 150'000 doses for entire Switzerland.", "People that don't want to (or can't) be vaccinated with a mRNA vaccine, can now officially sign up for a Johnson &amp; Johnson shot in Switzerland. Starting in October. #CoronaInfoCH https://t.co/U0ZDPJs3cR", "@jesuisdot Thank you so much! :)", "Thanks to everyone that has supported me and my work for this account so far! 💐 I appreciate it very much and it kept me able keeping it up eversince. #CoronaInfoCH  https://t.co/mCeRvgthWF", "The Netherlands waives 1,5m rule but makes Covid certificates mandatory for most enclosed public spaces. Over 80% are vaccinated. #CoronaInfoCH https://t.co/J44Hmju04g", "Since Covid certificates are mandatory in Switzerland, 95‘000 people get tested on a daily basis. Before it was 50‘000. #CoronaInfoCH https://t.co/dmoMUMa6ll", "We currently have more corona cases than last year at the same time. Alain Berset once again appeals to the population: «Please get vaccinated!» #CoronaInfoCH", "Switzerland puts Albania and Serbia on the risk county list. Entry ban for those arriving from these countries, without being vaccinated. #CoronaInfoCH", "This goes for both PCR and Antigen Tests.", "Confirmed: \n=&gt; Covid tests remain free of charge (also for people that aren't vaccinated) until the 10th of October. \n=&gt; For people that got the 1st shot already, testing will be free until the end of November. #CoronaInfoCH \n#CoronaInfoCH", "Press conference live now. I'll report. Main topic: If Covid tests will be free for people that are not (or only once) vaccinated. #CoronaInfoCH", "Source https://t.co/Mrtbe7zq4w", "Good morning! Is this going to be the ad of the year? #CoronaInfoCH https://t.co/2J3x5C7ZJq", "Violence in Bern: \nPolice is shooting rubber pellets against participants of illegal anti-covid-measures protest.\n#CoronaInfoCH", "Live: \nHundreds of Covid measures sceptics are currently demonstrating in Bern. Police warns: Protesting in front of the Bundeshaus fence won‘t be tolerated, as the demo has not been approved by officials. #CoronaInfoCH\n\nhttps://t.co/L55WFRyh9X", "\"Many end up in the intensive care unit because they go see their doctor when it's too late\" says BAG.", "The fourth wave has not yet broken. The number of cases could rise again in the cold season.", "Negotiations are under way with Johnson &amp; Johnson to obtain another vaccine. As soon as new knowledge is out, the BAG will communicate more about it.", "When the vaccination and an associated vaccination recommendation for children will come is still unclear. Then a possible certificate requirement will also be discussed.", "The demand for tests is high. In this context, it has been found that staff at test sites are increasingly being “approached in a rude manner”.", "The demand for vaccination has increased especially among the younger population. Most of the people in intensive care units are not vaccinated.", "The number of cases and hospitalizations are falling, but the situation in the hospitals remains tense. More than 250 patients are still cared for in the intensive care units.", "(Thread) \nMost important facts from todays press conference. #CoronaInfoCH #Switzerland #Coronavirus", "Source https://t.co/igVr6N9H6x", "Bern: Almost 30% more go get vaccinated, compared to last week. This might be due to the mandatory Covid certificate for restaurants, universities, bars, etc. #CoronaInfoCH", "On Thursday, people protested at the Bundeshaus in Bern. It's been reported that they tried to break down the fence around the Bundeshaus and threw object against it. The police reacted with tear gas, rubber shots and water cannons. #CoronaInfoCH \n\nhttps://t.co/B2V08PIqvE", "It‘s Friday.\nIf you feel like supporting me, you can do so here. \nAnd tell me what sort of drink I should try with your donation, if not coffee. 🙃 (will only do it in outdoor spaces). #CoronaInfoCH  https://t.co/mCeRvgthWF", "Scientists say: Corona in Switzerland could be „over“ by spring 2022. But: „We are going to face a tough autumn/winter“. #CoronaInfoCH  https://t.co/VuD2vvZZe0", "This can be either PCR or Antigen. But a certificate needs to be presented.", "New rule from coming Monday: Everyone traveling to Switzerland with no vaccine / recovery certificate needs to present a negative test certificate. Plus: needs to test again after 4 to 7 days. Exception: if you enter from bordering areas. #CoronaInfoCH  https://t.co/EWKfNgx6dn", "How many zoom meetings did you already have today? #CoronaInfoCH", "University Geneva offers free covid tests for students, starting next week. But: The tests are not valid for getting a covid certificate. #CoronaInfoCH https://t.co/NDyaPNdzbr", "Do you consume more alcohol since the beginning of the pandemic? #CoronaInfoCH", "Swiss hospital reports significant increase of patients with liver diseases since the pandemic. Many patients are below 50y, some even below 30. Head doctor blames alcohol addiction and thinks that more people got addicted since the pandemic. #CoronaInfoCH https://t.co/Y5AzDQaYk0", "Mandatory covid certificate motivates people on the countryside to get vaccinated. #CoronaInfoCH https://t.co/qaBSX9B6yD", "Within +/- 3 weeks the number of hospitalisations has halved. Some experts say that the 4th wave has been stopped and the situation will get even better with the mandatory certificate – some warn of more infections with autumn coming. #CoronaInfoCH  \nhttps://t.co/ab8Ir1k7Be", "About booster shots: @Swissmedic_ is still working on clear recommendations. #CoronaInfoCH https://t.co/H6CWb1bQFq", "Confirmed: \nBAG recommends vaccination for pregnant woman after 12th week of pregnancy. \n#CoronaInfoCH", "@FvRice ?", "2/2 \nAnd with respect for everyone &amp; everyones freedom to express their thoughts and emotions, I won't block any accounts. But please keep it there, with opinion and emotion if you need to, but stay present and avoid accusing or attacking anyone else. Thank you", "1/2 \nA friendly reminder. I am all in for a transparent and lively debate culture. But I see more and more retweets and dialogues connected to my tweets where people start becoming personal. I don't like the fact that this account is a platform for such behavior...", "Initiators of a petition for free covid (certificate) tests collected 100‘000 signatures within 15 hours. If the free tests were reintroduced, non vaccinated people could use them to enter bars etc. #CoronaInfoCH  https://t.co/PmkmohlK6k", "6060 new lab-confirmed cases \n97'098 tests\n6,2 % positivity rate\n77 hospitalizations\n10 deaths\n\nRelated to Coronavirus in the last 72 hours in Switzerland.\n\n#CoronaInfoCH", "People regularly DM me to ask if they can donate / support me via TWINT. \n\nYes thats possible! This is my (twint only) number: +41 76 511 13 28 thanks 🙏 \n\n#coronainfoch", "Happy first day of mandatory covid certificate for restaurants gyms bars and soon universities Monday. #coronainfoch #switzerland", "@StroekWowa I guess the article is about the fact that it's allowed! I just did a quick google search and it really looks like it. It's called \"Versammlungs- und Meinungsfreiheit\" which people living in CH have a right to. But for larger demos organisers need an approval.", "@StroekWowa That‘s incorrect. You can get a „Bewilligung“ for a demonstration.", "Luzern: Demonstration yesterday against covid certificate mandatory. 1500 people attended, police had to intervene at times with tear gas. Demonstration was not approved. #CoronaInfoCH \n\nhttps://t.co/d1U3ErDRSZ", "No studying without Covid certificate:\n\nPublic university \"Fachhochschule Nordwestschweiz (FHNW)\" only lets students attend lessons if they have a valid Covid certificate. Starting from 15 October. \n\n#CoronaInfoCH \n\nhttps://t.co/NDyaPNdzbr", "3114 new lab-confirmed cases\n36'280 tests\n8,6% positivity rate\n58 hospitalisations \n8 deaths\n\nrelated to #Coronavirus in the last 24 hours in #Switzerland. #CoronaInfoCH", "Switzerland is working on new entry requirements. Non-vaccinated people might have to quarantine for 10 days. Decision will be made on September 17. #CoronaInfoCH \nhttps://t.co/VuD490iK1P", "The Covid certificate requirement shows effects: More people register for the vaccine. Canton Bern registered 2000 new appointments in 24h – usually it's 500 to 1000. #CoronaInfoCH \n\nhttps://t.co/tojiSU3IOx", "The english version of the new poster regarding the new covid certificate requirement in Switzerland. #CoronaInfoCH https://t.co/VlG1jcolPR", "3550 new lab-confirmed cases\n34'828 tests\n10,2% positivity rate\n53 hospitalisations\n7 deaths \n\nrelated to #Coronavirus in the last 24 hours in #Switzerland. #CoronaInfoCH", "Also employers and universities can decide for mandatory certificates.", "RT @BR_Sprecher: #BREntscheid #CoronaInfoCH Weiterhin angespannte Situation in den Spitälern, die Intensivstationen sind voll. Der Bundesra…", "Exceptions: \n- Religious events / services \n- Political meetings \n- Shops, stores \n- private events w max 30p \n- hairdressers (personal services)", "In:\n- Indoor areas of (hotel) bars and restaurants\n- Leisure, sport and entertainment establishments   (theaters, cinemas, casinos, pools, museums, zoos etc.)\n- Indoor events (concerts, sporting events, club events, private events such as weddings outside of private spaces)", "++ Confirmed ++ \nCovid certificate will be mandatory in all indoor places (restaurants, bars, gyms, pools, cinemas, etc.) from coming Monday. Cheaters pay 100.-- CHF fine. \n#CoronaInfoCH #Zertifikatspflicht", "It's ☕️ time. :-) \nIf you want to buy me one, you can do so here! Thanks for your support! \nhttps://t.co/kojxpNz1IB \n#CoronaInfoCH", "@emmalilwilliams If they say anything about this today, I'll tweet. :-)", "Today on the plate: \n\n- Swiss Federal Council will decide over mandatory Covid certificate for bars / restaurants / gyms. \n- as well as further measures at work / for travellers (quarantine) \n\nI keep you posted. Stay tuned and happy day! ☀️\n#CoronaInfoCH", "@swisspuppy Have been busy, but thank you ! ❤️", "Facts of today’s press conference:\n- Situation in Switzerland is “stable but very tense”\n- Most of hospitalized ppl are younger than 44\n- Only 🇬🇧 had a higher incicdence rate than 🇨🇭 \n- Covid is currently mostly circulating in schools\n#CoronaInfoCH", "42% of all intensive care beds in Switzerland are currently occupied by Coronavirus patients. #CoronaInfoCH https://t.co/qT0ZrLWFkq", "2835 new lab-confirmed cases \n29'407 tests\n9,6 % positivity rate \n80 hospitalisations\n9 deaths \n\nrelated to #Coronavirus in the last 24h in Switzerland. #CoronaInfoCH", "Confirmed: Federal Council goes 'wait and see' when it comes to mandatory covid certificate for restaurants and gyms. Reason: Situation seems to look a bit better since the last couple of days. #CoronaInfoCH https://t.co/jwIOyN6S93", "3202 new lab-confirmed cases\n33'325 tests\n9,6 % positivity rate\n84 hospitalisations\n3 deaths \nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "Cantons Thurgau, St.Gallen and both Appenzell are positive about Bersets “Covid Pass Only” idea when it comes to gastronomy, gyms, etc. #CoronaInfoCH\n\nhttps://t.co/tBqaUZ1MP4", "2763 new lab-confirmed cases \n31'913 tests\n8,7 % positivity rate\n79 hospitalizations \n8 deaths\n\nRelated to Coronavirus in the last 24h in Switzerland. \n\n#COVIDー19 #coronainfoch", "Explanation: \nAlain Berset said today that the Federal Council *drafted* new measures that include compulsory certificates in restaurants, gyms, etc. But we don't know yet if that's going to be applied.\n#CoronaInfoCH", "Mask requirement in the restaurant?\nBerset: “I don't have the details in my head. Where the certificate is valid, there is no longer a need for a mask. \"", "When could a decision be made as soon as possible? Is there no grace period for unvaccinated people?\nBerset: “There is uncertainty. In theory, we could decide to go into effect at the beginning of September next week. We don't know and are accordingly careful.", "«No magic weapon»\nBerset admits: “The certificate requirement is not a magic weapon. But it's the best weapon we have right now. \" That is not fully comprehensive insurance, compares Berset, but the best that is currently available.", "Fosca Gattoni, BAG: \"Tests for people with symptoms, mass tests in companies and at schools remain free.\"", "The compulsory certificate should be extended to the interiors of restaurants, cinemas, theaters, museums, zoos, sporting events and fitness centers. Simply for everything that takes place inside, ”says Berset. Exceptions: religious events, political and private gatherings.", "\"Today alone we still had 60 hospital admissions again because of Corona,\" says Berset. That is justifiable, but the negative development must be broken.", "«We have 30 times more hospital admissions than at the beginning of summer», says Berset.", "Berset explains that 56 percent of the Swiss population have been vaccinated at least once, of the adults it is 67 percent. “That also means that a third are still not vaccinated”. Berset explains that he doesn't think that's enough. “", "(Thread) \nPress conference about the Coronavirus situation in Switzerland, 25.8.2021. \n#CoronaInfoCH #Coronavirus #Zertifikatspflicht", "Confirmed: Swiss Federal Council wants «Covid certificate only» when it comes to gatherings in indoor spaces (like restaurants or clubs). #CoronaInfoCH", "3212 new lab-confirmed cases\n26'684 tests\n12 % positivity rate\n131 hospitalisations\n7 deaths \n\nrelated to #Coronavirus in the last 24h in Switzerland. #CoronaInfoCH", "Sorry folks, this was a mistake. It was within 'the last 72 hours', not 24.", "@dawn_hall Thanks for asking, I feel fine! \nWow that's quite a thing, are you moving back permanently? How does it feel?", "6218 new lab-confirmed cases\n70'087 tests\n8,9 % positivity rate\n143 hospitalisations \n8 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "Happy Monday.", "I just stated that the festival was allowed because of their strict measures. Which include 'mandatory masks at the waiting area'. Apart from this being concerning, it isn't fair to other festivals / businesses.", "2575 new lab-confirmed cases\n26'254 tests\n9,8% positivity rate \n123 hospitalisations \n6 deaths \n\nrelated to Coronavirus in the last 24h in Switzerland. \n\n#Corona #CoronaInfoCH", "https://t.co/66IpUJQZ4c", "Swiss music festival «Gampel» is about to start. With 'strict coronavirus precautions', as it says on the website. One of those: Mandatory masks while queueing. I can't see a single mask on those pictures though. #Corona #CoronaInfoCH #Gampel https://t.co/iyTfmoJM3K https://t.co/uWWVLKLEBY", "@AKBULOZ1 I guess those sales went down, as I'd imagine that mostly singles / people in less committed relationships use condoms?", "Stadt Zürich: There hasn't been a baby boom that could be traced back to the pandemic/lockdown. I knew it!  Sweatpants just aren't that sexy. #CoronaInfoCH https://t.co/Pv7WGhPp1M", "@ken_mke Yes, I would say so. Especially when you travel via airport / plane / train.", "Returning from holidays? Do yourself &amp; us a favor and go get tested! #CoronaInfoCH", "Canton Wallis: Young students with a Covid certificate can attend lessons without masks. Opponents of these measures call it bullying. #CoronaInfoCH  https://t.co/A9vGJPKybw", "Good! A little less than yesterday: \n\n2788 new lab-confirmed cases\n22'645 tests\n12,3 % positivity rate\n65 hospitalisations \n0 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "Kanton Graubünden has an «Impfbus» that will go through all regions on August 23rd ++ vaccinations without without appointments are possible. #CoronaInfoCH #Impfbus #Graubünden https://t.co/aZBbXNeewE", "'If the utilization of the intensive care beds continues to rise so quickly, we will soon have a problem. We are not talking about weeks, but about days.\" says the Cantonal Hospital in St.Gallen. #CoronaInfoCH \nhttps://t.co/WcjbZf6mh7", "@gigi_raffaeli Good luck!", "Morning ☕️. \nHomeoffice or office today? \n#CoronaInfoCH", "@jayhabeeb Yes you can", "@SkankworksAgile It‘s just there on my phone. Haven‘t had a chance or intention to ‚use‘ it yet. :)", "@TLPrinceitisme @BegunRiv You convince me. It might be the cause for my intense dark circles eversince.", "@MJuliaBognar @MarkatCIFF Thanks Julia. :-)", "@TLPrinceitisme @BegunRiv Did he feel better afterwards?", "@realnewswire When you're on your couch, all tired and sick (and listening to Thurston Moore 👌) you really start to reflect upon those things, that's true. At least I did.", "@whatawo79798184 No. Could have been in the train, in a restaurant, in a tram. Not sure!", "@TLPrinceitisme Thanks a lot for this! I will ask my doc at my next visit – and eat lots of spinach in the meantime. :) I have many friends that had iron deficit pre-covid and also had good results after the infusions.", "Basically: Having covid felt like the whole storm of confusion, isolation, uncertainty and damage that the pandemic blows towards society – but then inside your body. #CoronaInfoCH", "@JustJenLeboeuf Yes I can imagine /  know how it feels to be an expat. So vulnerable! Must be even more difficult when the storm hits hard outside but then in a foreign language. Switzerland should really work on this.", "@LisaLorenz12 I wish I could say yes – but I don't know. What docs say: Already 1 shot helps you not getting *that* bad, as you already have antibodies obviously.", "@JustJenLeboeuf Dear Jennifer, thanks so much for your kind words, I really appreciate your gratitude. I am glad to hear that my work had some soothing effect in contrast to this frightening, saddening and also sometimes frustrating mess. :)", "@crisju1893 Always ate my carrots. No eye condition. No glasses etc. My eyes are fine.", "https://t.co/OGF0z9s19k here it all started. 😷", "@dawn_hall Thank you so much Dawn. I wish you the same. :)", "@dawn_hall I am. The coast is clear! I still look pretty messed up though, haha.", "@MarkatCIFF * -afterwards. I have to wait 6 to 8 weeks now for my 2nd shot, I haven't scheduled the appointment yet, but will do so.", "@dawn_hall It was bad, and basically very confusing. Nothing like I've ever had before. Mentally exhausting as you don't know how the next day will be, recovery is unpredictable. And confusing because symptoms change every hour. At least for me. Bit of a psych-virus.", "@MarkatCIFF I am permitted, but have to wait 6-8 weeks afterwards. As the PCR test apparently shows me positive for this amount of time, due to the high viral load of the Delta variant.", "@retolipp Homeoffice, aber dann Home und Office neu andenken. Und Räume neu planen. Office mit Fokus auf sozialen Austausch, Home so konzipieren, dass Trennung von Leben und Arbeit besser möglich ist.", "@BegunRiv 🙏 Thank you so much!", "@mt_winston I never got to see a doctor during this time. I'm just glad it's over!", "@SpaceCowBoyNew Yes I do, but I'm familiar with this due to other reasons.", "@BegunRiv I'm better, definitely. But still battling fatigue (which can have other causes of course). My sense of taste and smell is still not where it used to be, but I can smell lilies on my table in the meantime.", "@mt_winston I was already quite cautious. But I got a bit more lax in terms of indoor restaurants / cafes. And: I will change my masks daily. Which I, honest truth, didn't do anymore before I got infected.", "Ask me anything about my previous Coronavirus infection. #CoronaInfoCH #QandA", "New Zealand has 1 case since February – and goes into #Lockdown. #CoronaInfoCH #NewZealand https://t.co/tjhN7RffeJ", "I hope it's not the case, but it might be that I need to stack up on some coffee, to be ready for this account for the next weeks and months. If you want to support me, you can do so here. Thanks a lot! &lt;3 https://t.co/kojxpNz1IB \n#CoronaInfoCH", "\"For us this clearly is a fourth wave\", Swiss hospitals say. #CoronaInfoCH \nhttps://t.co/5aGoP3J9zl", "3291 new lab-confirmed cases\n22'805 tests\n14,4% positivity rate \n95 hospitalisations \n6 deaths \n\nrelated to #Coronavirus in the last 24h in Switzerland. \n#CoronaInfoCH", "@AnExpatWife 🤤", "«We don't like where the situation is going», says the BAG. \nRead everything about today's press conference. \n#CoronaInfoCH https://t.co/svwEigSFr3", "\"We all don't want a lockdown,\" said Mathys. More commitment is needed. \"If we get into areas where hard triages are necessary, then hard measures are also possible.\" But they absolutely want to prevent that.", "Last year, 30,000 operations were postponed. \"That doesn't sound like a lot, but maybe these 30,000 people had pain for weeks,\" says Mathys, and that is no longer acceptable if there should be a fourth wave.", "Those returning from vacation would play an important role, says the Zug canton doctor Rudolf Hauri about the increasing number of cases. \"Returnees should be tested - even now,\" says Hauri.", "\"Hospital admissions have increased 10 times since the beginning of July\".", "Rudolf Hauri points out the importance of repetitive tests. Hauri does not speak of a fourth wave, but of a “perhaps intermediate wave”, which is something returning travelers would also have an influence.", "Milo Puhan presents new study results from \"Corona Immunitas\". The studies looked at the proportion of the population who developed antibodies. Thanks to the vaccination, it is up to 80%. Without a vaccination, i.e. antibodies from an infection, the values were  3–10 % last year.", "@BAG_OFSP_UFSP are you campaigning on TikTok as well?", "So far, a good 55 percent of the population has been vaccinated at least once. Now, however, additional efforts are needed to persuade undecided and especially young adults and adolescents to have a vaccination, says Mathys.", "The number of deaths remains at a very low level. However, hospitalizations have increased by 45 percent compared to the previous week. Around 70 percent of the intensive care beds are occupied, says Mathys. The situation in the intensive care units is not yet worrying.", "'If all not-vaccinated people will get covid, our health system will be as overwhelmed as with the 2nd wave'", "Taskforce: 'The delta variant is so strong – we expect everyone without a vaccine to get infected at some point'.", "\"Unfortunately, the number of laboratory-confirmed cases is increasing again,\" says Mathys. Since yesterday we have again more than 3000 cases. The 14-day incidence is around 265 cases per 100 inhabitants. \"Hospital admissions have increased tenfold since the beginning of July\".", "(Thread) \nPress conference, Coronavirus situation in Switzerland, 17.08.2021. \n#CoronaInfoCH", "@Robinhood_55 Your comments are intrusive, I never asked you for any judgement or advise where I should move. But I came to the conclusion the right place for you is my mute list.", "BAG confirms: According to the current situation, overwhelmed hospitals are not to be ruled out. #CoronaInfoCH", "Press conference live now. I will summarize later! #CoronaInfoCH", "@LaureMBrussolo Thank you for asking. :-) I‘m better!", "@Robinhood_55 It‘s a tendency that is worrisome. It‘s not about spreading fear, but information. it‘s not only about the health sector being intact; the more that are sick, the more all sorts of sectors are affected. Economy, education, etc. \nBut yes, thinking stops where resentment kicks in.", "@Johnston_L_ Better, thanks! Out and about but still tired. :)", "Not happy about tweeting this:\n\n3150 new lab-confirmed cases\n20'089 tests\n15,7 % positivity rate\n62 hospitalisations\n2 deaths\n\nRelated to #coronavirus in the last 24h in Switzerland. #CoronaInfoCH", "5578 new lab-confirmed cases \n60'812 tests\n9,2 % positivity rate\n83 hospitalizations \n4 deaths\n\nRelated to Coronavirus in the last 72 hours in Switzerland. #CoronaInfoCH", "@asottile I meant 'home', but hope is a big thing indeed.", "Harvard scientists developed a new 'hope testing kit'. Results show in 1 hour, are as accurate as with a PCR test, and tests are very affordable. The team is waiting for approval by the US medicines agency. #CoronaInfoCH https://t.co/5hfxmHgXGj", "@arjayCHUK Can't you use your NHS app for this?", "No more free antigen tests (with certificate) should motivate night club / event visitors to get vaccinated. I wonder how effective this will be, when a test that's valid for a whole weekend costs as much as two gin tonics. #CoronaInfoCH", "Breaking: No free covid tests anymore from October in 🇨🇭. Federal Council wants to put pressure on people that are not vaccinated. #CoronaInfoCH", "RT @Rsatz_co: @Royban3 @CoronaEnglish Even BAG said that vaccine or not, the virus is circulating. So even if you have 100% vaccination it…", "RT @zrh_airport: @nik_clayton We recommend vaccination to our employees (only employees of Flughafen Zürich AG). However, we are neither ob…", "Today would be the day when Switzerland scheduled new easings of the covid measures. But it‘s not going to happen. Economy now stresses for a „Freedom Day“ / waiving of all measures per 1st of September. #CoronaInfoCH  https://t.co/4FjRgXDXqg", "Just saying: The World Health Organisation recommends that strict coronavirus measures remain in place if the percentage of positive tests exceeds 5%. Switzerland is above 10% currently. #CoronaInfoCH @WHO", "Do you think we‘ll be facing new measures or new lockdowns as autumn is approaching? #CoronaInfoCH", "@JustJenLeboeuf Thanks for asking 🌺 yes I do!", "@mfragozo Still, the positivity rate is above 10%", "@JohnMu I do, thanks!", "Thanks for asking - apart from a strong feeling of tiredness, I do feel better and make it through days without paracetamol! I guess I f%#*^ Covid. #CoronaInfoCH", "Numbers are rising. 🥺\n\n1910 new lab-confirmed cases\n18'460 tests\n10,3% positivity rate\n26 hospitalisations\n1 death\n\nRelated to Coronavirus in the last 24h in Switzerland. #CoronaInfoCH", "@Icarus_Flies Thanks. :-) I'm healthy and don't have anything underlying otherwise, but usually show heightened immune responses to all sorts of viruses.", "@Icarus_Flies I'm 33.", "They were worried as the heavy breathing started on day 8 which is typical for severe cases. However, the next day the symptom luckily disappeared! But I was already packing some underwear in a weekender bag. Scary bug this is!", "Sorry for the radio silence! I'm okay, thanks to everyone who asked! Most symptoms are gone; still feverish from time to time (right now). I had rather severe shortness of breath  Wed night, was already on the phone with the night doc, but then i sat it out at home. #CoronaInfoCH", "@joslat Thank you Jose!", "@TinaAbboud Or Christina ? :)", "@TinaAbboud Thank you Tina!", "Still positive.", "Coronavirus day 8-9. Will do another (self) antigen test in 10 mins. \n\nBet the result! (No hard feelings in case u say +)", "Read this while popping a paracetamol. #CoronaInfoCH https://t.co/2GS2I6m2Gf", "@IsisCasalduc Thank you :)", "@AYearInTri I have many delivery options, but so far managed to cook myself :) i will report the self tests!", "@AnExpatWife I think so but at times it hits hard again and again. Nothing i have ever experienced!!!", "@Poetic_Solstice 🤍🤍😷", "Last time crying, I promise", "As my couch and me slowly start to become one, and my tweets grow a Kanye-near frequency, I start to imagine how it actually looks inside my body, right there at the battlefield, where antibodies try to beat the shit out of these Delta bastards. 🦠 🥊", "To be added: the delta variant is also considered as ‚Variant of concern‘", "Japanese scientists suggest that #Lambda variant is resistant against all current available vaccines +++ They stress the WHO to categorize it as concerning. #CoronaInfoCH  https://t.co/mOo7YdmUqi", "@jninety67 Thanks!!!! ❤️ no, i‘m not, and i‘ve ordered a lot once i got sick.", "BAG confirms: Switzerland is currently discussing if a 3rd vaccine shot would make sense. And this already in autumn! I'll keep you posted as soon as the story develops. #CoronaInfoCH https://t.co/KrhpKo23at", "1033 new lab-confirmed cases\n21'424 tests\n4,8% positivity rate \n35 hospitalisations\n2 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "@andreaabegg Thanks! I mean I'm fine :) There's still plenty of people who struggle way more.", "@cpltalk Outdoors.", "@Mary__Mimo Thank you so much. :)", "@immahx Today I woke up feeling significantly better. But still very tired, getting dizzy by just doing the dishes and my couch and me become 1. But I'm very glad that I can sit here and work a bit!", "@Poetic_Solstice Thanks.)", "@someideasare Thanks you!", "Don't get lousy about all precautions ! \nI'm pretty sure I caught Covid because I did a bit. Washing my hands *after* I already ate the first course, etc. \nCovid isn't out of season. I can really tell. 🤢\n#CoronaInfoCH", "It's 7 days now I havent left my apartment and it's not making me sooo crazy, as I couldn't have walked down the stairs anyways. Feeling shaky on my legs still. This virus is nasty, and although I'm very grateful that I present a mild case, it's a lot of work for your body.", "On day 3 or so I started to have this extreme cigarette smoke smell in my nose, and it wouldnt go away. I read online that it's fairly common. A day later it disappeared, but my sense of taste &amp; smell are gone to like 80%.", "My symptoms were mainly 'feeling very ill' and some coughing here and there but not significant. Also my nose was blocked, but also nothing wild. I threw up a fair bit but that due to the sickness and fever. Blood oxygen was always in a safe range.", "However, I felt even worse a day after and called the vaccine hotline. They told me I should get a PCR test which I did. The next morning I woke up super sick and wasn't surprised to get a positive result.", "So a week ago I got tested positive with Coronavirus. It was weird because I thought I just had a hay fever. I did an antigen test (in a professional testing facility) and it turned out negative. Two days later I was supposed to get my 2nd Moderna shot.", "I seem to get better! And am able to stare at a screen for longer than 5 minutes without getting very 🤢, therefore I give you a litte recap of my infection. #Thread #CoronaInfoCH", "Day 7 - definitely still sick. It‘s annoying and quite a mixed platter of symptoms but i‘m managing. Stay safe! #CoronaInfoCH", "@AnExpatWife Thanks！", "@Marcelli1314 Haha! That‘s also gone.", "@SurpriseSparrow Hey! I like healthy things! Haha. Smell is gone as well.", "@jmkfrstr Thank you!", "The moment has come. Goodbye, sense of taste. Really hope to see you again soon.", "Interesting to actually have the thing we‘re tweeting about since 1,5 years. But also annoying. Although I feel like the symptoms lessen a bit, slowly. #CoronaInfoCH", "The idea of food is not the nicest one, but it’s bearable. What‘s really distressing is feeling „locked“ inside your body and the unpredictability of the symptoms - the challenge regarding the mind shouldn’t be underestimated! But i go strong. Thanks for the wishes! #coronainfoch", "Day 3 (or 4): The fever keeps coming and going. No cough but completely weak. After naps I wake up and feel like it‘s all gone &amp; better, but after the next nap it‘s all there again. Still have a sense of taste, but no smell (annoying cigarette smoke taste lingers in the nose tho)", "@itosettiMD_MBA Thanks a lot, I will follow this advice! 🌸", "@itosettiMD_MBA @Marcelli1314 Thanks, I ordered and Oximeter.", "@katic_i 🌺", "@joslat But thanks for the wishes! :)", "Contact tracers in Canton Zurich recognize a pattern: Public transport (mainly trains and busses) as well as offices tend to be places where lots of infections currently happen. #CoronaInfoCH https://t.co/GdeDh0sruV", "If you want to buy me a coffee, I will for now make a tea instead. And as a motivation for staying hydrated, I will have a cup for every coffee I get. ❤️ You can do so here: https://t.co/mCeRvgthWF #CoronaInfoCH stay safe!", "Lesson to learn: don’t trust the rapid tests! I did one, feeling under the weather, and it turned out negative. A PCR 18h later was positive. Rapid tests tend to not show the infection if not many symptoms are present! #CoronaInfoCH", "Day 2 of being officially positive: Going ok, still tasting coffee, headache and slight fever, some coughs and sneezing here and there, brain fog. And so pale that my cat got scared of me. #CoronaInfoCH", "@joslat No idea so far", "@mrliamenglish Thanks Liam, I'll do my best.", "@PercySewell Thank you Percy", "@harphat Thanks Trudy!", "@PolexiaGe So far not toooo bad. Thanks!", "@DuncanSharp82 It'll be ok, thanks for your wishes:)", "@brookmeister Thanks Brook! I'll give my best :)", "@hollycamefrom Thanks :)", "@NickLennartson Yes", "Just out of curiosity i did another rapid test i had at my house, after my positive PCR and a previous negative rapid one. And this one showed positive in a heartbeat. #CoronaInfoCH https://t.co/bL8oLfDXzs", "@kateurbaez Thanks. This I can need for sure!", "@_muggly Not a symptom and hopefully also stays like this :)", "@AnExpatWife Thanks! Not sure yet. They will call me and tell me :)", "… while I‘d have done that right after entering. I had a feeling its ‚dangerous‘ that the general vibe in society is less of a concerned one. But i still was very careful, wearing masks and carrying&amp;using hand sanitizer.", "I don‘t know how I got it. But last week, using trains, I sometimes had the thought ‚oh thats actually a bit scary, coughing people around me‘. I also caught myself taking less care of hand hygiene (e.g. washing my hands in a restaurant after my 1st course).", "Yesterday: Feverish, knees hurt, fuzzy head, weird sleep.\nToday: breathing is a little more heavy but not alarming, lack of appetite, tired, similar to a cold. Weird dreams and rather moody though. #CoronaInfoCH", "@Adri_Scribble My rapid test (carried out by a testing facility) showed negative.\nPCR a day after was positive.", "@Soohyun07432905 Took care of it all already", "I just informed all my contacts i‘ve met in the last 7 days. They reassured to to get tested. So do my partners parents &amp; friends.", "@Icarus_Flies Haha no", "@z29n I just got the appointment like this.", "@eerk55 No not yet", "I did an Antigen (rapid) test the day before my 2nd vaccine shot day. Was negative. Thought it was hay fever. Then the next morning (yesterday) I felt worse and got a PCR. Had some fevers and a fuzzy, confused head, and exhausted. Now i had coffee and its alright, like a cold.", "Thanks for all the recovery wishes! I will tweet a bit about the whole thing the coming days. It basically started with weirdly hurting knees and „hay fever“, and I thought it must be a hangover from not-so-good supermarket wine. But it‘s in fact Covid. #CoronaInfoCH", "@Chaletmaridadi Thanks! Was in the mountains last week, that gave me lots of energy", "@iNSiG9FiX That is a good question I have myself.", "I‘m Covid Positive. And this on the day where I would have gotten my 2nd vaccine shot! #CoronaInfoCH", "https://t.co/5uRlnpWf22", "Basel hosts a techno festival with 6000 visitors this weekend. And it is called ‚Tension Festival‘. #CoronaInfoCH", "RT @kamber_marco: Getting a fever before your covid vaccine is kind of ironic", "False alarm. As I‘m having a slight cold with headache and mild temperature (even if tested negative yesterday) they reschedule my appointment. https://t.co/VLgdNDJ0pW", "For tomorrow's post 2nd shot live coverage. :-) https://t.co/Ee6GoG6DQ1", "@dawn_hall @MarkatCIFF Thanks Dawn, you just made my day.", "@bk__ get well!", "RT @FinancialTimes: Why are fully vaccinated people testing positive for Covid? https://t.co/lp12OEO2wF", "@amjadmsaleem thanks!", "@JustJenLeboeuf @MarkatCIFF Sorry to hear! Sounds not very pleasant.", "@MarkatCIFF 1st one already sort of did. So I hope that the tales are true, 'if the 1st one is bad, the 2nd one will be ok'. :-)", "💉💉💉 2nd Moderna shot for me tomorrow 💉💉💉 \n#CoronaInfoCH", "USA considers mandatory masks for vaccinated people. Reason: Unpredictable rise in new infections due to #DeltaVarriant. #CoronaInfoCH https://t.co/w62wQIjBDS", "A head doctor estimates: 2 out of 3 pregnant women don't want to get vaccinated. #CoronaInfoCH https://t.co/NTYY1z11qw", "771 new lab-confirmed cases \n18'384 tests\nPositivity rate: 4,2%\n17 hospitalisations\n3 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. \n\n#CoronaInfoCH", "@AnExpatWife https://t.co/HcUzjJsIvo", "@AnExpatWife If you haven't already, you should try making an ossobuco milanese with polenta. Maybe once autumn hits – or during a rainy season, which we kind of have now. :-)", "@AnExpatWife Me neither, for years! Then: Ossobuco brought it back to my attention. And then: I started making polenta fritters or oven polenta cakes from cold polenta, and now it's back. :-)", "@lpuerto So far not!", "@AnExpatWife Looks amazing!", "@AnExpatWife I made two dishes: \nSoup: https://t.co/fMzBbfYOxm \nIt's very nice, I also seasoned with lemon cest, which makes it a little fresher. \nMain: https://t.co/H3YFmGJ8UF =&gt; solid but I'd fry the mushrooms with some Guanciale next time, for an extra kick. :-)", "... Because so far, only almost 47 % of the Swiss are double vaccinated and the task force doesn't expect more than 60% to be vaccinated. #CoronaInfoCH", "=&gt; On August 11, the Council will decide whether we should move into the “normalization phase”, in which there would be hardly any more measures.\n=&gt; The Corona Task Force doubts, that this will happen. \n#CoronaInfoCH \nhttps://t.co/mPg2Kol1Uh", "It has been rather quiet today when it comes to Covid news! Enjoy your evening! (What's for dinner tonight?) #CoronaInfoCH", "Infections and deaths can occur despite the vaccine. But Swiss experts say: ‚Without the vaccination program, we‘d have thousands of more deaths‘. #CoronaInfoCH https://t.co/iurT8jrDBO", "@Poetic_Solstice https://t.co/9E6MTfiycR", "Beware: Heavy thunderstorms to be expected later today. #Offtopic #CoronaInfoCH #Switzerland #Gewitter via @meteoschweiz https://t.co/pBmPdGN87H", "The vaccines show to be not as protective against the #DeltaVariant as expected. Therefore discussions arise about a 3rd 'booster' shot. Apparently Switzerland is prepared for such a scenario, according to this article. #CoronaInfoCH \n\nhttps://t.co/njLvKXaxmf", "BAG confirms: So far, 18 people that have been fully vaccinated died from Coronavirus. #CoronaInfoCH #DeltaVariant https://t.co/ShzGgbSVvD", "What‘s the most stupid thing you online shopped during the pandemic? #CoronaInfoCH", "94,1% of all positively tested in Switzerland are infected with the Delta variant. #CoronaInfoCH  https://t.co/8oHfCJI6eq", "Canton Zug: Entrance to Bundesfeier (1. August party) only with Covid certificate. #CoronaInfoCH https://t.co/YApai6pnGR", "Italy: Covid certificate soon to be required for entering a public space such as a bar / cafe / museum. #CoronaInfoCH https://t.co/s8edJ2GglT", "@WheelHelms Alpstein mountains, at Meglisalp", "@maximilianarno Alpstein Mountains, Meglisalp.", "💚 https://t.co/GoQK4CueT3", "Sorry for the radio silence. Spontaneously took some days off and there is no Wifi and no reception. (Not kidding). Back on the weekend! https://t.co/1kYD0Uc8ye", "619 lab-confirmed cases\n36'440 tests\n1,7 % positivity rate\n5 hospitalisations\n1 death \n\nrelated to #Coronavirus in the last 24 hours in #Switzerland. #CoronaInfoCH", "@_JDM92 I suggest calling the hotline, you find the number on this site: https://t.co/CvJ09f9s08", "Will not change the account to HochwasserEnglish, promise. But stick around about Covid news. If you want to support me, you can do so here! Highly appreciated. 🙏 #CoronaInfoCH \nhttps://t.co/mCeRvgthWF", "@_mbdr_ I'm not 100% sure if there weren't any? It has been super quiet amongst the news though.", "@JohnMu Can be checked here with all sorts of search keywords: https://t.co/3gMshFDVeC", "Let's hope the Reuss in Luzern is peaking now and not later. 🤞 #offtopic #Hochwasser", "Not much news these days! #CoronaInfoCH", "In Switzerland: \n41.71% fully vaccinated\n9,127,736 vaccination doses have been delivered\n8,341,400 were administered\nThis means that 41.71 percent of the Swiss population have been fully vaccinated.\n#CoronaInfoCH #Impfung #vaccine #vacme", "483 new lab-confirmed cases\n22'276 tests\n2,2% positivity rate\n5 hospitalisations \n0 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. \n\n#CoronaInfoCH", "@ADDeeCee Yes sure !", "As Switzerland started the vaccination campaign relatively late, some went abroad to get their shots. If they didn't get Pfizer/Moderna, they won't get the CH Covid certificate. Which leads some to get another vaccine in CH, which is risky. #CoronaInfoCH https://t.co/iuASky9tbl", "This week I'm testing a daily e-mail newsletter with 3-6 most important daily headlines. I'll send it out by the end of the day. Perfect for everyone who practices a social media detox but still wants to be updated. You can subscribe here: https://t.co/Q4x1ITAyJd #CoronaInfoCH", "In 7 days, the English can have a pint over last night's pain – without a mask. And also all the other measures will be waived by Johnson. #CoronaInfoCH \nhttps://t.co/o1SUtwJDAk", "- Swiss Retail Federation stresses to waive mandatory masks in stores by end of July\n- Economiesuisse wants the council to waive 'working from home' recommendation\n- Federal Council decides on further adaptions of measures on August 11 \n\n#CoronaInfoCH \n\nhttps://t.co/v7LmGzYPCV", "This week I'm testing a beta version of a daily newsletter, for everyone who doesn't want to check twitter all the time but have daily CH Covid news simple+plain in the inbox by 7pm. You can subscribe here: https://t.co/MIEY0frEp8  (Image shows an idea of the thing) #CoronaInfoCH https://t.co/jmeFLGDIKr", "@MarkatCIFF I agree. But i also understand that it happens, because the very topic of discussion is polarizing. You‘re either positive or negative, you either get the shot or not, you either have a certificate or not, - the matter doesn‘t allow much room for grey.", "FYI: I‘m not spreading pro / con views on the vaccine. I’m posting news. If one told me 2 years ago there will be a vac. everyone should get and a certificate that contributes to freedom, I’d have been shaken. But: It‘s weird times &amp; let‘s avoid perpetuating polarisation pls. 🌺", "@intlRita @MarkatCIFF @rkbfreeme Comparing being told to leave a country (this actually does happen to people – just saying) with being told to ‚leave‘ a Twitter account. Trumpster who?", "@rkbfreeme I tweeted it so you and others already know it days ahead of the next BAG press conference where they will most likely confirm that.", "@JackClaudiu The Netherlands, as written", "Vaccine-critics claim is ‚proofed‘ to to be wrong: Scientists suggest with a study that the vaccination programme decreases the chance of new variants to pop up within the pandemics. #CoronaInfoCH https://t.co/FcTN8ALc5a", "@AnExpatWife Cooking a lot, going for walks, reading down the to-read-book pile, getting stuff done around the new apartment. 🙌", "7000 new infections within 24 hours and new „light“ measures - while most of Europe is keeping the numbers low, the Netherlands notices a very steep increase. #CoronaInfoCH  https://t.co/t40XfDkrEL", "Enjoy your Friday 🙂", "WHO warns of ‘epidemiological stupidity’ of early Covid reopening https://t.co/B1ZQqnwjWA", "RT @skepteis: Meanwhile in Zürich... https://t.co/EXKq6SPcit", "3 Lambda cases in Switzerland confirmed so far. #CoronaInfoCH https://t.co/CVLslIcEEm", "@buymeacoffee Still?", "Pfizer/Biontech request approval for a 3rd vaccine shot. This could increase the amount of antibodies 5-10 times, first studies suggest. #CoronaInfoch https://t.co/CUMr1HJ6oy", "The Netherlands starts to worry about again-rising numbers (mainly in clusters amongst &gt;30y olds) and reflects upon new measures. #CoronaInfoCH https://t.co/Tdrc1l7WLW", "Do you think we'll have to face stricter measures again in the near future? #CoronaInfoCH", "RT @EU_Commission: The @ECDC_EU has published its weekly map.\n\nIt classifies regions based on the local epidemiological situation.\n\nSee the…", "268 new lab-confirmed cases\n23'712 tests\n1,1 % positivity rate \n33 hospitalisations\n3 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "It's confirmed: Tokyo Olympics will be held without spectators. #CoronaInfoCH", "Tendencies? Due to rising numbers of infections, parts of the Netherlands closes night clubs again. #CoronaInfoCH #Netherlands", "After #Delta now also #Lambda. Go get vaccinated and test frequently, or we have to learn the entire Greek alphabet. #CoronaInfoCH https://t.co/3r2NZVoSmR", "Confirmed: Swiss Covid Certificate now officially accepted by the EU. #CoronaInfoCH\n\nhttps://t.co/NDyaPNdzbr", "Two weeks before Olympics: Japan goes back into state of emergency, due to rising numbers of infections. #CoronaInfoCH #Covid #Olympics https://t.co/6tLRAd50n5", "BAG in a press conference now: ‚The delta variant makes 30% of current infections“. #CoronaInfoCH", "274 new lab-confirmed cases \n21'975 tests\n1,2% positivity rate \n3 hospitalizations \n0 deaths\n\nRelated to Coronavirus in the last 24 hours in Switzerland.\n#CoronaInfoCH #COVID19 #coronavirus #Covid", "To clarify: With 'current tendencies' I don't think of drastic ones, but it might be important to shed a light on the vaccination campaign progress, the delta variant, the feedbacks of less restrictions, the covid law and other sorts of interesting topics related to the pandemic.", "I'll also switch to tea, but you can still buy me a coffee if you feel like supporting me. :-) https://t.co/kojxpNz1IB", "Due to current tendencies I have decided to keep the account running until I'm tweeting against a wall. #CoronaInfoCH", "Data analysis / study suggests that celebrations after  🇨🇭's football matches might be responsible for increases of the number of infections. #CoronaInfoCH https://t.co/XBODSIju3D", "Nursing homes show relatively low rate of vaccinations amongst caretakers and caregivers. Alain Berset fears a high infection rate amongst 80+ year olds in autumn. #CoronaInfoCH https://t.co/GdV0BfmcSO", "12-15 year old kids can now also get vaccinated. But only roughly 10 percent of those kids got an appointment so far. #CoronaInfoCH https://t.co/1xpXOtQHa1", "Israel counts an increase of new infections with the delta variant. Studies suggest that Pfizer vaccine is only 60-80% effective against the variant. #CoronaInfoCH https://t.co/mO3H70aP7H", "From now on: The free self tests are only available for those that are not vaccinated. #CoronaInfoCH https://t.co/n6Xfv8sYuZ", "https://t.co/qKxVLnsITD", "Switzerland: 218 people have been infected with coronavirus so far - despite of being fully vaccinated. #CoronaInfoCH", "Correction: 5 and 10k per day, not per week! https://t.co/pH24iLLXQD", "Correction: 5 and 10k per day, not per week!", "Less and less people are willing to get vaccinated. E.g. in Zurich it was 10k / week last week. This week only 5k/week. Experts name two reasons: Fear of side effects and holiday time. #CoronaInfoCH https://t.co/SdiWIZsK9P", "Switzerland relaxes travel rules for vaccinated Americans and Brits: What you need to know. #CoronaInfoCH via @TheLocalSwitz \n\nhttps://t.co/UNrBsDNcbi", "@petratsis But thanks for the offer! I‘d get back to you. :)", "@petratsis Of course that was on my mind - but that‘s a lot of work for 1 person! :)", "Canton Zurich tries to get young people to the vaccine centers with paid instagram ads advertising the pros of being vaccinated – ‚way too short nights‘. https://t.co/moDmeCe46H", "RT @TheLocalSwitz: The Federal Council announced on Wednesday that Switzerland’s employees can return to their offices, as teleworking is n…", "RT @TheLocalSwitz: Starting on Saturday, many of the coronavirus measures will be lifted in Switzerland — the easing which is more extensiv…", "Knowing the struggles of not mastering a native language, I have been happy to help non DE/IT/FR speakers in 🇨🇭 through the jungle of Covid news. But how about after the pandemic? Brainstorm! Tell me what you would like me to tweet about in English! #CoronaInfoCH", "@AnExpatWife I‘m glad for you! And also glad to hear that your husband was better after the 2nd. Makes me less anxious! :-D", "@AnExpatWife Did he get moderna? Yeah it‘s annoying! Especially when you have to move houses at the same time 😄", "RT @JohnMu: @CoronaEnglish Color-coded wristbands seem like a simple &amp; non-awkward solution to letting people express their preferences ...…", "@AnExpatWife Yesterday was all a bit shaky and wobbly, mostly super tired. Last night: the weirdest feverish dreams. Today: worn out, but paracetamol gets me through. Sore arm is persistent though.", "@tthurairajah Thanks, you make me very excited!", "An idea from wedding planners in the US: Wearing red wrist bands to signal that someone shouldn't come too close in a social situation. \nI find wrist / arm bands *very* disturbing, who doesn't? #CoronaInfoCH \nhttps://t.co/Gq1ZDhG0vr", "@_monbaum @polinapoluekt @laurie_theurer I swear mine was salty (really salty) french fries. So weird!!", "Actually I fell asleep again after tweeting this, which is slightly unusual. Woke up craving for fast food (which is even more unusual, and I resisted). Gonna work, but from the couch. Feels a bit like a combo of a hangover from cheap wine and a tiny jet lag.", "Actually I fell asleep again after tweeting this, which is slightly unusual. Woke up craving for fast food (which is even more unusual, and I resisted). Gonna work, but from the couch. Feels a bit like a combo of a hangover from cheap wine and a tiny jet lag. #CoronaInfoCH https://t.co/yndJB4Q8Ud", "16 hours after first Moderna shot: Feeling fine! Sore arm but other than that, and after initial dizziness and clouded head - all fine! Go get vaccinated! #CoronaInfoCH", "@jeremyelmaleh I doubt!", "Big news today – almost all restrictions are being lifted by June 26th. Read everything in this thread. And if you want, you can buy me a coffee here: https://t.co/kojxpNz1IB\n(I will drink tea though, as Moderna really does its job.) Thank you! #CoronaInfoCH https://t.co/PwvSW4vrTr", "This might be relevant for many of you that are missing loved ones. #CoronaInfoCH https://t.co/xls9ON9Q8H", "Many always asked me, now here we go: \n\nThe entry of third-country nationals from countries such as the USA, Albania or Serbia is possible again.", "In addition, Switzerland is easing the remaining entry restrictions for third-country nationals who have been proven to be vaccinated. The corresponding list of countries has been adapted.", "Until now, a PCR test was necessary to travel to Switzerland by plane, but a rapid antigen test is now also sufficient. In future, the contact details will still be required when entering the country by plane", "Entry into Switzerland is made easier\n\nThe quarantine requirement is generally lifted for entries from the Schengen area. A test is only compulsory for people arriving by plane who have not been vaccinated and have not recovered.", "The Federal Council extends the protection period for mRNA vaccines approved in Switzerland for fully vaccinated persons to 12 months.", "Sports: There are no longer any restrictions in outdoor areas for people who practice sporting or cultural activities. Contact details must be collected for indoor activities. The mask requirement, the requirement to keep the distance and the capacity restrictions are lifted.", "For trade fairs without a certificate, mask requirements apply indoors and consumption only in the restaurant area.", "The ban on indoor trade fairs with fewer than 1000 people is lifted. In addition, there are no capacity specifications at trade fairs, regardless of the number of visitors or the restriction to people with a Covid certificate.", "Private events: inside 30, outside 50\nThere is no relaxation for private events. A maximum of 30 people can meet here in private indoor areas and a maximum of 50 people in outdoor areas.", "For indoor events, a mask is required and consumption only applies in the restaurant areas or at the seat, if the contact details are collected. There is no mask requirement outside. Events and concerts at which visitors dance, are prohibited.", "There are more requirements for events that do not require a Covid certificate. When the audience is seated, a maximum of 1000 visitors can take part. When the visitors are standing or moving, a maximum of 250 people can be admitted inside and a maximum of 500 people outside.", "Events with more than 10,000can take place again from June 26th and the capacity can be used to the full. In a protection concept, it must be specified, among other things, how access is restricted to visitors with a certificate. Events of 1,000 or more require a cantonal permit", "Clubs and dance halls are allowed to reopen if access is restricted to people with a Covid certificate. There is no upper limit to the number of people admitted and no mask requirement. This also applies to major events.", "In outdoor areas, the restriction on the size of guest groups and the mandatory seating for consumption are lifted. The distance between the guest groups must also be observed here, but no contact details have to be given.", "Restaurants: The restriction on the number of people per table has been lifted. However, it is mandatory to sit during consumption, distance between the groups, contact details must be given and a mask must be worn when you are not at the table.", "Shops, leisure facilities or sports facilities can use their full capacity. Aquaparks can reopen. At events without a required Covid certificate, however, there is a restriction to two thirds of the capacity.", "Students should be happy. The person restriction for face-to-face events in higher vocational education and training as well as at technical colleges and universities is lifted, also without the obligation to repeat tests.", "The home office obligation also falls. It will be replaced by a home office recommendation. So far, on-site work has been tied to repetitive testing. That is no longer necessary either.", "No more masks at the office desk: the general mask requirement is also lifted at work, according to the BAG. Employers decide where and when it is necessary to wear a mask in the workplace. The federal government also lifts the mask requirement in upper secondary level.", "In public transport, all places that have large openings on at least two sides, such as platforms (including underground), stops, underpasses and overpasses, or halls and shopping arcades, are considered to be outside spaces.", "The mask requirement in the outdoor areas of publicly accessible facilities, leisure facilities and restaurant terraces is LIFTED.", "According to the BAG, around half of the adult population will be fully vaccinated by the end of June. The Federal Council decided to open another major step before the summer holidays. These relaxations come into effect on June 26th:", "(Thread) \nCoronavirus Press Conference, Switzerland, 23.6.2021. \n#CoronaInfoCH #Switzerland #Coronaviurs", "Honestly i feel like i am 16 and just smoked something I shouldn’t have.", "You can read everything about today’s news and new easings in this press release. #CoronaInfoCH \n\nhttps://t.co/EtkaEXVtPZ", "Due to vaccination date I’ll summarize todays press conference later this afternoon. #CoronaInfoCH", "These 15 minutes pre-Moderna. https://t.co/xfg1qy4Ox8", "New easings from June 26. #CoronaInfoCH https://t.co/4YPVhS0Q6w", "BAG changes its vaccination recommendation – 12 to 15 year old kids can now get vaccinated. #CoronaInfoCH #Children #Impfung #vaccine https://t.co/SGNCbUspWJ", "BAG says: Delta variant spreads quickly in Switzerland, but the vaccine is efficient in terms of protection #CoronaInfoCH https://t.co/GBUtNoiAtq", "Amongst the 621 voters, the majority feels slightly anxious about 'going back to normal'. Interesting but not so surprising. #CoronaInfoCH https://t.co/iTWomEsA4N", "Press conference live now. I will summarise right after. #CoronaInffoCH https://t.co/anZGS7787I", "Especially younger women from the Swiss countryside are sceptical regarding the vaccine, according to this article. #CoronaInfoCH https://t.co/I8gW4WwuNR", "@Rachimus Get well soon!", "Lord, I hope my friend I'm asking for doesn't read here.", "Did you have side effects from the vaccine? If so, what? For how long? After the 1st or the 2d shot? Or both?\n(Asking for a friend 🤫) #CoronaInfoCH", "A survey amongst Swiss psychotherapists suggests: 47% of people are afraid of life going back to 'normal', mostly due to social anxieties. How do you feel about going back to normal? #CoronaInfoCH", "367 new lab-confirmed cases\n55'909 tests \n0,7 % positivity rate \n11 hospitalisations \n4 deaths \n\nrelated to #Coronavirus in the last 72 (!) hours in Switzerland. \n\n#CoronaInfoCH", "Happy Monday everyone!\n💉 💦 🎉 \n#vacme #CoronaInfoCH https://t.co/p9Yaes7ipU", "Germany takes Switzerland off their risk country list. #CoronaInfoCH \n\nhttps://t.co/SMIfYKACJt", "Delta variant: Lisbon locks down again and Boris Johnson has to delay the easing of measures in Great Britain by 4 weeks. Switzerland is not really concerned yet, according to the BAG. #CoronainfoCH https://t.co/R6RhLmboAI", "@SheeMeeHeer I feel you", "@dedeIion Good luck!!", "What's really bothering you this morning? #CoronaInfoCH", "RT @jonhenley: Dutch vaccination centres offering free, er, soused herring to everyone who shows up for their shot ... https://t.co/1qPSHpM…", "RT @MarkatCIFF: @CoronaEnglish Maybe a RT of this news: https://t.co/mRNA4HBr2r", "BAG makes it official: Vaccine shall protect us for 12 months. Prior it was 6. #CoronaInfoCH https://t.co/CYRwQU2yvo", "I'll obviously not retire yet and keep tweeting! But if you have  a job for me, hit me up! 🙂 I'm a freelance copy and ghostwriter outside twitter &amp; covid news, with lots of agency &amp; commercial experience. (Yes – covid wasn't easy for freelancers indeed.)", "Read about the (possible) upcoming lifting of current measures in Switzerland here. I feel like I can retire from this account. Don't worry, I won't yet. If you still want to buy me a drink, you can do it here: https://t.co/kojxpNz1IB Grazie 1000. &lt;3 #CoronaInfoCH https://t.co/fNyTLEihbE", "Anyone arriving by plane must provide their contact details. Switzerland also plans to relax the still existing entry restrictions for third-country nationals who have been proven to be vaccinated on June 28th.", "vaccinated and convalescent people can enter the country without the obligation to test or quarantine, the Federal Council demands. Those who have neither been vaccinated nor recovered must show a negative PCR test or rapid antigen test and go into quarantine after entering", "The current risk list of the Federal Office of Public Health is to be reduced and only contain states or areas in which virus variants that are worrying for Switzerland are circulating. The focus of the border sanitary measures is now on people arriving from such a state or area.", "The quarantine is to be lifted for entries from the Schengen area. A test is only required for people who have not been vaccinated &amp; have not recovered. the contact details will still be required when entering by plane. This is waived for travelers by train or car.", "If the distance cannot be maintained, for example in team sports, or if the mask cannot be worn, for example in endurance sports or when rehearsing with wind instruments, it should be new a capacity restriction of 10m2 per person apply. Choirs should  be able to perform indoors.", "For sport, the restriction on group size, both indoors and outdoors, should be completely lifted. A mask requirement should continue to apply indoors and the required distance must be maintained, according to the Federal Council.", "In facilities where it is not possible to wear a mask, such as indoor swimming pools, ten square meters per person must be allowed for.", "Shops, leisure activities or sports facilities should be allowed to make greater use of their capacity. The rules are standardized: If a mask is worn indoors, only 4m2 per person should be included.", "For events without compulsory seating, an upper limit of 250 people should apply, and a mask requirement applies indoors. For events outside, a mask is required when moving. The capacity of the location may be used up to half.", "The situation is different for events without a Covid certificate. An upper limit of 1000 people should apply here if there is compulsory seating, as is the case, for example, in the cinema or at a football match.", "Two thirds of the capacity can always be used. Events with fewer than 1000 people, sports, cultural and leisure activities can restrict access to people with a Covid certificate in order to benefit from easier protective measures.", "In addition, the maximum number of people is to be standardized: a maximum of 3,000 people inside and 5,000 outside should be able to participate, regardless of whether a seat is compulsory.", "Last month, the Federal Council decided that major events with a Covid certificate would be possible again from July. In the future, a mask requirement should apply - but only for events indoors. You should be able to do without the mask outside.", "What is possible in private should also be allowed for events in publicly accessible facilities. This means: If there are no more than 30 people inside or 50 outside in the family and friends, protective measures can be dispensed with.", "As before, it is compulsory to sit and the mask must be worn when you are not sitting at the table.", "Previously, a maximum of 6 people were allowed outside at a table of a restaurant, but the Federal Council no longer wants to limit the number of people at the table. It's different inside: Restaurants should now be able to welcome 6 people per table instead of the previous 4.", "Clubs and dance halls should be allowed to reopen if access is restricted to people with a valid Covid certificate. A maximum of 250 people may be present at the same time. There is no need to wear a mask, but the clubs must collect the contact details of the guests.", "In the area of education, the Federal Council wants to lift the mask requirement throughout Switzerland in the upper secondary level. The cantons should again be responsible for rules at grammar schools, technical secondary schools and vocational schools.", "The general mask requirement is to be lifted at work in the future. Employers can now decide for themselves whether the mask should be worn. Schools should also be able to benefit from this relaxation.", "(Thread) The Swiss Federal Council has presented a next step of easings of current measures. They should be applied by the end of June. On June 23 the Council will fially decide. Read about all the planned easings here. #CoronaInfoCH", "According to this article, the federal council is discussing today &amp; there is a potential that they decide to waive mandatory masks in Switzerland. #CoronaInfoCH \nhttps://t.co/5NWX5Vy0J1", "RT @robjohnnoble: @swisspuppy @CoronaEnglish And the Swiss Federal Railways FFS", "St. Gallen is the first canton to issue Covid certificates. If you live there, you can request it from today. #CoronaInfoCH https://t.co/zJYw3tAZ9d", "RT @de_laubi: @CoronaEnglish the Swiss and the English language don't mix. the Young Boys play at Wankdorf. The Blue Balls Festival. Swissc…", "RT @swisspuppy: @CoronaEnglish I think a naive grandpa. It might have been the same person who allowed the bus system in Ticino to be calle…", "I‘m still wondering if it was a sneaky intern or a naive grandpa that came up with the ‚vacme‘ domain for those vaccination appointment websites. #offtopic #CoronaInfoCH", "(2/2)\nThe vaccination campaign is also going smooth, with 40 percent of the population vaccinated at least once. The vaccination protection could be extended up to 10 months. The Covid certificate is in the pilot phase and  should be established at the end of June.#CoronaInfoCH", "(1/2) \nAt today's press conference, the federal experts spoke about the current epidemiological situation, the vaccination campaign and the Covid certificate. The number of cases and the incidence are easing. #CoronaInfoCH \nhttps://t.co/Wnpd2lDlFS", "The way how you get your certificate into your Covid certificate app depends on each canton. This is a helpful article to find out how it works in your canton. #CoronaInfoCH https://t.co/3Y5fagiS04", "The pilot project with the Covid certificate starts this month. This should be available to all vaccinated, recovered and tested people by the end of June. The associated app can already be downloaded for iOS from the app store. #CoronaInfoCH \n\nhttps://t.co/pomJw83M3B", "22,08 % of Swiss population already fully vaccinated. #CoronaInfoCH https://t.co/q9Cw8iqJN3", "Confirmed: The covid certificate that lets you travel + proof tests / previous infection / vaccine status is coming next week. It should be compatible with certificates in all other Schengen countries. Read all details here. ⬇️ #CoronaInfoCH https://t.co/Hxj9PI4lK1", "With regard to its use in Germany, some things remain unclear. More details will be announced later this month. The systems should not be overloaded on June 7th.", "Council intends to use it primarily for trips abroad. According to the government, the prerequisite for mutual recognition of the respective certificates in the Schengen area is met.Nevertheless, the authorities recommend that you learn what applies in the destination country", "Anyone who is already fully vaccinated can order the corresponding QR code and read it into the app. This will happen automatically from the end of June. Negative tests are displayed on the certificate for 72 hours. For those who have been vaccinated and recovered, 180 days apply", "Important: The authorities state that you always have to be able to show your ID or passport when showing the app - or your status.", "The responsibility of tasks lies within the cantons. The usage of the certificate is free and voluntary. The Federal Office for Information Technology and Telecommunications has created two apps for electronic use: one for keepers and one for examiners.", "Federal Council announced details of the Covid certificate  today. This will be available in both paper and electronic form from next Monday (7.6.), but the fed. authorities are assuming that nationwide certificates will not be issued until the end of the month.", "(Thread) \nSummary of today's press conference - mainly about the 'Covid certificate' app. \n#CoronaInfoCH #Switzerland", "491 new lab-confirmed cases\n26'033 tests\n1,9 % positivity rate.\n16 people hospitalized\n3 deaths\n\nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "Are you going to travel for summer holidays?", "Experts guess: Mask requirements could be lifted already in June (but the latest by the end of August). #CoronaInfoCH https://t.co/Oxe5Y9wJgV", "(2/2)\nreminded us 'this is not the normal life', in order for us to get back to that 'normal' life after the current pandemic rather than walking through life with 'habits' that formed during this time. \nAny heads up for candidates? \n#CoronaInfoCH", "(1/2)\nI'm interested in doing an interview with a pro (sociologist? anthropologist?) on this topic: How does it affect society that it got used to this gradual 'fade' of social norms due to the pandemic? And would it have been benefitial if state &amp; media constantly would have ...", "Who's also confused about the whole pandemic situation fading out, but not really? #CoronaInfoCH", "The new «risk country» list, valid from 3rd of June. Italian regions have been removed from the list, which means «green light» for all the Swiss that want to go on holidays this summer. #CoronaInfoCH #RiskCountries #Quarantine https://t.co/YY4fEib9nq", "A study by University of Basel suggests: 15% of 'heavy' Covid19 cases lead to diabetes. #CoronaInfoCH https://t.co/hNVkoHM3Rl", "More than 20% of Switzerland's population is completely vaccinated. #CoronaInfoCH https://t.co/q9Cw8iqJN3", "Virologist from Berlin says that Covid rapid tests fail when temperatures are rising. Rapid tests should be stored &amp; used at room temperature. #CoronaInfoCH https://t.co/aLNyLVLFrV", "‚Indian variant‘ is spreading in England and forcing some locations to introduce new measures / redo the easing. Experts say that Switzerland has to be alert as well - progress of vaccination campaign is relevant.#CoronaInfoCH  https://t.co/LyrYZC1OYL", "Daniel Koch kindly reminds us: Get rapid tested before you go to a restaurant / bar! The free rapid tests are available at pharmacies. A quick google search shows you which pharmacies have them. #CoronaInfoCH\n\nhttps://t.co/y4shAb6Zjt", "992 new lab-confirmed cases\n36 hospitalisations\n9 deaths\n29'120 tests\n3,4% positivity rate\n\nrelated to Coronavirus in the last 24 hours in Switzerland.\n#CoronaInfoCH", "@esi_zey 🥵🙏", "Really hope that this account can be closed soon. Although I‘d miss you all! #CoronaInfoCH", "Good article that summarizes all the new measures and changes valid from coming Monday! #CoronaInfoCH https://t.co/rtO8zDtuOc", "Soon you'll be able to have a coffee indoors. \nIf you prefer to instead buy me one, you can do it here (I'll have it at home or take away). Thanks to all supporters! \n#CoronaInfoCH \nhttps://t.co/kojxpNz1IB", "Are you happy about the easing of measures? #CoronaInfoCH", "The development of the Covid certificate is  on its way. “The goal remains June 1st” says Berset. “For those who have recovered, the certificate should be valid for six months.", "The vaccines in Switzerland are still not approved for children. “It remains that children are much less affected”. They are not a risk group. In addition, one expects vaccinations to be approved for everyone over the age of twelve in the summer.", "compulsory masks outside\nDo you have to wear a mask outside in the pool? \"If a distance of 1.5 meters cannot be maintained, then the mask requirement according to the BAG applies.\"", "Step 2: From July 1st, major events are possible again. The maximum number of people for indoor events remains, as suggested, at 3000 people. Outside, on the other hand, large events with compulsory seating and two thirds of the capacity can now take place with a maximum of 5000p", "Big events: \nStep 1: Pilot events are possible from June 1st. The maximum number of people for indoor events is 600 people, as suggested in the consultation. Up to 1000 people can take part in outdoor pilot events instead of the 600 as originally planned.", "In the cinema you can eat and drink while you are sitting, contact details must also be registered here, this also applies to religious and political events.", "Those who have recovered are exempt from contact quarantine and travel quarantine for six months.  vaccinated persons are now also exempted from contact quarantine and travel quarantine as well as from the obligation to test and to provide contact details upon entry for 6 months", "This also applies to private events such as wedding or birthday parties that do not take place in your own private premises.", "Public events: inside 100, outside 300 people. The same rules apply to religious events. Events without an audience, such as club events or guided tours, possible inside &amp; outside with a maximum of 50 instead of the previous 15.", "(Thread) \nCoronavirus press conference, 26.5.2021, Switzerland. \n#CoronaInfoCH #Switzerland #Bundesrat", "Here we go. #CoronaInfoCH https://t.co/2W53aVscZe", "Press conference about new easing of measures starts at 13:45. I will summarize later! #CoronaInfoCH", "The Swiss federal council is currently discussing further easing of the measures. These include, amongst others, opening the indoor areas of restaurants, the end of working from home, more ppl at events. I will tweet later today about the decisions! #CoronaInfoCH", "Study suggests: Moderna vaccine to be 100% effective amongst young people between the age of 12 and 17. #CoronaInfoCH #Moderna https://t.co/YUeS7aDwnz", "4'741'150 vaccine doses delivered\n4'280'630 vaccination shots administered\n17,4% of the whole Swiss population fully vaccinated \n\n25.5.2021, Switzerland. \n\n#CoronaInfoCH #Switzerland #Schweiz", "2770 new lab-confirmed cases\n88'427 tests\n3,1% positivity rate\n80 hospitalisations\n13 deaths \n\nrelated to Coronavirus over the weekend (including yesterday) in Switzerland \n\n#CoronaInfoCH", "Off topic. Whats your favourite Swiss word?", "3'908'500 vaccine doses delivered so far \n3'689'909 doses used so far \n14,37% of people in Switzerland are fully vaccinated. \n\n18.5.2021, Switzerland. \n\n#CoronaInfoCH", "1240 new lab-confirmed cases\n22'036 tests\n5,6% positivity rate \n71 hospitalisations\n10 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH #Switzerland", "By the end of June, also 12-15 year old children should be allowed to get vaccinated. #CoronaInfoCH https://t.co/V32Mvk2Yu7", "It will be better. If we stay careful! #CoronaInfoCH", "Starting from today Sunday people from the EU (and Switzerland) can travel to Italy without having to quarantine. A negative PCR test is enough. #CoronaInfoCH #Italy  https://t.co/bFMguaXqRX", "So far 129 people in Switzerland got infected with Coronavirus despite being fully vaccinated. #CoronaInfoCH  https://t.co/Q2zZ2VyX6f", "Swiss politicians discuss benefits for people that are vaccinated. One of them might be that they won‘t have to wear a mask anymore. #CoronaInfoCH  https://t.co/EoOQTQ96BJ", "On may 31 you might drink a coffee somewhere out &amp; inside, or buy me one. For all Twinters, you can also Twint me on this number: +41 76 511 13 28 (not my personal Number, TWINT only). Thanks a lot 🌞https://t.co/kojxpNz1IB", "3 million doses of vaccine for the world\nFederal Councilor Berset declares that Switzerland wants to take part in the Covax global vaccination campaign. The Federal Council proposes that three million doses be dispensed as a first step. #CoronaInfoCH #COVAX", "@CTRexPope Ah sorry, the quarantine you mean – this I'm not sure yet", "@CTRexPope End of May!", "Read all the news about the measures from May 31 here. #CoronaInfoCH https://t.co/whYmWLLUYv", "The Federal Council wants to make a definitive decision after the consultation on May 26th.", "Quarantine: In addition to those who have recovered, vaccinated persons should also be excluded from both contact quarantine (contact with an infected person) and travel quarantine.", "Thermal baths and wellness facilities are allowed to reopen.", "At universities, the restriction to a maximum of 50 people for face-to-face events has been lifted. The prerequisite is a test concept as part of the cantonal test strategy and approval from the canton.", "Working from home obligation is converted into a home office recommendation for those companies that test repeatedly.", "For performances and rehearsals in the field of lay culture, the upper limit of the group is 50 people - both indoors and outdoors. Choral concerts in the open air are again permitted, both for amateur and professional purposes.", "Contact sports such as judo or wrestling are allowed indoors without a mask in constant groups of four people.", "A maximum of 30 instead of 15 amateurs are now allowed to do sports together. The public is allowed, even in competitions. For team sports in national and regional leagues, there is even a group size of 50 instead of 30 people.", "Inside areas of restaurants are to be reopened with protective concepts - if the number of cases falls or remains stable by the end of May. The mask requirement at the table should be lifted on restaurant terraces.", "Club events or guided tours should be possible inside and outside with a maximum of 30 instead of the previous 15 people.", "For events with an audience, there is now a limit of 100 instead of 50 people inside and 300 instead of 100 people outside.", "The epidemiological situation is easing, the number of cases is falling, and there are fewer serious cases and deaths. This is what the Federal Council is proposing as a major easing package to the cantons by May 31. These are the key points:", "(Thread) \nDecisions about easing of Coronavirus measures, 12.5.2021. \n#CoronaInfoCH #Switzerland #Schweiz #Lockdown #Bundesrat", "BREAKING &amp; Confirmed: \nFrom May 31:Restaurants reopen indoor areas (if numbers fall or stay stable) #CoronaInfoCH", "Press conference today 15:15h about possible new easing of covid measures. I‘ll tweet live! #CoronaInfoCH #Bundesrat", "Tomorrow the council discusses complete reopening of restaurants, end of working from home, on site lectures at universities. Decision is to be expected by May 26 – easing by May 31. #CoronaInfoCH #Lockdown https://t.co/qKePNQlMTg", "One-direction-swimming, mask requirement up to the pool and no direct mouth-to-mouth resuscitation from the lifeguard: That's how strong the corona rules are in the pool. Now the BAG suggests easing them a bit. #CoronaInfoCH https://t.co/4PcOkNAXQP", "„We are in this together“ is true. Although it should be added that some people might experience the mentioned emotions in very severe forms, and well-meant cheer ups like „we are in this together“ can enhance them. Pay close(r) attention to loved ones! #CoronaInfoCH https://t.co/zUe6OZFAZD", "Canton Aargau: Registration for vaccine is open for everyone. #CoronaInfoCH https://t.co/zJYw3tAZ9d", "RT @lpuerto: Vaccination is open to everybody in #Zurich \n#COVID19 #CovidVaccine #CoronaInfoCH \nCC/ @CoronaEnglish", "We all want a world where this account is completely obsolete.\n\nBut for now - sorry, but yeah. If you appreciate my work, please buy me a coffee! Danke, merci, grazie, thanks! 🤍\n\n#CoronaInfoCH \n\nhttps://t.co/mCeRvgthWF", "End of press conference. Thanks for following!", "\"It is basically possible that you can be vaccinated in another canton, for example at work,\" says Nartey. That is already practiced.", "The health care staff is  motivated and wants to be there for the patients. But the staff also need relief, which is high for a long time, says Andreas Stettbacher. Therefore, we would have to ensure that the intensive care units are relieved by keeping the number of cases low.", "\"Our goal is to be able to provide a vaccination certificate in June,\" says Patrick Mathys. The goal is to be internationally compatible.\nThe EU will set certain standards by May.\nIn principle, it is also possible that there is more than one certificate at national level.", "\"The vaccine for children would not be sufficient until June,\" says Mathys. In the case of children under six years of age, it is unlikely that they will be able to be vaccinated this year. This is because the studies are not yet sufficient.\"", "The British variant spreads more easily than the other variants in Switzerland. There can also be another variant that exploits niches in the non-immune population and spreads, says Mathys. The Indian variant could be such a case.", "It is legally possible that there is a vaccination certificate that could also allow travel, but this must be internationally recognized. We are currently working on a joint solution, says Patrick Mathys.", "\"How big is the vaccination risk in children?\" From a medical point of view, it makes sense to vaccinate children as well, says Karrer. This also applies from an epidemiological point of view, adds Mathys.", "Linda Nartey, Vice President of the Association of Cantonal Doctors. She expects that all cantons will approve vaccination for everyone in the next few weeks.\nThe task force assumes that around 80 percent vaccination will be needed to get B.1.1.7 under control.", "It is important that younger people also get vaccinated, says Karrer. More and more people between 40 and 60 years of age are being treated for Covid in hospitals, says Karrer.\n50 to 60 year olds should be considered risk patients, he says.", "Urs Karrer: \"4 new beds in the intensive care unit require 12 to 16 new nurses.\" The staff has been in constant stress since October. “At the same time, with the vaccinations, a solution is within easy reach. The vaccination campaign is the only way out of the pandemic.\"", "B.1.1.7 has prevailed\nUrs Karrer, Vice President, National COVID-19 Science Task Force. He is responsible for people who are seriously ill with Covid-19. \"Due to the higher transferability, virus variant B.1.1.7 has prevailed.\" The variant would also cause serious illness\".", "Intensive care units heavily used\nThe intensive care units are busy today, says Andreas Stettbacher. The burden on the staff is high.", "“There is still good reason to remain cautiously optimistic about the epidemiological situation,” says Patrick Mathys, Crisis Management and International Cooperation. \"We have now reached a level of around 2000.\" The R-value is also at a low level.", "(Thread) \nCoronavirus press conference, 5.5.2021, Switzerland \n#CoronaInfoCH #Covid19 #Schweiz #Bundesrat", "1633 new lab-confirmed cases\n22'716 tests\n7,2 % positivity rate\n65 hospitalizations \n13 deaths\n\nRelated to coronavirus in the last 24 hours in Switzerland. \n\n#CoronaInfoCH", "Nepal will be added to the risk country list from tonight 6pm. #CoronaInfoCH https://t.co/ZTk9E3OYKh", "Friendly reminder: Make use of the free self tests before meeting people! \n\n(But remind yourself that they don't replace PCR tests as they aren't as reliable as the PCR). \n\n#CoronaInfoCH", "620,000 new vaccine doses have arrived in Switzerland since Friday. \"On Friday around 500,000 vaccine doses were delivered by Moderna to Switzerland, and today another 120,000 vaccine doses from Pfizer arrived\", writes BAG spokeswoman Masha Foursova on request. #CoronaInfoCH https://t.co/XxOm6wb1pa", "Lonza and Moderna want to boost their vaccine production with three new production facilities in Visp, Switzerland. The federal government is now helping the pharmaceutical company to find staff in order to prevent bottlenecks. #CoronaInfoCH \n\nhttps://t.co/ooHracHmKh", "Nowhere else are so many people infected with the coronavirus as in India. 400,000 per day – and there's not enough vaccination doses. #CoronaInfoCH #India \nhttps://t.co/XqgvWVQhPe", "Due to a technical issues at @BAG_OFSP_UFSP, the weekends numbers a little delayed today: \n\n3978 new lab-confirmed cases\n67'212 tests\n5,9 % positivity rate\n119 hospitalised\n16 deaths \n\nrelated to #Coronavirus in the last 72h in Switzerland. \n#CoronaInfoCH", "\"Deliveries are on their way: today Switzerland is receiving half a million doses of Moderna vaccine. Delivery from Pfizer / BioNTech will follow on Monday.\" #CoronaInfoCH https://t.co/B7rVonULFW", "In terms of doses per 100 inhabitants, we are lagging behind our neighboring countries Austria, Germany, Italy and France. But when it comes to the fully vaccinated, Switzerland has overtaken its neighbors with 10.1 %. #CoronaInfoCH \nhttps://t.co/pK3M2K4YH5", "30 April 2021, Switzerland: \n\n3'091'575 vaccine doses delivered\n2'642'062 vaccinations given \n= 10,76 % of population is fully vaccinated. \n\n#CoronaInfoCH", "1831 new lab-confirmed cases\n32'979 tests\n5,6% positivity rate\n108 hospitalisations\n8 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. \n#CoronaInfoCH", "From July: Events with 3000 people allowed, according to Federal Council. The Cantons have to agree as well though, depending on the epidemiological situation. #CoronaInFoCH  https://t.co/413M8tbM5u", "@lpuerto Because technology. https://t.co/1X9ebb64eD", "Zurich now vaccinates people from the age of 50. In the first two weeks of May, 54'000 slots are available. #CoronaInfoCH #Zürich https://t.co/xMwKDypxEg", "The federal experts discussed the plan for a internationally valid vaccination certificate. This should be available on paper as well as digitally. It should be issued by  summer and be internationally recognized and forgery-proof. #CoronaInfoCH \nhttps://t.co/uCIhnacMtg", "EU parliment is currently discussing the vaccination certificate – the digital vaccine passport. If all goes right, we can expect it to be introduced by the end of June. Switzerland is also working on it's own (compatible) version. #CoronaInfoCH https://t.co/ngQnx9upnI", "Breaking: India will be on the risk country / quarantine list from today 18:00. #CoronaInfoCH https://t.co/9uJihUqlTm", "Don't feel bad about feeling bad, reach out if you are loved ones (or coworkers, neighbours, etc.) seem to not be ok. Here is a very helpful brochure in English with lots of information and contacts: https://t.co/b5BZUL1uFL", "How are you? \nThe pandemic can put a strain on our mental health &amp; some people are naturally more vulnerable to the situation. Especially as 'newly' acquired habits &amp; social behaviors now slowly feel 'normal', it's important to sometimes check in with yourself (...)\n#CoronaInfoCH", "«For a year now, we’ve been living in constant fear of Covid-19. But when you get that vaccine in your arm, it’s not like your stress will magically melt away.» #CoronaInfoCH \nhttps://t.co/0tkDBVRiJP", "Thanks to everyone who has supported my work so far. Due to many requests – yes you can also Twint me. Just DM me for the details. Have a nice day and stay safe! 💕", "Source: https://t.co/h7mJkkicuz", "As of April 26, 2021, 1624 infections with the Swiss mutant are known worldwide. Almost all of them were found in European countries.", "If B.1.1.39 resembles the British mutant: will it then also gain the upper hand and displace others?\nNo, that is not to be expected. According to the Pangolin database, it was relatively widespread in the second wave. But since the end of January, it seems to have been in decline", "How dangerous is the Swiss mutant?\nB.1.1.39 is described by researchers as just as contagious as the British mutant. In addition, people who have already recovered from Covid-19 seem to be able to become infected with it, as the case of the 57-year-old Italian suggests.", "B.1.1.39 was discovered in Italy, but is called the Swiss mutant. Why?\nThis is due to the fact that this variant of the coronavirus has so far been detected by far the most frequently in Switzerland.", "It was discovered by researchers from the medical institute IRCCS in Candiolo near Turin in collaboration with bioinformaticians from the Italian Institute for Genomic Medicine. It was detected in the samples of a 57-year-old Italian from the Turin area.", "It has been detected this weekend and is similar to the «British variant» B.1.1.7.", "Now finally: A «Swiss mutation» of the Coronavirus. B.1.1.39. \nRead all infos in this thread. #CoronaInfoCH #B1139 #SwissMutation #Switzerland", "5313 new lab-confirmed cases\n70'617 tests\n7,5 % positivity rate\n132 hospitalisations\n16 deaths \n\nrelated to #Coronavirus in the last 72 (!) hours in Switzerland. \n#CoronaInfoCH", "Hand up if you‘re staying home tonight! 👋", "News about the first case in Switzerland with the variant originating in India: The sample has been detected already by the end of March, in canton Solothurn. #CoronaInfoCH https://t.co/V7IMv0uko9", "Switzerland confirms first case of Indian Covid-19 strain. \nIt was brought to Switzerland by an incoming passenger traveling via a transit airport to Switzerland. Consultations about putting India on the high risk county list have started. #CoronaInfoCH #IndiaFightsCOVID19 https://t.co/oTuieTyEai", "Life expectancy in Sao Paulo decreased by almost 1 year. These days in Brazil also children and babies fall victim to Coronavirus. #CoronaInfoCH https://t.co/gEOs5WXcmL", "2113 new lab-confirmed cases\n31'186 tests\n6,8% positivity rate \n80 hospitalisations \n7 deaths\n\nRelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "Press conference now. Most important: Berset says that before May 26 there are no further easings of the current measures to be expected, due to the epidemiological situation. #CoronaInfoCH", "Better buy me a coffee than having one on a terrace.  Grazie mille. 💕 #CoronaInfoCH https://t.co/kojxpNz1IB", "2141 new lab-confirmed cases\n23'812 tests\n9% positivity rate \n77 hospitalisations\n13 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "! #CoronaInfoCH https://t.co/u6fxkxDtcT", "End of the press conference. Thanks for following!", "Will cantons that want to give company vaccinations be given additional doses?\n\"We are looking at how we can pursue this idea. Company vaccinations only make sense in large companies. That becomes an issue when large quantities of vaccines are available.\"", "Is Swissmedic more cautious than the European authorization authority?\n“You can see it that way,” says Bolte. “Even if you look at what happened after the rapid approval in Europe. We may be stricter, but I'll leave that to others to judge. Our mantra is: Safety first. \"", "Is India Coming On The Risk List Soon?\n\"India is under surveillance,\" says Mathys. “We know that there is this double mutation there. We are monitoring the situation and are advised by a committee. At the moment, the data situation is not sufficient to make reasonable statements\"", "Has the epidemiological situation among children improved?\n\"At the beginning I showed that younger age categories are more affected,\" says Mathys. “But the situation has not developed in such a way that you have to pay special attention to the children.", "Is the information about the deep sensitivity of the self-tests adjusted?\n\"We have always pointed out that the sensitivity of self-tests is low,\" says Mathys.", "Why do wind musicians have to keep so much distance?\n\"As with singing, the point here is that aerosols are produced,\" says Mathys. \"Hence the decision that the distance must be greater than in other settings.\"", "Is it still realistic to vaccinate all those willing to vaccinate by June?\n\"We are on course,\" says Kronig. \"Our goal of vaccinating all those willing to vaccinate in the first half of the year remains.\"", "Has a technical solution been found for the vaccination certificate?\n“The decision has not yet been made,” says Mathys.", "Why did the number of cases not increase as much as assumed 3 weeks ago?\n\"The number of cases has actually not developed as expected. This is largely thanks to the population, who adhered to the rules well.\"", "The task force recommends wearing a mask and keeping your distance for all sporting and other activities where people come together.", "New: people who have been fully vaccinated with mRNA vaccines are exempt from quarantine for six months from 14 days after the second vaccination, if they come into contact with a confirmed case. It is important that those who have been vaccinated will still get tested though.", "\"We were very pleased about the approval application from Curevac, of which we have ordered 5 million cans,\" says Kronig. \"And we are waiting for news from AstraZeneca.\"", "“We're sticking to our schedule,” says Kronig. «We are on course, but we have to accompany our plan. Moderna has informed us that there will be a shift in the delivery dates. We will receive 200,000 fewer vaccine doses to be delivered by June. \"", "Vaccine:\n\"Last week we passed the 2 million inoculated doses threshold, this week we passed 3 million doses delivered\"", "Switzerland has signed a contract with Roche for a promising drug against Covid-19. \"The federal government bears the costs if they are not covered by the health insurance companies.\"", "\"An increase in the number of cases after Easter could not be observed,\" says Mathys. \"Remain cautious and try to do your part to ensure that the situation at least remains as it is.\"", "- Why this increase, especially in the intensive care places? “One possible explanation would be that younger people wait too long because they expect a mild course. Then they are taken straight to the intensive care unit. \"", "There is also a high increase in hospitalizations among younger people. “We currently have more young Covid patients in the hospital, not only proportionally but also in absolute terms. The number of hospitalizations is currently increasing. \"", "Mathys is concerned that more and more young people are affected by Covid-19. The decline in the elderly could have something to do with the increasing vaccination coverage, says Mathys.", "Mathys shows a comparison of the reported infection numbers and the wastewater data from Zurich. \"It may be that the number of cases is underestimated,\" says Mathys.", "The number of infections is stagnating slightly. \"It is noticeable that there has been massively less testing since Easter,\" says Mathys. The R value has recently decreased, but since it is still above 1 at 1.1, the number of infections can still be expected to rise.", "(Thread) \nCoronavirus press conference, 20.04.2021, Switzerland \n#CoronaInfoCH #Coronavirus #Switzerland #Covid19", "Many news out on todays press conference. Working on a thread now, will be up soon! #CoronaInfoCH", "Correction. Swissmedic gave the go-ahead before the official authorisation. #CoronaInfoCH https://t.co/CiZCXQbVkB", "Press conference today 2pm. I will summarise afterwards. #CoronaInfoCH https://t.co/uGGUze6mIp", "Switzerland orders 3000 doses of Roches medication that should avoid heavy cases of #Coronavirus. The medicine has not been approved yet though. https://t.co/03bCVVLWG3 #CoronaInfoCH", "@Csillada Indeed! It was just a spontaneous (personal) suggestion, but I appreciate and share your opinion too. :-)", "Changes in BAG's vaccination strategy results in 10'000s of unused vaccination doses that some of the cantons don't use immediately. The Federal Government stresses them to adapt to the changes and use them wisely asap. #CoronaInfoCH https://t.co/4SykjxCnku", "Yes, technically you can join one of those weekend protests against the measures. \nBut technically you can also just have a good time. Maybe some wine in the fresh air, hopefully some sun, a nice walk with ones you love, and it will be amazing. Enjoy your weekend! #CoronaInfoCH", "New variant found in UK. It was first detected in India. It's worrying researchers as it contains 2 mutations that might  help the virus to evade the body’s immune responses. There are  concerns the variant might be more infectious than earlier variants.\nhttps://t.co/9PDkeEkunw", "Vaccination update for Switzerland, 16.4.2021. \n\n2'427'250 doses delivered\n1'966'485 shots so far \n732'812 people are fully vaccinated \nThis equals 8,48% of the population living in Switzerland. \n\n#CoronaInfoCH", "2205 new lab-confirmed cases\n32'312 tests\n6,8% positivity rate\n85 hospitalisations\n4 deaths \n\nrelated to #Coronavirus in the last 24 hours in #Switzerland. #CoronaInfoCH", "@lpuerto Oh, thank you so much for the hint!!! I will try that now immediately.", "@lpuerto @lpuerto were you hopefully able to register in the end?", "@lpuerto I haven't registered yet, but wanted to do so now. It's when I try to access the website: https://t.co/uUJLM6vCnC", "@lpuerto Waiting list.", "It's strangely silent today amongst all Swiss media outlets when it comes to the Coronavirus.", "Big poll: Are you happy with the easing?", "2226 new lab-confirmed cases\n31'019 tests\n7,2 % positivity rate \n115 hospitalisations\n21 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "@rob1cox With masks!", "Working from home: \n- remains, because commuting would lead to many contacts", "Music practice: \n- allowed again, with up to 15p \n- singer or wind instrument players need a space of 25m2, or masks", "Barbecues outdoors: \n- Allowed again, with up to 15p (children included / counted too)", "Gyms:\n- open again. \n- more than 15p allowed, as gyming is not a group excercise\n- masks AND 1,5m distance mandatory\n- exceptions for masks: e.g. cardio (ask your instructor)", "Sports / exercise: \n- trainings possible, also for adults, max 15p\n- masks OR 1,5m distance mandatory \n- Council advises to get tested before trainings etc. \n- Pools still very unclear, tbc.", "University: \n- lectures with up to 50p are allowed again", "Indoor events: \n- 50p allowed (cinema, theatre, concerts) \n- ... but only 1/3 of max capacity of venue can be used \n- 1,5m distance &amp; masks mandatory\n- family and household is excepted from 1,5m", "Outdoor events: \n- Outdoor events with 100p max allowed \n- Safety measures remain\n- Sitting &amp; masks are mandatory", "Restaurants: \n- Terraces can open \n- Max 4p / table. 1,5m between tables. \n- Take-Away can have outdoor tables too \n- Establishments must close by 11pm", "(Thread) \nThe most important facts about the easing of measures after coming Monday, 19.4.. \n#CoronaInfoCH #Schweiz #Switzerland", "«If todays decision is being interpreted in a way that we now can be easier about everything, we'll face a catastrophe», says Berset in an interview. Well, ... https://t.co/3YI3OLvIoY", "Raise your hand if you think the wine that you have at home is anyways better than what 99% of bars offer.", "RT @MargauxLang3: @CoronaEnglish @Hjodda @taebonga On @Forum_RTS it has just been said that it will be possible to go to a swimming pool to…", "@Hjodda @taebonga Thanks!", "That was unexpected big news. I will write a thread that summarizes all the important info later today, after the press conference. In the meantime, if you want to support me for my work, you can buy me a coffee here https://t.co/kojxpNhqk1 Thanks &amp; Stay safe! 😷 #CoronaInfoCH https://t.co/yUvhSMtI2f", "Working from home remains until further notice. #CoronaInfoCH", "Imagine sitting in the movies. And then someone coughs. #CoronaInfoCH", "@steveswitzerlan https://t.co/vzkvtmNDlj", "The English version of the poster. https://t.co/k7Rjararwq", "RT @swissinfo_en: The Swiss government plans a significant loosening of anti-Covid measures from next Monday, saying it is taking a calcula…", "Switzerland is opening up on Monday, 19 April. \n#CoronaInfoCH #Switzerland #Schweiz #Terrassen #Fitness #Lockdown #Bundesrat https://t.co/0U8mZdBw7B", "Yes, gyms can open too coming Monday. With all the safety measures that we know from last time they were still open. #CoronaInfoCH", "Canton Vaud has just opened vaccinations to 50 plus. https://t.co/gjz16LXgLU\n#CoronaInfoCH #Vaud", "The Federal Council set benchmarks and passed them on to the cantons for consultation. The benchmarks that Switzerland has not achieved are not rigid limits. It is more important that the intensive care units are not overcrowded, says Berset. #CoronaInfoCH", "Pools: 1 person per 25 square meters, only 15 people in the pool area allowed. Good luck booking your slot. #CoronaInfoCH https://t.co/DDR0tBFEgW", "The Federal Council has decided to open up restaurant terraces, gyms and cultural facilities even though Switzerland does not meet four out of five benchmarks for easing. #CoronaInfoCH #Switzerland", "In addition, events with 50 people indoors and up to 100 people outdoors are again permitted, and face-to-face teaching is possible again at universities. #CoronaInfoCH", "In addition, events with 50 people indoors and up to 100 people outdoors are again permitted, and face-to-face teaching is possible again at universities. #CoronaInfoCH", "@taebonga I'm trying to find out. stay tuned", "@AndrianaMourti Trying to find out", "BREAKING\nSwitzerland opens on April 19: \n- Outdoor areas in bars and restaurants\n- Gyms \n- Cinemas \n... more details follow. \n#CoronaInfoCH #Lockdown #Schweiz #Switzerland https://t.co/9IZxCkAsmY", "@deltaecho2020 perhaps not", "@extrablatt Source??", "According to epidemiologists, Switzerland could be about to open up restaurant terraces again. The council is discussing right now in an internal meeting. I will report later about the decisions. #CoronaInfoCH #Schweiz #Terrassen \nhttps://t.co/h8zXUg5h3B", "https://t.co/h8zXUg5h3B", "The Swiss Federal Council is currently at a meeting. They debate about about possibly easing some of the current 'lockdown' measures. Decisions should be made by today. I will keep you posted. #CoronaInfoCH", "2241 new lab-confirmed cases\n25'447 tests\n8,8% positivity rate\n82 hospitalizations\n10 deaths\n\nRelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "(tested negative)", "RT @wrs: Yesssss! Come on guys, we're getting there!\n\nhttps://t.co/qg1jushMln", "@AnExpatWife @levittpt @TownFishLondon 💡\ni owe you something now", "@AnExpatWife @levittpt @TownFishLondon Sounds good. But! Not sure if I could do that, without being constantly frustrated about the fact that Switzerland doesn't invest more by itself to make these things a little easier for internationals (but then still acts like it's NYC, in certain parts of certain cities).", "@Macwilliam24 @PhilDuffy79 Just got so hungry reading this. 💕 And happy to be of help!", "@AnExpatWife @levittpt @TownFishLondon 👃 business opportunity.", "@m_m_callaghan @LSportCH @marsdendd 👏", "@levittpt First some 1:1 training please. 😲", "@jeremyelmaleh Yes, don't worry. But some perspective can enlighten the day.", "Considering the day the pandemic is over... What should this account be about, if I'm not going to close it?", "@SurpriseSparrow They say: \"If people are being outdoors anyways, there is no reason to not open terraces. Of course, with safety measures and only 4 people per table\"", "5583 new lab-confirmed cases \n72'975 tests\n7,7 % positivity rate\n146 hospitalisations \n16 deaths \n\nrelated to #Coronavirus in the last 72 (!) hours in Switzerland. #CoronaInfoCH #Switzerland #Schweiz #Covid19", "@sdier Me too, due to a with an encounter with a person that afterwards showed symptoms. I'm still waiting for my results, but the person has tested negative already. :-)", "Source: https://t.co/wKwVLJqNES", "This week, the council will discuss an easing of the current measures. Reopening everything by April 19 will not be possible – but «opening up outdoor seating areas in restaurants» are reasonable, says the president of the Swiss health directors conference. #CoronaInfoCH", "@lakkasta Yes you get them also then.", "@Ili_wim Source please", "@whitehead_north That‘s the downside of it.", "Friendly reminder: We should get casual about testing and include it in our life routines. It‘s only gonna get better. Go to the pharmacy and get your 5 free monthly tests, and use them before you meet people. It‘s a win-win. #CoronaInfoCH https://t.co/Xug0fzD25F", "Who else started their week with a Covid test? 🧠👈 Stay safe! #CoronaInfoCH", "@PKalligosfyris No", "RT @jeremyelmaleh: @CoronaEnglish https://t.co/MpovJvfoVo", "Dude is carrying a crossbow, but nevermind. #CoronaInfoCH #Altdorf https://t.co/LmYZo7q82N", "Thought I spotted my granny over there, but remembered that she's actually at home. #CoronaInfoCH https://t.co/t9RIDEgQzT", "«It's the last warning» – police says. Live now. https://t.co/tTJjF9aTUH", "Live from Altdorf: Coronavirus sceptics are demonstrating, and police is about to intervene. #CoronaInfoCH \nhttps://t.co/tTJjF9aTUH", "I'm still waiting to get my 💉 shot but until then you can treat with an ☕️ shot in case you like my work. 🧡\nhttps://t.co/kojxpNz1IB\n#CoronaInfoCH", "Source: https://t.co/H5h3vbXhqH", "The Federal Council has promised the population that everyone who wants this will be vaccinated by the end of June.\nBut now it is clear that not all cantons manage to keep the promise.\nPoliticians are annoyed because the ongoing lockdown is costing millions.\n#CoronaInfoCH", "2'207'825 vaccination doses delivered\n1'697'339 shots given \n645'055 people are fully vaccinated \n19,63  per 100 people are vaccinated \nper 9 April 2021 in Switzerland. \n#CoronaInfoCH #Switzerland", "2519 new lab-confirmed cases\n39'031 tests\nPositivity rate 6,5%\n134 hospitalisations\n12 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH #Coronavirus", "RT @greg0_rio: @CoronaEnglish Let's do this 💪 https://t.co/hrw62PhXES", "RT @evan_evvy: Get your test today! #gettested  @CoronaEnglish https://t.co/EmL9Nrr7o0", "2449 new lab-confirmed cases\n40'059 tests\n6,1% positivity rate\n156 hospitalisations \n20 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. #CoronaInfoCH", "Starting from tomorrow 7 April everyone with a Swiss health insurance card can get rapid tests for home-testing in Swiss pharmacies. Max 5 free tests / month. You (or a friend/family member) has to present your health insurance card. #CoronaInfoCH https://t.co/3GfwUVyuXP", "ETH researchers state that they can measure coronavirus strains in wastewater almost in “real time”.\nThe current rise in the number of viruses in sewage points to a possible third wave.\n#CoronaInfoCH https://t.co/O9S3R7CBzj", "@ETH  researchers state that they can measure coronavirus strains in wastewater almost in “real time”.\nThe current rise in the number of viruses in sewage points to a possible third wave.\n#CoronaInfoCH \nhttps://t.co/O9S3R7CBzj", "4932 new lab-confirmed cases\n100'076 tests\n4,9% positivity rate \n175 hospitalizations  \n20 deaths\n\nRelated to #Coronavirus over the weekend (Friday until &amp; including Monday). \n\n#CoronaInfoCH", "Happy Easter everybody! 💙 Get tested before you meet up with loved ones! #CoronaInfoCH", "Should companies vaccinate?\n\"We are currently in talks with various companies,\" says Masseray. The cantons are actually responsible for vaccinations, but if necessary it is possible for the cantons to work with companies.", "The situation should not prevent people from living, but the protective measures should be observed. He also appeals to those at risk to take care of their own protection.", "Nice weather is announced over Easter. A journalist asks what Berset advises. Berset replies that he would be careful not to tell the population to stay at home. «I would rather be outside than in here with you»", "A journalist asks whether the measures will be tightened. Berset says no. But you can see that the cases are currently increasing sharply and must be careful.", "A journalist asks whether the restaurants will be allowed to open their terraces soon, as the canton of Graubünden requested in a letter from the Council. Berset replies: 'The situation does not allow further opening at the moment.'", "A journalist asks if there is any new information about the deal with Lonza. Berset says that an initial sale was agreed very quickly and that Switzerland decided to invest in the production facilities. However, he has not yet had direct contact with the Lonza boss.", "\"The goal must also be to have a nice summer\"", "But there are also positive signs: In Switzerland, 900,000 people are now vaccinated, which corresponds to 10 percent of the population. Large deliveries of vaccinations are also expected in the coming weeks.", "The situation is currently tricky, the daily number of cases increases and the R-value is very high. Alain Berset therefore reminds everyone that it is necessary to adhere to the  measures.", "(Thread)\n(Short) Coronavirus press conference, Switzerland, 31.3.2021\n#CoronaInfoCH", "2411 new lab-confirmed cases\n44'441 tests\nPositivity rate 5,4% \n78 hospitalisations \n14 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. \n#CoronaInfoCH", "Press conference today at 15:15. I will summarize afterwards! #CoronaInfoCH \n\nhttps://t.co/PgdkQb9oZD", "Studies reveal: Pfizer Vaccine shows 100% efficiency amongst teenagers. Its still not yet approved for them though. #CoronaInfoCH\n\nhttps://t.co/yWyd0LzAvs", "Breaking: \nCanon Zurich: Everyone older than 16 years can now register for the vaccination. \n#CoronaInfoCH #Switzerland #Zürich #Impfung \nhttps://t.co/daTUCP4Yei", "Protests against Covid measures in St.Gallen today. #CoronaInfoCH  https://t.co/erUHoIdjdt", "GP in Luzern used the cancer med Opaganib to treat Covid patients – with success. It's not approved in CH but can be used in severe cases when other meds won't help. But cmon @20min, Opaganib was being used already in Dec, it's no sensation! #CoronaInfoCH\n https://t.co/zJYw3tAZ9d", "https://t.co/Dkve3ZPpg7 🤗", "According to this article, we could be facing new stricter measures in April, according to the 'three benchmark pillars' defined by the BAG.  #CoronaInfoCH https://t.co/Jl5OGTTy9x", "4, all negative", "How many times did you get tested so far? #CoronaInfoCH", "@shallhar Thanks! :-) Sounds perfect. A big handshake party!", "@lpuerto @UNGeneva Haha, thank you!", "@Vm72839363 Thanks for your support!", "@lpuerto @UNGeneva I'd love to. @UNGeneva? 🤷", "Two questions: \nWho's gonna hire me after all this mess is over? \nAnd: Would you like to buy me a coffee and support me in the meantime? 🌸 You can do so here. Thank you so much, please stay safe and get tested as often as you can! #CoronaInfoCH \nhttps://t.co/kojxpNz1IB", "Hope from the BAG: \n«If everything goes well and people are willing to get the vaccine – we won't need any measures anymore from August». \n#CoronaInfoCH #Switzerland #Schweiz https://t.co/hXET9j75wr", "Virginie Masserey from the BAG says all those willing to be vaccinated can be vaccinated by the end of July. If everything goes well, we will no longer need the measures from August.", "Can a quick vaccination campaign prevent the third wave? This is also related to the willingness to vaccinate, so Berset.", "With the progress of the vaccination campaign, easing could also be discussed. Those discussions have already started in the Federal Council.", "Until when are everyone to be vaccinated twice? At the end of June, more than half of them should have received the second dose, according to Kronig.", "The faster you vaccinate, the more lives can be saved, says Parmelin. Even every day that you can reopen earlier, you save 50 million francs.", "10.5 million vaccine doses secured\nHow many vaccine doses does Switzerland actually have? By the end of July, 10.5 million vaccine doses had been secured, said Kronig.", "\"Will other vaccines be approved so that the vaccination goal can be achieved?\" Asked a journalist. This depends on when another vaccine will be approved. According to Kronig, the vaccination goal is achieved with the existing doses.", "Berset says the number of doses you get every day will steadily increase. All risk groups should be vaccinated by the end of April. \"We vaccinate what we can,\" said Berset. The mass vaccination is slowly being ramped up, according to Nora Kronig from the BAG.", "Pfizer signed an additional contract for the delivery of 3 million doses with the federal government. There could be interruptions in production, such as the two-week interruption that we recently had. But until the end of March they are on-track.", "Pfizer Switzerland boss Sabine Bruckner is now speaking. A vaccine was developed in record time. She thanks the authorities for the good cooperation.", "It is expected that self-tests will be available to the population from mid-April. \"Extensive testing, further vaccination and then hopefully you can have a nice summer\", says Berset.", "The willingness of the population to vaccinate is also a factor in the success of the campaign, says Berset. More than 1.2 million vaccine doses have already been given, which makes him proud, explains Berset.", "According to Berset, it is the largest vaccination campaign in the history of Switzerland. This also works well. 8 million vaccine doses will arrive by the end of July (in total).", "Berset speaks again. The federal government's buying strategy is good. They had quick access to the vaccines and enough vaccine doses were secured in good time.", "The logistics involved in distributing the vaccines are extremely complex. \"We haven't found all the solutions yet,\" says Parmelin. But they continue to work on it.", "Vaccination is the solution to the pandemic, Parmelin said. Science developed several vaccines in less than a year.", "Swiss Coronavirus Press Conference – on vaccination stategy.\n25.3.2021 \n#CoronaInfoCH #Impfung #Impfstrategie #Vaccine #Switzerland", "Switzerland will receive 8 Mio vaccine doses until the end of June. Press conference about vaccination programme progress live now. Will report later! https://t.co/FhaS0YIg22\n#CoronaInfoCH", "Are you counting on the vaccination in months?\nYes, we are expecting large deliveries in May, Lévy said.", "Is the BAG overwhelmed?\nLévy: Every day new questions arise because of the pandemic. It is learning by doing, we are constantly trying to improve.", "Johnson &amp; Johnson: is there any hope that this will be ordered?\nMasserey: it cannot be ruled out that there will be further discussions. Otherwise we will not comment publicly on this.", "No central vaccination register after all?\nThis is out of question because we do not have the legal basis for it, says Lévy.", "From a scientific point of view, achieving the highest possible vaccination rate is of the utmost importance, says Ackermann. Preventing a new rise in infections is also important for people's mental health.", "Ackermann: the number of cases due to mutations is increasing exponentially. The situation in the hospitals has eased, but it is too early to feel safe. To put it bluntly, we're not over the mountain yet.", "Rapid tests are already available in pharmacies. The self-tests should be available in a few weeks, but you need a special permit. But then it should have enough of it.", "Repetitive testing in companies should be possible repeatedly and free of charge. Lévy assures that enough different tests are available and available.", "There is still no international vaccination register. It's yet  unclear how a certificate will be set up. It must be available on paper &amp; digitally &amp;  be forgery-proof. People must have the certificate with them. CH wants to issue the certificate by summer. It is voluntary.", "It is necessary to get tested before Easter if you want to party together. Make sure you make an appointment for this. The rules of social distancing and hygiene still apply.", "Hospitalizations are decreasing among the elderly, while they are stable among the younger. Almost all cantons have completed their vaccination programs in old people's and nursing homes. The infections are also falling there.", "The number of cases is increasing slightly. We have over 2000 cases today, and the new variants account for more than 80 percent. On average, the number of new hospitalizations was 50; the number of deaths remained stable.\nOver a million vaccine doses have been vaccinated so far.", "(Thread) \nCoronavirus Press Conference, Switzerland, 24.3.2021. \n#CoronaInfoCH #Switzerland #Coronavirus #BAG #Bundesrat", "RT @TheLocalSwitz: As Switzerland requires all arrivals to present a negative Covid test, many people are confused about which of the two t…", "Germany: After harsh criticism on her previously confirmed lockdown extension over easter, Merkel waives the initially planned extension. #CoronaInfoCH #German #Deutschland #Lockdown #Merkel \nhttps://t.co/s3YlQwGXMi", "1844 new lab-confirmed cases\n31'691 tests\nPositivity rate: 5,8% \n74 hospitalisations \n11 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. \n#CoronaInfoCH", "1'424'675 vaccine doses delivered\n1'252'441 vaccine doses given \n465'782 people got vaccinated twice \n14,49 / 100 people are vaccinated \n#CoronaInfoCH", "Confirmed: @Swissmedic_ approves Johnson &amp; Johnson, although no doses have been ordered yet. #CoronaInfoCH https://t.co/zJYw3tAZ9d", "Germany discusses: Shutdown shall be extended until after easter. #CoronaInfoCH #ostern #Deutschland #CoronaVirusDE https://t.co/Lw0chk8z97", "3643 new lab-confirmed cases\n84'317 tests \n4,3 % positivity rate \n98 hospitalisations \n12 deaths \n\nrelated to #Coronavirus in the last 72 (!) hours in Switzerland. \n#CoronaInfoCH", "@Dim_Hubba 😂", "@hsom113 @cloudnikki Given the fact that she/he is right with this statement, it‘s not passive aggressive.", "I notice increasing numbers of people here that would be called ‚covid sceptics‘. It‘s fine to have arguments &amp; discussions, but think twice before you start bullying – you make yourself look like a fool. Waste your energy elsewhere, go get hydrated, meditate or whatever.", "More than 6000 people are protesting in Liestal Basel right now. Motif: obvious. #CoronaInfoCH  https://t.co/Ia19ts1BHl", "The updated poster by @BAG_OFSP_UFSP . #CoronaInfoCH \nNo new easing, apart from that after coming Monday you can meet with up to 10 people in private indoor spaces (before: 5). https://t.co/5Q2smpeBC5", "End of the press conference. Thanks for following, enjoy your weekend! #CoronaInfoCH", "“The hospitality industry is suffering immensely because of the measures. Every fifth company had to close permanently. Another 20% are threatened with bankruptcy\" says @GastroSuisseCH. #CoronaInfoCH", "All the info about the FREE tests. \nhttps://t.co/gfRBPmyj1W #CoronaInfoCH", "+++ Get tested +++ It's free +++", "Alain Berset: “We believed for a long time that the new variants were only more contagious. Now there are new studies showing the opposite – the mortality would be 50 percent higher.\" \n#CoronaInfoCH #Switzerland #Schweiz #AlainBerset", "RT @dawn_hall: @azmous @CoronaEnglish All tests are free now, unless you need a certificate to travel.", "@azmous Yes.", "Are there any prospects for major events?\nAlain Berset: 'Certainly not for April or May. Most major events take place in summer. We will look at that later. The situation in summer will be better if we don't lose control now.' #CoronaInfoCH", "The vaccination numbers. #CoronaInfoCH https://t.co/MglwvtvbP4", "If you go meet your loved ones, go to the pharmacy and get tested with an antigen test. Let's make this a habit. #CoronaInfoCH", "When do phases 2 and 3 come?\nPatrick Mathys: “Phase 2 comes when all people at risk who want to be vaccinated have been vaccinated. The 3rd phase comes afterwards, when the vaccination is open to everyone and they can be vaccinated.\" #CoronaInfoCH", "Why are ten people allowed to meet, but the restaurants stay closed?\nAlain Berset: “The rule of 5 went into the deepest private sphere. That's why we wanted to loosen it up now, with the hint: Caution, caution, caution.\" #CoronaInfoCH", "Is there still the risk of overwhelmed hospitals? \nAlain Berset: 'No, we can't say that at the moment'. #CoronaInfoCH", "@abi_bouw yes", "Do 71 hospital admissions currently justify the current measures? Is that «risk based»?\nBerset: \"We live in a country that is way more open in comparison to the surrounding countries. There are currently no curfews. We are much more open than others.\" #CoronaInfoCH", "Berset: “Go to the pharmacy and get tested. That has to become a habit before you meet people.\" \n\nHe also repeats the goal that 40 percent of the mobile population should be tested frequently. \n\n#CoronaInfoCH #Switzerland", "Why should all measures be dropped when less than 80 percent vaccinated?\nPatrick Mathys: I only said that it would still be necessary to wear a mask. But the measures that we are currently discussing would no longer be necessary. \n#CoronaInfoCH", "When it's Friday and the fantasy of pre-pandemic dining out in a restaurant triggers a similar anxiety as driving a car after years of not driving. #CoronaInfoCH", "The DIY-tests for self testing at home are about to 'arrive'. The council will announce more on this in the coming days. #CoronaInfoCH", "Berset: 'We will talk again by the end of the month. And of course: If the situation improves, we can still change the current measures. But right now, it looks like it's getting worse, not better'. #CoronaInfoCH", "So, again, only one measure is being eased: From Monday on, we can meet privately with 10 people instead of 5. Everything else stays the same, until further notice. \nImportant: Test before you meet the people!! \n#CoronaInfoCH", "Berset: 'We want to prioritise vaccination and therefore don't want to open any further at the moment. We don't want to prolong the crisis unnecessarily. In October we learnt what a strong wave means. It then four to five months to pull down the high numbers.' #CoronaInfoCH", "No gyms, no pools – those remain closed until further notice. #CoronaInfoCH", "\"The epidemiological situation is worsening fast,\" Alain Berset says. And: \"We still need a little patience.\" The Federal Council decided to wait with the openings, with an exception: private and family meetings will be allowed to take place with up to 10 people. #CoronaInfoCH", "Home office remains. #CoronaInfoCH", "Updated poster. #CoronaInfoCH https://t.co/9XSOckfsHo", "'The epidemiological situation does not allow the second opening step. The number of infections rose steadily and the situation is noticeably deteriorating.' #CoronaInfoCH \nhttps://t.co/kdf1tWZfqL", "CONFIRMED: \n\n☞ From Monday, private gatherings with 10 people allowed \n☞ Restaurants and bars etc. remain closed \n☞ Reason: 'Approaching 3rd wave' \n\n#CoronaInfoCH #Schweiz #Switzerland #Bundesrat #Corona", "Will the Swiss Council reopen restaurant terraces and other facilities? \nIn 10 minutes we know more – follow here for live updates. #CoronaInfoCH #Bundesrat #Schweiz #Lockdown #Pressconference #Switzerland #Corona", "@CTRexPope Not really, no.", "+++ 15:00 press conference +++ With decisions on easing the current measures +++ I will tweet live +++ \n#CoronaInfoCH", "@jeremyelmaleh Hey Jeremy, thank you so much for your support, I really appreciate!", "@TimPar Thank you so much!", "In case you want to support me and buy me a coffee, you can do it here. https://t.co/mCeRvgthWF", "This afternoon we‘ll know it Switzerland will allow restaurant terraces to open, and waive the 5-people-rule. I‘ll tweet live. #CoronaInfoCH", "Nothing particular! Just what's happening.", "Summer plans 💔.", "@TheGynx @migros Well, not so difficult without a mask!", "Someone who refused to wear a mask in @migros got a 5 year house ban – in every Migros store in Switzerland. https://t.co/0LN74oLn2M", "@dawn_hall They didn't.", "Switzerland has not decided yet whether if they want to use the EU vaccination pass or not. The EU has offered it to Switzerland though. #CoronaInfoCH https://t.co/oRl2HIYROm", "Confirmed, right before easter: Compulsory masks in public places now also in Lugano. #CoronaInfoCH", "Austria reports 3200 daily cases – which is as many as never before this year. #CoronaInfoCH \nhttps://t.co/NTcikj6xAy", "Source: \nhttps://t.co/MLKpYRmFej", "Getting closer to a scenario where vaccinated/recovered/tested might enjoy privileges:T he National Council and Council of States are today passing a change in the law that obliges the  Council to define the requirements for official proof of a vaccination or test.\n#CoronaInfoCH", "@hsom113 Wishing you all the best and a good recovery!", "Have you? https://t.co/yrp67JoK16", "The perhaps most famous Swiss Corona measures-critic Marco Rima caught the virus – and was in bed for 3 weeks. I'm not adding any emoji here. #CoronaInfoCH \nhttps://t.co/hsUUszaMqz", "Ascona ist the first Ticino municipality to introduce mandatory masks in public spaces. #CoronaInfoCH \nhttps://t.co/SkgaqxhuAc", "Is the vaccine also tested on children under 16?\nMathys: It's a question of admission. As far as I know, the vaccines are not approved for children and adolescents anywhere in the world.", "Self tests shall be available from April and can be collected at pharmacies. The result has to be validated by the BAG. More about this  in the next few days. #CoronaInfoCH https://t.co/dFOUDkedRb", "When will self-tests be available?\nGattoni: We expect the self-tests to be available in pharmacies around the beginning of April.", "Will we have to wear the masks for years to come?\nMathys: That is still unclear. It depends on how many people are immune after an infection. When herd immunity is achieved, one can slowly withdraw the measures.", "Has the third wave started in Switzerland?\nMathys: No. One cannot say that clearly. The number of cases is increasing and it is quite possible that the path leads in this direction.", "...Saliva tests are used, which are free of charge in the so-called pooling process in companies, schools or retirement homes. This takes place in cooperation with the cantons.", "'We have expanded the test strategy: It consists of 3 pillars: 1st, the symptomatic people should be tested.\n2nd, the mass tests flow into the strategy. Up to 40 percent of the population should be tested once a week. This is primarily intended to identify asymptomatic people'...", "The situation is fragile. In Austria and Italy, the number of infections is increasing sharply. The vaccinations are a key factor in the further development of this pandemic. Significantly more vaccinations will be carried out from May onwards.", "The number of reproductions is also currently 1.13. With this number of reproductions, it can be assumed that the number of cases would double approximately every four weeks.", "Death cases are also not decreasing anymore.", "67% of all available ICU are occupied.", "Hospitalisations are not increasing anymore.", "Swiss officials fear 3rd wave. #CoronaInfoCH https://t.co/Gu3hKbslWf", "Patrick Mathys: 'The number of cases continues to rise. The development is extremely uncertain, and the question arises whether Switzerland is on the cusp of a third wave.' #CoronaInfoCH", "(Live thread) \nCoronavirus press conference, 16.3.2021. \n#CoronaInfoCH #Switzerland #Schweiz #Bundesrat", "Press conference live now. I will tweet. #CoronaInfoCH", "40 Million Italians are in #LockDown again. Italy starts 3rd Lockdown today. #CoronaInfoCH #italia #Italy \nhttps://t.co/Suar0mjWcA", "'It's done quickly, but it wouldn't be honest at the moment. We don't want to stir up expectations without having the certainty that things are going in a good direction.'", "When do the restaurants open now?\nBerset: “We plan to take further steps next week. We know that Gastro Suisse would like it to be faster. The consultation process and further developments will show how things will continue. We want to try to give perspectives quickly.'", "@levittpt I also miss the pools. A. Lot. Do you have any advice for 'similar' training like swim training?", "In the consultation, the opening of the terraces of restaurants was discussed. Companies should also receive hardship compensation if they can open.", "Why aren't restaurants open to vaccinated and healthy people?\nNot all of them have been vaccinated yet, so it is too early to have such a discussion, says Berset.", "Confirmed: Everything most likely the same, as 3 out of 4 goals for an easing of the measures are not being reached.\nHowever, a final decision will be made on March 19.  \n#CoronaInfoCH #Switzerland #Schweiz #Coronavirus #Berset #Bundesrat", "Are there any plans to lift the obligation to work from home? This has not yet been discussed, said Berset.", "Federal Council President Guy Parmelin now speaks about the apprenticeship and Matura final exams. These will take place regularly. Those who complete apprenticeship training will also receive a qualification that is valid in the labor market.", "All tests will be paid for by the federal government from March 15, including those of asymptomatic patients, Berset said.", "You should be outside as much as possible and pursue your hobbies there because the risk of infection is lower there than in closed rooms.", "RT @CoronaEnglish: A final decision about a possible easing of the current measure will be made on March 19th. #CoronaInfoCH", "A final decision about a possible easing of the current measure will be made on March 19th. #CoronaInfoCH", "Berset says: 'We have to be prepared for a 3rd wave'. #CoronaInfoCH https://t.co/y9uQKi66aZ", "\"We have to prepare for a third wave,\" said Berset. This could be strong or not, depending on how much contacts are restrictions and safety measures are being observed and applied.", "The Federal Council cannot say why these values have been exceeded. Several models have been developed with the ETH and the Science Taskforce.", "The  epidemiological situation is not what we would like it to be, said Berset. 3 out of 4 target values for possible reopenings are not reached.", "(Live thread)\nCoronavirus Press Conference, 12.03.2021, Switzerland \n#CoronaInfoCH #Switzerland #Schweiz #Berset", "Today 14:30 +++ press conference by the Swiss Federal Council +++ about restaurants/bars potentially reopening on 22 March  +++ i will tweet live! #CoronaInfoCH", "1409 new lab-confirmed cases\n34'811 tests\n4% positivity rate\n52 hospitalisations \n28 deaths \n\nrelated to #Coronavirus in the last 24 hours in #Switzerland. #CoronaInfoCH", "1491 new lab-confirmed cases\n32'557 tests\n4,6% positivity rate\n41 people hospitalised \n14 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. \n#CoronaInfoCH", "@anindita It's hard to find info on this. However, the official source would be: https://t.co/xcENhWP2Fj", "Have you ever thought about how overwhelming it will be once everything is open again? #CoronaInfoCH", "Good news: Switzerland has purchased another 3 Mio Pfizer vaccine doses. 1 Mio will be available already in April, May and June. #CoronaInfoCH https://t.co/DEOj7KOIBX", "Thanks for all your DMs with feedback, but also specific questions. And I'm sorry I can't respond to them all! \n\nHowever, if you have a specific question, ask it here and I (and the community?) will try to help. :-) \n\nHave a beautiful day! \n#CoronaInfoCH", "Read everything about today's Coronavirus press conference in Switzerland here. \nAnd if you wish to send me a small donation for my work, you can do it here. Thanks!  https://t.co/kojxpNz1IB #CoronaInfoCH https://t.co/7DpOPYG8se", "End of the press conference. Thanks for following!", "Are there any plans to vaccinate more professionals?\nWe want pharmacists to be able to vaccinate too. Also doctors are integrated in the vaccination schedule.", "Are these still years or months? Is there a glimmer of hope?\nWhat it will look like in the longer future must be discussed internationally.", "BAG: 'It is possible that we will have seasonal waves of infection in the future.'", "On the subject of travel: 'It's a global pandemic. We are probably one of the fastest countries in the world when it comes to vaccinations, it depends on how it looks in the other countries.' Experts believe that this virus will not go away completely.", "How many people in which category have already been fully vaccinated?\nThe cantons provide the figures. 30 percent of those over 80 are fully vaccinated. 620,000 received a dose. It was decided not to give preference to specific occupational groups.", "It will not be the case that the whole of Switzerland will be mass-tested from March 15th. It will take all of March to definitely get going.", "Does the federal government have a contract with Johnson &amp; Johnson?\nNora Kronig does not want to comment on this. Kronig also does not want to say whether negotiations are in progress.", "At the moment, the number of people vaccinated is still too small to have a greater impact on the number of infections. \"With the mass tests we can manage the pandemic better, with the vaccination we can end it,\" said Ackermann.", "Significantly more infections of the British virus mutation have been registered. Therefore, increasing efforts are necessary to prevent this from spreading further. The restriction of mobility and contacts is very helpful, as is mass tests.", "By the end of June, everyone who wants to be vaccinated should also be vaccinated, according to Nora Kronig (BAG). They want to stick to the diversified vaccination strategy and are therefore also very busy with the procurement of the vaccination doses.", "Most people in old people's and nursing homes are now vaccinated. People who have been vaccinated follow protection measures and continue to wear a mask. \"We don't know how vaccination protects against infection.\" Until then, the hygiene measures apply to vaccinated people.", "Over 70 percent of the reported corona cases are new variants, says Masserey. 13,387 virus variants have been registered so far. Over 4000 cases belong to the British variant, 737 from South Africa and 6 from Brazil.", "\"The current numbers are stagnating or rising slightly,\" said Virginie Masserey (BAG). With the exception of four cantons, the number of reproductions (R-value) is above 1.", "(Thread) \nCoronavirus Press Conference, 9.3.2021\n#CoronaInfoCH #Switzerland #Coronavirus #Covid19", "2744 new lab-confirmed cases \n64'105 tests\n4,3% positivity rate \n100 hospitalisations  \n16 deaths \n\nrelated to #Coronavirus in the last 72 (!) hours in Switzerland. \n\n#CoronaInfoCH", "The new quarantine country list for Switzerland, updated 8.3.2021. Everyone coming from these countries to Switzerland has to undergo a 10 day quarantine. #CoronaInfoCH #Risikoländer #Riskcountries https://t.co/ZBnM74ihFX", "This of course includes citizens residing in Switzerland. :-)", "(Self tests are planned for residents, not citizens. Sorry for the mistake!)", "@dawn_hall Thanks for the heads up! Got lost in translation.", "@LewisJenkinss We don't know yet", "@SoppoPekin237 Also residents", "@dawn_hall Sorry, residents", "The Federal Council therefore proposes that the federal government also covers the costs for all rapid tests in pharmacies and test centers. This rule also applies to cross-border commuters.", "Until now, since there is not enough information about the use of self-tests with people without symptoms, the Federal Office of Public Health has not yet approved such tests.", "Self-tests for everyone\nThe Federal Council also wants to facilitate access to self-tests. All people should be able to test themselves regularly, even if they have no symptoms. Each person should be able to receive five self-tests per month.", "The news today: \n+ Further easings not expected before 22 March\n+ From 15 March, the federal government wants to provide  free corona tests for all\n+ As soon as reliable tests are available, citizens should receive 5 free tests per month\n#CoronaInfoCH \nhttps://t.co/i4baEK1TTr", "The decision over the 1 Bio CHF for a stricter testing regime including provided self tests (5/month/person) will be made on 13 March. #CoronaInfoCH https://t.co/znctYQQ4CM", "Swiss Council wants to provide every citizen with 5 self tests / months. Cost: 1 Billion CHF. Press conference with @alain_berset now - I will summarize later. #CoronaInfoCH", "@T3_RM @buymeacoffee I don't know, but try 100 and see what I'll do. Apply your risk management skills.", "In silence; with solidarity and warmest thoughts for all the people that fell victim to Coronavirus, as well as their loved ones. ❤️ \n#CoronaInfoCH", "Switzerland expects many university students to quit their studies – because their student jobs don‘t exist anymore and they get into financial trouble. Government discusses an emergency aid fund. #CoronaInfoCH  https://t.co/0nSzRMBs0H", "Today from 11:59 whole Switzerland will hold a minute of silence dedicated to the 2,5 Million Covid19 victims and their loved ones all around the globe. The bells of all 3 national churches will ring. Spread the world please. #CoronaInfoCH", "Vaccination passport. Yay or nay? #CoronaInfoCH #VaccinationPassport", "@lpuerto @WHO That would be an option, but I am not sure if a safe one, if we simply have no parameters for that yet / don't know much about immunity. No?", "How many ☕️ did you already have this morning? \n...If you feel like buying me one as a reward for my voluntary work, you can do it here. Every donation is highly appreciated! 🧡\n#CoronaInfoCH @buymeacoffee \nhttps://t.co/kojxpNz1IB", "Germany extends the #Lockdown until March 28. #CoronaInfoCH https://t.co/R8ZHJTjYPr", "EU wants to launch an vaccine passport. But the @WHO doesn't approve – as long as it's not clear how long one stays immune after being vaccinated, it's not considered as a good idea, says the WHO. #CoronaInfoCH https://t.co/9ZP18aCbm8", "According to @GastroSuisseCH, 20% of all Swiss gastronomy establishments had to call it quits. 20% more are supposed to face the same tragic situation. #CoronaInfoCH https://t.co/MUDk4Pjf3W", "The demand for mental health care has exploded since the second wave. Children and young people in particular suffer from anxiety about the future, depression and loneliness. #CoronaInfoCH https://t.co/1wyTSiocUw", "In case you live in canton Luzern and are registered for the vaccination, you'll get SMS updates about free appointments / spots.", "Registering on your canton's website does not equal an appointment for the vaccination – but it's the first step in that direction.", "(Thread) \nAs many people don't know: In some cantons you can already register for the vaccine! If you're interested in getting it, you should go ahead, because you'll be placed higher on the waiting list. Article:  https://t.co/87s3GLrcgf\n#CoronaInfoCH", "Found this on my phone - 23.1.2020. Strange to sometimes take s step back and think about what all happened since then! #CoronaInfoCH https://t.co/sLgiQU4Cqy", "Italy extends Covid measures and inland travel ban until after easter. #CoronaInfoCH #Covid19 #Italia  https://t.co/y8l5YrC5Vm", "A study reveals: 25% of covid patients in Switzerland still suffer after (at least) 6 months after the infection. #CoronaInfoCH  https://t.co/lwj6H6YOWF", "@CTRexPope Here i'm quoting them. They're rounding up/down.", "Read everything about today's press conference here. And stay safe! #CoronaInfoCH https://t.co/eyZ1Kbi34u", "That's it! Thanks for following!", "Will there be a national strategy for mass testing?\n\"We still discuss with the cantons what we are going to decide about this\" says Lévy.", "Are the experts really positive about the situation?\n\"The positive thing is that we are also at a low level,\" says Masserey. \"But is true that the mutated variants can lead to a change.\"", "\"We assume that until this summer we will have vaccinated all people who want to be vaccinated,\" says Massrey.", "“Mass tests are already taking place in various cantons,” says Hauri, “but it only helps if they are carried out again and again. In the canton of Zug, for example, schoolchildren, teachers and administrative employees are tested twice a week. The effort is great.\"", "\"We are all happy about the changed measures,\" says Rudolf Hauri, Cantonal Doctor Zug, President of the Association of Cantonal Doctors. \"Spring is in the air.\" It is therefore important to keep the numbers low.", "How long does immunity last? \"After 6 months, over 90 percent of those infected still have detectable antibodies,\" says Puhan.", "The number of vaccinations continues to rise, 1,164,075 doses have been delivered so far, and 260,000 people in Switzerland are fully vaccinated. \"We assume that the entire hospital staff has now been vaccinated,\" said Masserey.", "About the Covid app: It is used by almost 2 million people every day. \"The app can also help to track infection chains, particularly with the opening steps that are still to come.\"", "Self-tests could possibly be approved in Switzerland in the future. However, the quality must be guaranteed and, in the event of a positive result, a confirmation test must be carried out.", "The first to speak is Anne Lévy (BAG). She  brings up the openings since Monday. \"With this, the Federal Council gives us a perspective after a long year with Covid,\" says Lévy. But the situation is still fragile. A look abroad shows that the situation could worsen again.", "Meanwhile, Switzerland is approaching the 1 million mark in the number of vaccine doses it supplied. 975,675 arrived, 751,009 administered. 221,259 people are currently fully vaccinated.", "The BAG assumes that the slower decline also has to do with the new corona mutations, which, according to estimates, now make up more than 50 percent of all new infections in Switzerland.", "The decline in the number of infections in Switzerland is currently stagnating. On Monday, the BAG reported 2560 new corona cases over the weekend, which is more than in the previous week (2449). Before that, the number of infections had fallen continuously.", "(Thread) \nCoronavirus press conference with Swiss Federal Council, 2.3.2021. \n#CoronaInfoCH #Switzerland #Schweiz #Covid19", "RT @DrEricDing: 4) How common is #LongCovid overall? UK estimates 1 in 5 at 5 weeks and 1 in 10 have symptoms have even 12 weeks after init…", "Virologist says: Once we'll have a heard immunity, especially babies and children will get infected. Because there is no vaccine for under 16 year olds yet. #CoronaInfoCH \n\nhttps://t.co/ylWjhjwrg5", "Switzerland is about to train tracking dogs to smell Covid-19 – the aim is that they can smell and detect infected people. 🐶 #CoronaInfoCH \nhttps://t.co/szgpMBqPVc", "Queues in front of reopened stores. #CoronaInfoCH https://t.co/0or5yAN7wY", "Cantons change their minds after meeting ⁦@alain_berset⁩ – and close their ski resort catering terraces again. #CoronaInfoCH  https://t.co/SauiwNPv35", "@IgnacioHuesa 💕", "Source: https://t.co/jXqspriawx", "This special regulation follows a petition that was signed by  50k people. All Swiss restaurants can voluntarily decide to become such a 'workers restaurant'. #CoronaInfoCH", "Contact data need to be collected, social distancing must be possible. People need to wear a mask in the restaurants – everywhere but not at the table.", "(Thread) \nThe BAG allows Swiss restaurants to reopen. BUT: Only for workers (construction, farmers, mechanics working outside their workshop) during lunchtime (11-14). The employers need to announce their visit. #CoronaInfoCH", "Some people asked me if donating via #Bitcoin is possible. Yes it is! Here is my wallet: \n \nbc1qx9cder9q8qs2q8vj5puwuu7j74d9ap8wjf0fnv\n\nThanks 🙏 and stay safe!\n#CoronaInfoCH", "RT @Csillada: @CoronaEnglish https://t.co/cbHgdFAVlv", "It's been a year now. And we all can't wait until this account can be deactivated. 💕 #CoronaInfoCH", "New #Coronavirus detected: B.1.427/B.1.429 is a variant from California and should be more deadly and more contagious than other variants. No cases have been reported yet in Switzerland. #CoronaInfoCH #B1427 #b1429  https://t.co/rg4uIElZ19", "Despite the ban: Six Swiss cantons want to open their ski resort restaurant terraces before the Council allows it. #CoronaInfoCH https://t.co/pI1BsuswBx", "Always thought that the governments have totally missed that aspect of the lockdown – installing more public toilets. #CoronaInfoCH https://t.co/gD0iAPmSrO", "@luisathefox @guardian I do! You can DM me. :-)", "@dawn_hall I would say that 'garden' equals 'home', house. So, no.", "@tomasz_susul you're welcome!", "Everything you need to know about the new (and eased) measures from March 1st. #Switzerland #CoronaInfoCH #Schweiz #Coronavirus #COVID #Bundesrat https://t.co/oBWd1vNHsJ", "Can teenagers meet with friends in the youth club again?\nYouth clubs can reopen. A guide must be present and masks are mandatory for all children and young people older than twelve years.", "Can the music camp take place?\nYes, such camps are allowed for young people born in 2001 or later. A protection concept is required for this.", "Can bands, orchestras and choirs rehearse again?\nRehearsals and concerts are allowed for young people born in 2001 or later. Performances with an audience remain prohibited.", "Do I still have to work from home?\nYes, the home office obligation remains.", "Are the shops allowed to reopen?\nYes, all shops are allowed to reopen. The maximum number of people and mask requirement apply everywhere.", "From March 1st, this scope will also apply to people born in or before 2001.", "What about children &amp; teenagers?\nChildren &amp; young people have already had a few privileges before their 16th bday, e.g. in sports. You can play football or hockey indoors and outdoors, practice on a climbing wall or rehearse a jazz dance, without a fixed limit on the number of p.", "Do I have to wear a mask on the tennis court?\nNo mask needs to be worn when doing sports outside if the distance is maintained. Body contact is not allowed, neither are competitions. This applies to everyone over the age of 20.", "Can the football club resume training?\nYes, but: Team training is only permitted in groups of up to 15 p and without physical contact. Training matches and exercises in which you get too close are therefore prohibited. Tactical and technical training with distance is allowed.", "Are garden terraces allowed to reopen?\nNo. Terraces, whether in ski areas or garden terraces of restaurants, will be closed at least until March 22nd.", "Can I sing again?\nSinging, rehearsing and making music is possible for all children and young people born in 2001 or later, but without performing in front of an audience. For adults, singing together in the non-professional area outside of the family circle is prohibited.", "How many friends can I invite home?\nAs before, only 5 people are allowed at private events inside, children are included.", "Can I have a club party with 15 people in the park?\nNo. Since this is not a spontaneous meeting, like with family and friends, this remains prohibited. This also applies to other leisure organizations such as events in neighborhood associations and other club activities.", "(Thread) \nSummary of today's press conference – this will change after 1st of March. Read everything about the easing of Covid-19 measures in Switzerland in this thread. #CoronaInfoCH  #Schweiz #coronavirus", "I will summarize the rest of todays news this evening. Have a nice day!", "No, gym's won't open on March 1st. #CoronaInfoCH", "From March 1st – the first steps in easing of the measures. #CoronaInfoCH https://t.co/8hSzGocjam", "From 1.4. (if epidemiological situation is favorable):\n- Cultural and sporting events with a small audience (tbc)\n- Indoor sports\n- Opening of restaurant terraces\n#CoronaInfoCH", "CONFIRMED \n\nThe Councils plan for 🇨🇭\n\nFrom 1.3.:\n\n- Private events (up to 15 people) outdoors.\n- Sports and cultural events for under 18s.\nOpening of: shops, museums, libraries, zoo outdoor areas, various sports facilities.\n\n#CoronaInfoCH", "Boris Johnson wants to waive all measures against Coronavirus until the end of June. #CoronaInfoCH https://t.co/MdguzLF8oG", "New study reveals: Biontech vaccination reduces the risk of infection by 85%. #CoronaInfoCH  https://t.co/BO3UIly83z", "Today 15:00 the Council will announce news about upcoming (easing of the) measures. I will summarise later today. #CoronaInfoCH \nhttps://t.co/Drx8A7uSrs", "Aargau urges Berset to have a plan in case the numbers will rise again. #CoronaInfoCH https://t.co/ZSXR1gZ3c7", "2449 new lab-confirmed cases\n58'545 tests\n4,2% positivity rate\n84 hospitalisations \n26 deaths \n\nrelated to #Coronavirus in the last 72 hours in #Switzerland. \n#CoronaInfoCH", "Happy Monday! Here we go, the new quarantine list: https://t.co/FrDNGOSReW #CoronaInfoCH", "Did you finally read that stack of unread books in all this time? #CoronaInfoCH", "Favourite show / series during the pandemic? #CoronaInfoCH", "Favourite self care app during the pandemic? #CoronaInfoCH", "Favourite new wine discovery you've made during the pandemic? #CoronaInfoCH", "Favourite pandemic board game? #CoronaInfoCH", "Wonder why OCD Switzerland has still been rather lax about it. #CoronaInfoCH https://t.co/TnFeVq7rfs", "Not even mentioning that it contributes to the growing mistrust in the government and its instruments.", "Considering him, as the Council, enjoying responsibilities as a role model that has the potential to have a major (negative) impact on public health with such a statement, i find this very problematic.", "Federal Council Ueli Maurer says in an interview that he got the 1st vaccine shot - but refused 2nd. „Because I think I am so tough“. And I think he is so dumb. Given the fact that the BAG says the vaccine is ineffective with only 1 shot. #CoronaInfoCH \n\nhttps://t.co/ubo6MhByBf", "@m_m_callaghan @lucaberta Bad hash or something", "1021 new lab-confirmed cases\n31'027 tests\nPositivity rate 3,3%\n54 hospitalisations\n10 deaths \n\nrelated to #Coronavirus in the past 24 hours in Switzerland. \n\n#CoronaInfoCH #Corona", "Breaking: \nThe Nationalrats' health commission puts pressure on the Federal Council: Restaurants and gyms should reopen on the 22nd of March. #CoronaInfoCH https://t.co/mcZagK2Il9", "Canton Graubünden wants to open restaurants already on the first of March. Federal Council isn‘t happy about this. It‘s not decided yet whether they really will or not. #CoronaInfoCH https://t.co/zJYw3tAZ9d", "@nycswiss thank you so much!", "It's still not going well with the vaccination: For February, only 700,000 instead of the promised million vaccine doses are expected. \"Nevertheless, the federal government is confident that the vaccination targets for June will be achieved.\"\nhttps://t.co/3NC7oiXXvJ\n#CoronaInfoCH", "1219 new lab-confirmed cases \n29'234 tests \n4,2% positivity rate\n165 hospitalisations\n62 deaths \n\nrelated to Coronavirus in the last 24 hours in Switzerland. \n\n#CoronaInfoCH", "@Elinigo1 Thanks so much! \nHm, what could it be after Covid crisis?", "@staywoketarot @CARVINGVINOTH no that's wrong", "@AcadNon I try!", "@dawn_hall It's still active – thank you very much!", "@JasmineTaro1 https://t.co/CfPx7fke3T", "@Chaletmaridadi Thank you so much for your support!", "Merchandise, why not? \nThis eco cotton shopper is a great way of reminding your fellow shoppers of the famous 1,5m. It's strong and lasts longer than the pandemic, promise. \nSome of the earnings will help me keeping this account up. 🧡 #CoronaInfoCH \nhttps://t.co/JrGYB1rDDZ https://t.co/cRlJLxQHzI", "@daniyalmufti85 remain closed", "@stormkrow working from home is still mandatory", "@LaSmartym They say 'everything as planned, smooth'", "If you like my service and would like to support me with a drink or two, you can do it here! It'd be highly appreciated. 🧡 Thanks and stay safe! #CoronaInfoCH \nhttps://t.co/kojxpNz1IB", "Overview of how Switzerland is opening up .#CoronaInfoCH https://t.co/PkRDiyIBBV", "Read everything here about how Switzerland is easing the Covid measures from the 1st of March. \n#CoronaInfoCH #Bundesrat #Berset #COVID19 #coronavirus https://t.co/aNZEUWS4pk", "End of press conference. Thanks for reading!", "«We see very, very many police officers here in the building. Are there really any threats against the Federal Council?»\nFederal spokesman Simonazzi: «We do not give any detailed information about the security forces due to the security situation.»", "What does a narrow framework for events mean?\n\nBerset: «Mask, compulsory seating and capacity restrictions. It will go in this direction.»", "Working from home regulation will remain. Sweatpants!  #CoronaInfoCH https://t.co/Xdcg3ThO1B", "Mandatory home office stays in place \nGuy Parmelin explains that working from home is a viable option for companies. The request to work from home will be retained.", "The Federal Council is trying to take into account the difficult situation of culture, says Ueli Maurer. “The self-employed cultural workers are entitled to get compensation for their earnings, and with the new measures they could also be given additional support\"", "No – gyms remain closed as it seems. #CoronaInfoCH", "Why 'traffic light system'? \nBerset: “We have always had guidelines. But automatisms simply don't work in a crisis. We need several criteria to do justice to the complexity of the situation. Still, we don't want to be in a blind flight, so these criteria are needed. \"", "source https://t.co/x2qDLoK3Po", "Switzerland opens up. From 1.3.: \n➔Private events outdoors with 15 p \n➔Reopening of shops, museums, libraries \n➔Up to 18y olds can do sports and cultural events \n\nFurther openings from 1.4., if situation is stable: \n➔Restaurant terraces \n➔Limited Public events \n#CoronaInfoCH", "Does the Federal Council have a strategy for dealing with those affected by long covid?\nPatrick Mathys says: \"Long-Covid could also be a problem in the long term and will keep us busy.\"", "Can't restaurants  be allowed to open earlier, for example outdoors?\nBerset: “It is the first time that we are trying to relax, knowing that the situation with the mutations is different from last year. The monthly plan helps us plan that better. We take a risk.\"", "Berset is sympathetic to the younger generation: \"The young pay a high price.\" That is why sporting and cultural activities should be increasingly possible again for under 18-year-olds.", "The Federal Council also requests that the federal government generally pays the contributions for short-time work. The cancellation for cultural workers is also to be expanded.", "The Federal Council proposes: The total amount for hardship cases should be 10 billion CHF. Four of the 10 Bio are intended for SMEs and smaller companies. The federal government alone will pay another four billion. Out of these, 3 billions are earmarked for large companies.", "Councilor Ueli Maurer: We have a deficit in the ordinary accounts of 1.2 billion. \"The extraordinary expenses count up to 14.6 billion.\" For 2020 there is a deficit of around 15.8 billion.", "The mutations are a risk, says Federal Councilor Berset. «For almost a year we have had to weigh things up, even if it is almost impossible at times. Our goal is to prevent suffering.» The Federal Council is aware that this crisis demands a lot from everyone.", "Berset says that further easing will be discussed on March 24th. The positivity rate should be below five percent, the occupancy rate of the intensive care units with Covid patients below 25 percent and the average number of reproductions over the last 7 days below 1.", "The Federal Council is promising monthly easing, depending on the situation.", "Opening where it is possible\nThe situation is still very fragile. The population must therefore still adhere to the applicable protection and hygiene rules, so Berset. Nevertheless, the Federal Council has become an easy one", "The situation is not that bad, says Alain Berset. The situation on the hospital front has also improved. The vaccination campaign is also in full swing. \"That is why the Federal Council has decided to relax the current measures to some degree.\"", "Parmelin quotes John Fitzgerald, \"Don't think what the state can do for you, think what you can do for the state.\" He encourages the population to get vaccinated.", "“I know that many people in Switzerland will be disappointed by today's decisions,” says Parmelin of the current easing. \"But also consider that they are a younger generation – they are tough enough to handle these difficult conditions.\"", "\"A complete opening would be unrealistic,\" explains Federal Councilor Parmelin. The lifting of the Covid measures will take place gradually. The Federal Council made various proposals for dealing with the hardship cases. Federal Councilor Ueli Mauerer will present these later.", "(Thread) \nPress conference 17.02.2021 \n#CoronaInfoCH #Coronavirus #Bundesrat #Covid19", "On the 1st of March: Switzerland wants to reopen stores and allow outdoor events with up to 15 people again. Stay tuned, long thread from the press conference follows in a couple of minutes. #CoronaInfoCH", "1253 new lab-confirmed cases\n33'449 tests\n3,7% positivity rate\n66 hospitalisations \n22 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. \n#CoronaInfoCH", "Press conference at 15:00 today – with Swiss Federal Council. They will talk about how they proceed with the current Coronavirus measures. I will summarise afterwards (and let you know immediately in case of significant changes). #CoronaInfoCH", "@lpuerto Clear sign that you guys don't drink enough!", "@JM_Science https://t.co/0DnjjHKfuJ", "When the fantasy of kissing and hugging friends starts to feel like confession booth material. #CoronaInfoCH", "Just wondering. Are you actually living in Switzerland?", "Everything about today's press conference here. \nApparently the Bundesrat / Federal Council will decide tomorrow what to do with the current 'lockdown' measures. I will keep you up to date! #CoronaInfoCH #COVID19 https://t.co/dez77BEJeC", "«The situation is still extremely fragile. The virus variants are becoming more dominant. The question will be whether the current level of new infections can be maintained with the current measures. If that is the case, easing is possible.\"", "How does the BAG feel about easing the measures? «We discuss many different solutions and scenarios. However, the decision lies with the Federal Council. He'll make the decision tomorrow” says the BAG.", "\"The British variant is almost daily normal - unfortunately,\" says Linda Nartey. There are still daily infections with the original viruses.", "“We assume that by the end of April we will have vaccinated all vulnerable people with at least a first dose. From May we want to start vaccinating all other people.\"", "“We've had a little less vaccine recently than expected. The number of vaccination doses will increase in the near future and the monthly vaccination doses are getting more and more », said Virginie Masserey.", "“The vaccinations are making good progress in all cantons. 6.3 Vaccination doses have already been given per 100 inhabitants. We are above the average compared to other European countries, but behind Great Britain and Denmark,” said Masserey.", "Until Sunday, 127,533 vaccine doses were administered in Switzerland within one week. An average of 18,219 vaccinations were carried out per day. Compared to the week before, the  rate increased by 29 percent. A total of 541,231 vaccinations had been carried out until Sunday.", "Clear announcements and perspectives for the population about an easing of the 'lockdown' aren't possible. The situation has to become more clear, there are currently too many uncertainties, said the BAG.", "However, contrary to expectations, the number of mutations has not doubled within a week. According to the Head of BAG, 68% of intensive care beds are occupied, 22 percent of them by Covid patients. The number of hospital admissions is also decreasing.", "\"Switzerland is not doing so badly,\" is the conclusion of Patrick Mathys (BAG). There is also a \"but\": the number of reproductions stagnates at a little below 1, and the number of coronavirus mutations continues to increase.", "(Thread) \nSummary of today's press conference. \n16.02.2021\n#CoronaInfoCH #Switzerland #Schweiz #Bundesrat", "@66rachael66 Meeting in the morning, conference perhaps around 2", "Hairdressers: People currently visit more often – some say there is 15%+ frequency. Some come only to for a wash and a scalp massage - and obviously to talk and make up for the lack of social contacts. Respect to all the frontline workers! #CoronaInfoCH https://t.co/7VUzHR1biO", "Today the Swiss Federal Council will hold a meeting on how to proceed with the measures against the Coronavirus pandemic. I will report immediately as soon as we know more. Have a lovely day! #CoronaInfoCH", "@Icarus_Flies I always add this (!) on Mondays so people realise it's 72, not the usual 24, so to make sure nobody gets mislead :)", "@Icarus_Flies 72 because on monday we get the numbers from the last 72, not 24 as usual.", "Another one. Covid times are manual times! 💕💘💕 https://t.co/Xcb9brPh0d", "@allen_sarahe @migros @coop_ch luv it", "@lola_int @migros @coop_ch what did you buy?", "2480 new lab-confirmed cases\n65'737 tests\n3,8% positivity rate\n99 hospitalisations \n40 deaths \n\ndue to #Coronavirus in the last 72(!) hours in Switzerland. #CoronaInfoCH", "@melissabean82 The gloves on top of the photo are for kids, too!", "Migros has spoken. No winter hats but swim trunks, ask the Swiss Federal Council. 🧡🧡🧡 #CoronaInfoCH https://t.co/h76p0j8Y2f", "@migros @coop_ch Dear @migros thanks for your response. \nSo I then assume that your choices of selling swim trunks but no winter hats are purely made to make us feel positive &amp; dreaming of a Covid free summer, but I still consider asking the Council.\nAnd really, I always love you anyways. 💘 https://t.co/WYCpwCTcW7", "Question from the followers and me to @migros and @coop_ch! \n\nHow do your store managers decide which items are (non) essential? Sometimes it's  a little confusing. Irons are not available, but raclette grills are, etc. Happy if you could answer! #CoronaInfoCH", "@AbroadSteve @migros Not sure what selling sewing supply has to do with opening up Switzerland?", "So then you'd finally have some time to fix your old beloved sweater – but no.\n\n@migros aren't sewing supplies essential? Even in hotels you get a small sewing kit with your toiletry products. \n\n#CoronaInfoCH https://t.co/VqUROK9MQ3", "Carnival in Einsiedeln Schwyz. Although it was forbidden. #CoronaInfoCH https://t.co/LSGFbOVfs4", "Mandatory masks for students from 5. grade in canton Aargau. #CoronaInfoCH #Maskenpflicht https://t.co/zJYw3tAZ9d", "6003 cases with a new strain detected within a week – that's 45% more than a week ago. 2381 cases are with the strain initially detected in Great Britain, 96 cases due to the strain from South Africa, 3 from Brazil, 8 others and 3515 unclear. #CoronaInfoCH\nhttps://t.co/zJYw3tAZ9d", "@lucaberta Thanks for the heads up - it’s really relevant, I did not see it indeed", "@dim_spil It was nothing, thanks!", "@tomasz_susul 12.2.2020, a Negroni after work https://t.co/CnNjRyday5", "Me 2060 reminiscing about this all. https://t.co/VmARiedD5e", "Well I got used to it all (which is maybe a bit scary). It‘s always weird when your phone suggests you a photo album „On this day a year ago“. But maybe even weirder when it does this in one month from this day", "It has been a bit quiet in terms of Covid news. How are you all coping? #CoronaInfoCH", "Alain Berset hints in an interview that we can expect the measures to be slightly eased soon. However, the end of the ‚Lockdown‘ is not in sight. Coming wednesday we will know more about it, after the council‘s meeting. #CoronaInfoCH https://t.co/bSL3tQk2wm", "Swiss vaccination schedule updated: By the end of April, the risk group can be successfully vaccinated. In two months, younger people will be vaccinated. #CoronaInfoCH\n https://t.co/jcPTWKa6Fo", "Coming Wednesday the Federal Council will communicate how we will proceed in terms of the #Lockdown in March. Conservative parties and businesses want an end of the Lockdown. #CoronaInfoCH https://t.co/WFoNHAbyDq", "Russian embassy contacted Switzerland twice (August and December) about their vaccine #SputnikV. But BAG didn't answer. Ex vice director of the BAG says it'd be their duty to follow up on all offers, esp. in case of shortage of vaccine. #CoronaInfoCH \nhttps://t.co/Rx8TEKQeHK", "1356 new lab-confirmed cases\n34'964 tests\n3,9% positivity rate\n66 hospitalisations\n22 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. \n\n#CoronaInfoCH \n\nhttps://t.co/vDBjnR0tPL", "The lockdown saves lives. But it costs. The state debt grows to billions. What does that mean for the coming years? Which economic model do we need in the future? Interesting talk with Swiss top economist Monika Bütler. In German, I’m sorry. #CoronaInfoCH  https://t.co/zylfN4ufwX", "If you find this account to be helpful and want to spend a franc or two as a support for my voluntary work, you can buy me 'a coffee' here ⬇️. Thanks – and thanks to all previous supporters! 🤍 #CoronaInfoCH \nhttps://t.co/kojxpNz1IB", "Mandatory masks in primary schools in these 5 cantons: \nBasel-Landschaft, Bern, Graubünden, Solothurn and Zürich. Most other cantons have mandatory masks from Sekundarstufe 1 on. Image: @srfnews #CoronaInfoCH \nhttps://t.co/4zlk1RFbGg https://t.co/EXX2qlozTN", "Social climate amongst younger people: Experts and police recognise more violence amongst teenagers and young adults in Switzerland, due to the Coronavirus measures. #CoronaInfoCH https://t.co/qnZofP0Zfl", "About taxation complications Covid remote work hoards (working remote in another US state than where the employer is has an impact on where one has to pay taxes). CH‘s system‘s obviously different – but does Covid make you rethink your resident location?\n\n https://t.co/OoYvOjboTw", "@dawn_hall You're welcome :)", "@white_tiger1699 I think so too. A negative thing that is so positive!", "Geneva: 60% of all positive cases are with the new strain initially discovered in Great Britain. #CoronaInfoCH https://t.co/Lo0ppAmGPJ", "Every relevant thing about today's press conference in this thread. Good night! #CoronaInfoCH #Switzerland #Coronavirus #COVID19 https://t.co/LVwq3ez3Ql", "@jc4P45 Great, happy for you!", "End of the press conference. Thanks for following!", "What about the near future? \n– Masserey: 'At the moment, the measures are being well  implemented. But we also know that this cannot go on forever.'", "On the Brazilian variant\nMasserey: 'It's definitely a more contagious variant. Even those who have already been infected can be infected again.'", "'The new variant will eventually replace the current one. Then we need good and effective measures again. If the new variant dominates, we have to become even better at breaking chains of infection'", "The volume of road traffic has decreased noticeably. The road borders are still open and we do not carry out any permanent controls. You can continue to enter Switzerland. We carry out controls in all possible forms and types. In the bus, train, on the street etc.", "Entry regime\n'The travelers understand the measures. We are allowed to penalise violations. At the moment we are (at the border) always trying to give travellers the opportunity to adhere to the rules. In the country itself, however, we are more actively giving out fines.'", "Mobility\nAckermann: 'Just by only reducing mobility, we won't be able to significantly reduce the number of cases. To do this, we must all continue to work together. The movements of people in Switzerland became less, but they are still higher than in spring a year ago.' https://t.co/JGXuP2sXSi", "Virus variants\nAckermann (Taskforce): 'There are various new variants in Switzerland. The British variant (B.1.1.7) occurs most frequently. With this mutation, the situation can quickly become critical again. The chains of contagion need to be broken and followed up.'", "Masserey: 'We received around 800000 vaccine doses so far, around 700000 have been delivered to the cantons. More or less 410000 people have been vaccinated. \nOur efforts are having an impact, but we have to be careful that the more contagious variants don't get out of control.'", "Masserey: 'When it comes to mutations, we are mostly dealing with the variant initially appearing in Great Britain. We have to keep doing lots of testing. We also discovered the first case of the Brazilian variant.'", "Masserey (BAG): 'We have declining cases, 16% less than a week ago. The positivity rate is also falling. We have an incidence of 233 cases per 100,000 inhabitants. The differences in the cantons are, however, are great.'", "(Thread) \nCoronavirus Press conference with BAG, 9.2.2021. \n#CoronaInfoCH #Switzerland #Covid19 #Coronavirus", "@MarkatCIFF These new awkward situations in everyday life. https://t.co/Hgf4OTLCZS", "Negative. ✅", "@Huwro_Science Sorry, might be reading to much.", "Where do you think we are in the current pandemic? #CoronaInfoCH", "If you're having questions about (re)entering Switzerland, here is the official hotline and links with relevant info. #CoronaInfoCH #Switzerland #Schweiz #Coronavirus https://t.co/kbivpiWsym", "@BAG_OFSP_UFSP press conference at 14:00. I will summarise later! #CoronaInfoCH", "All those new sensations since 2020. For instance that cotton swab poking your brain. 👃", "Another article that highlights the similarities and patterns if comparing the two pandemics: https://t.co/IZQpYsFMDk", "Interdisciplinary research group by Universities of Zurich &amp; Toronto find out that so far we did similar mistakes in fighting against Coronavirus like we did with the Spanish flu: hesitation, early easing or ignoring of the measures. #CoronaInfoCH https://t.co/LavxmMbNru", "People in Switzerland are getting tired of Corona. 100'000 people have signed a petition that urges for the end of the 'Lockdown'. #CoronaInfoCH \n\nhttps://t.co/WtulYj0GlJ", "@JacquelineOShea Thanks for sharing! Hope you recovered well 🍀", "This is interesting. But still – washing your hands often is important! #CoronaInfoCH \nhttps://t.co/ES7hTLqTq8", "@HughOsborne I guess so too, unfortunately.", "Good news: Blood tests reveal that Pfizer-Biontech vaccine is effective in protecting against the new variants coming from South Africa and Great Britain. #CoronaInfoCH https://t.co/2l7HFvf4IB", "3280 new lab-confirmed cases\n66'459 tests\n4,9% positivity rate\n143 hospitalisations\n50 deaths \n\nrelated to #COVIDー19  in the last 72(!) hours in Switzerland. #CoronaInfoCH", "@mel_giancarlo They do! But people don't follow up upon it. I have seen so many cases where people are very uninformed and only care about what they still can or can't do in terms of free movement.", "@Posie_ People are wrong anyways when they thing 'a cold' is due to the weather. Because it's also an infection.", "Slightly runny nose and itchy throat. Could be the weather. But could also not. Appointment booked. ✅🧪 \n\n(Kind reminder to get tested, even if there are only mild symptoms. You do yourself and everyone a favour). \n\n#CoronaInfoCH", "Endurance is what we need. \nThomas Steffen (Cantonal doctor that attends many Federal press conferences) thinks that we might not leave the current 'lockdown' before the end of May. #CoronaInfoCH \nhttps://t.co/O54zHyggfB \n@ThomasSteffen", "Today's numbers of new infections will be delayed – BAG reports technical problems on their website. #CoronaInfoCH", "RT @TheLocalSwitz: The new restrictions are put into place to slow down the spread of coronavirus mutations that have been increasing in Sw…", "Study suggests: Astrazeneca vaccine is less effective with the new Covid strain originated in South Africa. #CoronaInfoCH https://t.co/s6ou4S1ll8", "Moderna and Pfizer are working on studies on how the vaccine works on children. #CoronaInfoCH \nhttps://t.co/gXu7ZIfYCA", "BAG headquarters under police protection – due to several threats. #CoronaInfoCH  https://t.co/bbO4k4wEhh", "The new rules when (re)entering Switzerland. You need to have a negative test before boarding a plane. If you don't you have to pay 200 CHF upon arrival. #CoronaInfoCH #Switzerland https://t.co/KUrxNJTrk0", "Restriction and rules when (re)entering Switzerland. Valid from today. #CoronaInfoCH #Switzerland #Schweiz https://t.co/Ialem1QHVX", "Ski resorts ease measures: From tomorrow on, in Canton Nidwalden people can sit on the terrace and consume their take away food bought at the restaurant. #CoronaInfoCH https://t.co/zJYw3tAZ9d", "R-value falls below 1. And is now at 0.88. This dates back to data from 26 Jan. (R values can only be calculated in retrospect) #CoronaInfoCH \n\nhttps://t.co/zJYw3tAZ9d", "@VLBhome It's different in every canton. You can easily find it on your canton's website.", "@nashbetty I believe on Monday.", "@Swiss_Danny_67 They do – but «Swiss» heat.", "@SheeMeeHeer ... but then went to Zurich, as it is some kind of logical thing to do when you are young and also want to feel like that.", "@SheeMeeHeer As they are all so individual and different, it's hard to say. Grew up in St. Gallen, but left at some point – asap. I can say that I feel very romantic about both Appenzell, for their mysterious and sometimes beautiful weirdness. And the Alpstein region of course. https://t.co/8Y0bDhD7a2", "@JM_Science 🤐 ...\n... but somehow I'm optimistic.", "@DecaroliChiara https://t.co/P1uiFLOAiM", "@RoisinKenny10 So far it won‘t be changed and we can‘t expect any easing", "@AnExpatWife Unfortunately no pulled pork sandwiches – but a quick but hearty Pesto al Genovese. Slightly hacked, sunflower seeds instead of pine nuts, and pecorino added to the parmigiano. https://t.co/l0KEnT2FbV", "@Googahn 1. I hope that all the mistakes will be lessons learnt. Swiss universities are already forming think tanks / projects about the topic of pandemics. As it might not be the last one. \n2. I'm not only doing this, but also working as a freelance writer. But let's see what happens :)", "@lpuerto If so, then very delayed. At the moment they officially say that it's not recommended for everyone, only for people that are highly exposed to the risk of getting infected.", "An overview about mask regulations / rules in schools in Swiss cantons. #CoronaInfoCH https://t.co/H1XZ6qKvX5", "@calm_sutra We can't really foresee what's going to happen. I would assume if there are too many infections happening in school due to a new strain, the current measures in/around schools are not going to be enough. But we don't know.", "Ask me and the community here anything. #CoronaInfoCH", "Canton Vaud will start a big mass testing campaign in ski resorts. Locals will receive a text message with an invitation to get tested. Tomorrow #Villars, Monday Les #Diablerets, Thursday #Leysin. Tests are free of charge. #CoronaInfoCH #Vaud https://t.co/zJYw3tAZ9d", "Scientists took samples of 350 door handles, trash bin lids, keyboards, ATMs, ... – and found 29 contaminated surfaces. But the particle loads were so low that only 5 in 10'000 cases would cause an infection. #CoronaInfoCH https://t.co/BmG4vzDiBC", "Door handles, buttons, toilet flushes, ... How do you touch them since the pandemic? #CoronaInfoCH #Switzerland #Coronavirus", "🔴 Breaking 🔴\n\nNew strain spreads faster than expected. Within a week, we reached 3264 cases. Which is a sharper increase than 100% within a week, which was initially expected by the BAG. \n\n#CoronaInfoCH \n\nhttps://t.co/eO8KNHy7Jg", "Study shows: 14% of population in canton Bern already had been infected with Coronavirus. #CoronaInfoCH #Switzerland #Bern https://t.co/rFqjMHUx6D", "https://t.co/xWh07j86YJ", "@fedpolCH sends warning letters to Corona sceptics after posting soft threats directed at Alain Berset. #CoronaInfoCH", "Canton Zug has decided: Mandatory mass testing at schools. \nNow the national association of teachers wants whole Switzerland to institutionalize this. #CoronaInfoCH https://t.co/Rcua11KdGB", "Measures most likely not to be eased (much) by end of February. \n#CoronaInfoCH #Switzerland #Lockerungen #Schweiz \nhttps://t.co/mdaKDkk2iS", "RT @TheLocalSwitz: Switzerland will not approve the AstraZeneca vaccine, saying there is insufficient data to do so. This may have implicat…", "End of the press conference. Thanks for following!", "How much money was spent on vaccine?\nKronig: “We do not comment on actual prices we agreed with the producers. We started at 309 million francs. Thanks to a commitment loan, we now have funds of the amount of 800 million CHF\"", "Switzerland says they won't buy the Russian vaccine #SputnikV #CoronaInfoCH https://t.co/XY9Y3dexuI", "Will we buy Sputnik, the Russian vaccine?\nBerset: «Since last year we have been talking about which vaccines we buy. In my opinion, Sputnik has never been shortlisted.»", "Will measures be eased?\nBerset «We cannot assume that we can loosen it up a lot. On February 17th we will take the next step. We have not yet decided how and if we will ease the measures.\"", "When is Novavax coming?\nKronig, BAG: «Novavax is planned for the second quarter and will take several months. That then drags on for months. Moderna comes with a million from August, one from September, the rest later and dynamically.»", "When is Novavax coming?\nBerset: “Deliveries of the vaccinations will come from April to June. Of course, an approval by Swissmedic needs to be provided before a rollout.»", "Will the vaccination goal be achieved?\nBerset: «Yes, we are optimistic. By summer everyone who wants, will be able to get vaccinated.»", "Why Switzerland doesn't close schools yet, although new variants are spreading there. #CoronaInfoCH https://t.co/SpkKjugwV3", "Mathys, BAG: «There are outbreaks with the new variant in schools, that's true. We now know that children can be carriers and can pass the virus on. It can be incredibly fast.  Now we have to analyze and see what contribution schools can make in the fight.»", "Will schools be closed?\nBerset: «We don't see that as a possibility at the moment. It's up to the cantons - and they do their job well. Second point: The mutations change children's susceptibility to infection.»", "Why so much vaccine? 30 million is more than we need?\n– Kronig (BAG): «We continue to procure because we want to minimize the risk. We want to be armed against fluctuations and difficulties. So we will reach our destination by summer»", "New Contracts: Why Not Johnson and Johnson?\nBAG answers: “We communicate the concluded contracts. We also have a preliminary contract with Novavax. We are in contact with other manufacturers. As long as no contracts have been concluded, we do not communicate.\"", "«If the mutation case numbers continue to double every week, then we have to see what we do.», says Berset.", "Do we need further measures? \n– Berset: “We don't know how it will develop. We only know that the situation is more difficult than it was in December, when we decided on the measures. At that time we had no knowledge of the mutations...", "From April / May, Curevac will be available with 5 million doses, plus 6 million doses from Moderna, Berset repeats.", "Berset: «We are in a dilemma. The numbers are developing well. But the problem are the mutations: They are much more contagious. This can be seen, for example, in the fact that the R value has risen above 1 in various cantons. The situation is very unstable.»", "Breaking: Alain Berset is confident that by summer 2021 every person in Switzerland that wants to be vaccinated will be able to. #CoronaInfoCH #Vaccine #Impfung", "Berset is confident that anyone who wants to get vaccinated will be able to be so by the summer.", "A contract for a further 6 million doses is signed with Moderna. \"We have to be well prepared for the vaccination strategy, it's not like the vaccination is over at some point and we can go on vacation\", says Berset.", "Berset: \"Curevac will deliver 5 million vaccine doses in the second trimester, we have signed a contract\". Of course, as with any vaccine, Swissmedic must first grant approval.", "«We can see that the mutations double every week on a case-by-case basis», says Alain Berset.", "Berset on the test policy: “It remains important that we test a lot. This is the only way we can make sure we keep an eye on the pandemic. Mass testing is also helpful.\"", "Alain Berset is concerned: The mutations of #Coronavirus pushed the R value above 1 again in some cantons. #CoronaInfoCH #Schweiz #Lockdown #Lockerungen https://t.co/G2KiKkSx0z", "Berset talks about the mutations, including the South African: “We have to watch the numbers closely. We have signs that the number of cases is increasing again because of the mutations. In various cantons, the R-value has risen again above 1.", "Berset: \"We are experiencing a pandemic within the pandemic and that is causing  difficulties.\" The figures are comparable to those at the beginning of Oct. – if only there wasn't the mutation, which is up to 50 percent more contagious, says Berset.", "Swiss government has negotiated new vaccination contracts with 3 manufacturers for 17 million doses. Among others, new vaccines from Curevac, Novavax and other doses from Moderna have been added. #CoronaInfoCH", "(Thread) \nCoronavirus Press Conference with @alain_berset, 3.2.2021. \n#CoronaInfoCH #Switzerland #Schweiz", "Swiss government has negotiated new vaccination contracts with 3 manufacturers for 17 million doses. Among others, new vaccines from Curevac, Novavax and other doses from Moderna have been added. #CoronaInfoCH", "Press conference now – Alain Berset talks about the Federal Councils decisions. I will summarise afterwards. #CoronaInfoCH \n\nhttps://t.co/7trr4duRwP", "Today the Federal Council will have a meeting – according to sources, Alain Berset will be against an easing of current measures. More info on what has been decided to be expected later today. #CoronaInfoCH https://t.co/V0sRsuptRi", "1633 new lab-confirmed cases\n25'279 tests\n6,5% positivity rate\n90 hospitalisations\n46 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. \n\n#CoronaInfoCH", "My personal thoughts on how Switzerland deals with schools in current times. #CoronaInfoCH #Schulen https://t.co/f7OGHQmeXq", "Switzerland: Canton Thurgau rebuilds one of its cruise ships into a «vaccine ship». A vaccine center on water (but on the shore). \nImages: @key_SDA_news  \n#CoronaInfoCH #Vaccine #Coronavirus #Switzerland #Schweiz #vaccine #Impfschiff #Impfung \n@nytimes @Reuters_Health @Reuters https://t.co/koKKej6eVo", "End of the press conference. Comment here if you have any further questions and I (or the community) can try to answer! If you wish to support me for my work, you can do so here. Grazie 1000! \nhttps://t.co/kojxpNz1IB", "“We still recommend that FFP2 masks should not be used for the general public,” says Mathys. \"But it can be useful in special settings.\" The BAG does not recommend wearing FFP2 masks in schools.", "Are school closings disucssed now?\n«At the moment, the cantons are in the lead. Many measures other than school closings are no longer possible. There are, for example, restrictions on mobility abroad. But we are not ready to discuss it in concrete terms.»", "Should companies that employ cross-border workers have to test them?\n«We don't see any reasons why we should treat cross-border commuters differently than other employees» says Lévy.", "Are hospitals now increasingly performing other interventions again?\n«That is definitely a possibility» says Mathys. «Around 20,000 operations have been postponed and will have to be rescheduled. There are also more accidents in the winter season.»", "About children: «It is true that there have been some outbreaks in schools recently. Science has also brought new knowledge in this regard. We do not know exactly how the situation in schools is. But it is clear that closing schools would have a major impact on society.»", "From which R value is no further growth possible?\n\"A value of 0.6 would be good,\" says Mathys. \"We were once close to 0.8, but not sustainable.\"", "Other countries talk about easing the measures. What about Switzerland? \n«There is no defined system for when easing should be considered» says Mathys. «There is no reason to think about easing now.»", "What is the BAG's assessment of the measures taken on January 18?\n«The effect is still positive» says Mathys. «The question is whether the measures are enough to contain the new variant.»", "Mathys: «From March, the new variant will be the dominant variant in Switzerland. The number of cases could then increase rapidly and significantly.»", "Lévy also welcomes weekly tests in schools. «When in doubt, it is wise to test,» says Lévy.", "«We welcome it if the cantons do mass testings» says Lévy. «We still have a test rate that is too low, the canton of Graubünden has played a pioneering role here and it is wise that this should continue.»", "About the initial vaccination plan: \n«We cannot meet our goals for February» says the BAG, referring to the delivery bottlenecks. «But we will catch up again.»", "From February 8th, all people entering Switzerland (with the exception of cross-border commuters) must fill out an entry form. «The purpose of collecting the data is to enable us to quickly implement the isolation measures» says Mathys.", "«However, we cannot give any reliable information on whether the new variants are responsible for the fact that the numbers no longer fall as quickly. But it is not unlikely.»", "«In the canton Geneva, 40% of all cases can be assigned to one of the two new variants, especially the British one,” says Mathys.", "The British variant continues to spread. There are currently 1,111 confirmed cases, 57 of which are due to the South Africa mutation - with around 1,500 samples it is unclear which mutation it is.", "\"If the R value remains at this level, we will only move sideways, the numbers will no longer fall.\" Mathys therefore calls on you to adhere to the hygiene and distance rules. \"The new variants are easier to transfer, so an even greater effort is required.\"", "However, the R value has risen again and is now back at 0.98. «This means that a further reduction in the number of cases can hardly be achieved» says the BAG.", "The hospital staff is still under pressure. 70 percent of all intensive care beds are still occupied, 29 percent of all occupied beds are due to Covid. «There is still an excess of mortality to be recorded» says Mathys. «This is mainly due to the coronavirus.»", "«Our strategy was successful» says Lévy. The vaccine producers that were counted on are the right companies. «The federal government and the cantons are on track. In an international comparison, 3.64 percent is a good number.»", "Vaccine: \n«The vaccination campaign has started successfully» says Lévy. She refers to the 3.64% of the CH population who has already been vaccinated. «The vaccination of the first risk group (75+) continues. The cantons show solidarity with one another and help one another.»", "BAG Director Anne Lévy: «For a few weeks now there has been a little hope. But the tendency that show a decrease of new infections is deceptive.» The BAG is worried that the British Covid variant could lead to a trend reversal.", "(Thread) \nCoronavirus Press Conference, 2.2.2021. \n#Coronavirus #CoronaInfoCH #Covid19 #Switzerland #Schweiz", "Austria will leave its Lockdown step by step from February 8. Will Switzerland follow by the end of February? We don't know yet. The goal of only 300 new infections / day is not really in sight yet. #CoronaInfoCH https://t.co/3P38IXG57J", "Press conference today 13:00. I will summarise after. \n\nPossible topics: \n- Geneva study that shows that children are affected the same way as adults. \n- Progress of vaccinations \n\n#CoronaInfoCH", "The BAG keeps saying that children are not to be concerned about when it comes to the question of who drives the pandemic. \nNow: A new study from Geneva shows that children get the Virus as often as adults. #CoronaInfoCH \nhttps://t.co/4ICu07c4lF", "Arosa says that the recent major outbreak is now under control. Mass testing allowed the officials to detect the sources of the outbreak. #CoronaInfoCH https://t.co/9cNGLRy61T", "3775 new lab-confirmed cases\n63'152 tests\n6% positivity rate\n78 deaths \n161 hospitalisations\n\nrelated to #Coronavirus in the last 72 (!) hours in Switzerland. #CoronaInfoCH", "Ex-BAG Daniel Koch believes that Europe might have control over the pandemic by Summer. #CoronaInfoCH https://t.co/s2sD8YUuN5", "R-Factor is increasing again. Currently at 0,97. #CoronaInfoCH https://t.co/zJYw3tAZ9d", "Arosa did a mass testing session. Amongst the 2570 tested people, 58 were positive. 45 of all positive cases suffer from the new B.1.1.7 strain (77%). #CoronaInfoCH  \nhttps://t.co/zJYw3tAZ9d", "This is the new quarantine-country list for Switzerland. #CoronaInfoCH #Switzerland #Quarantäne #Schweiz @BAG_OFSP_UFSP https://t.co/M8bSkNrNq5", "@Posie_ ... And also how the vaccine is being rolled out.", "@Posie_ Yes, it is limited by that factor.", "Swiss pharma company Novartis to support Pfizer in producing vaccine. #CoronaInfoCH https://t.co/Hzqzd9yaW4", "Up to now: 3% of people in #Switzerland got the vaccine. #CoronaInfoCH #Vaccine https://t.co/8SN7ih1l3B", "Breaking: Coronavirus mutation from South Africa (N501Y) detected ++ 4 kids positive ++ 450 students and kindergarten kindergarten pupils quarantined ++ mass testing amongst students scheduled for today. #CoronaInfoCH \nhttps://t.co/eO8KNHy7Jg", "@JimAndrakakis @bathtimedrinker @migros @coop_ch When I was a child Coop was 'cooler' than Migros because it had all the brands, while Migros produced (or branded) all their products in-house. Migros had this socialist vibe, why I, and other @migros kids, were even bullied. But when punk was cool – Migros kids were cool again.", "@JimAndrakakis @bathtimedrinker @migros @coop_ch Well I am a @migros kid. Everyone born / grown up in Switzerland, up to millennial, knows about this. Back then there wasn't as many stores in CH, so your parents either go to Migros or Coop. There were no German discounters (what a time to be alive).", "I'm sure you've all heard of the \"Migros Child\" vs. \"Coop Child\" thing in Switzerland. Big poll now, opinions wanted. Who does a better job in terms of Covid safety precautions? Where could they improve?\n@migros @coop_ch\n#CoronaInfoCH", "More than 100 people attended an illegal new years eve party in Volketswil. Now the police has arrested 5 of them, and against 45 more reports have been filed. #CoronaInfoCH https://t.co/Xe3MGRhNaq", "Correction – people affected by Coronavirus strain B.1.1.7 tend to report more often coughs, sore throats, fatigue, muscle aches, but less from loss of taste and smell. #CoronaInfoCH \n\n https://t.co/cfjhWXBLAc", "@AnExpatWife @20min thanks!", "Today a delegation of scientists of the @WHO starts investigations in Wuhan, China. They'll do field research, visit hospitals, labs and markets. #CoronaInfoCH #WHO #Wuhan  \n\nhttps://t.co/F5mJ12AbR2", "Source: https://t.co/0BYAl1fmqF", "Canton Graubünden introduces mandatory FFP2 masks for hospital visitors. People can receive maximum 1 visitor / day, for 30 minutes. #CoronaInfoCH \nhttps://t.co/zJYw3tjnKD", "Todays numbers are looking better. But keep in mind that we have to still be very careful – especially because of the 'new' Covid strains that are currently spreading, and have potential to spread really fast (up to 70% more than recent strains). #CoronaInfoCH https://t.co/Q1bqe5SHPb", "1699 new lab-confirmed cases \n26'638 tests\n6,4% positivity rate \n94 hospitalisations\n52 deaths \n\nrelated to #COVID19 in the last 24 hours in #Switzerland. \n#CoronaInfoCH", "@alfdan true. flawed as well", "@SheeMeeHeer Well you'll know after the test. After.", "@dawn_hall yes.", "@ArsanyGuirgis Thanks Arsany!", "@LaSmartym 🙏", "This is a legit question. Can people from risk countries that are not exceptions listed in the screenshot below now enter Switzerland again, in case of a negative PCR test? \n@BAG_OFSP_UFSP @BR_Sprecher @alain_berset \n#CoronaInfoCH https://t.co/iWdgxhQj8z", "2222 new lab-confirmed cases \n27'204 tests\n8,2% positivity rate \n85 hospitalisations\n58 deaths \n\nrelated to #Coronavirus in the last 24 hours in #Switzerland. \n\n#CoronaInfoCH", "Dear @BAG_OFSP_UFSP &amp; @BR_Sprecher, I've been receiving questions from foreign travellers that already got the 2nd vaccine shot in their home; Are they excepted from CH quarantine rules? In todays PC, you've only answered the question regarding CH citizens. Thanks! #CoronaInfoCH", "End of press conference.", "Are people that got the vaccine excepted from quarantine measures? \n– So far not, as nobody has gotten the 2nd shot yet, according to BAG.", "So now if you've been sick with Coronavirus you can leave quarantine with a negative test on day 7.\nSo on day 7 people walk out of their house, and to a test center or their doc? Feels kind of flawed. #CoronaInfoCH", "@Ferreira88D I also cracked my head over this...", "@ecmarc8 thanks for the heads up!", "“School is a matter for the cantons. With the new possibilities of mass tests, we can observe such outbreaks better, but outbreaks in schools are no reason to close all schools now\", says Berset.", "“School is a matter for the cantons. With the new possibilities of mass tests, we can observe such outbreaks better, but outbreaks in schools are no reason to close all schools now\", says Berset.", "https://t.co/iygRkDqbCt", "https://t.co/HqvveJBUGo", "‼️ \nFederal Council / BAG now confirm that they can see many outbreaks in schools, thanks to mass testing. \n‼️\n«It is actually the case that quite a number of outbreaks have been observed in schools. We watch it with concern and think about how we can react», BAG. \n#CoronaInfoCH", "Journalist asks if Ueli Maurer is greedy. \n«No, but I want to draw your attention to the fact that we are a rich country, but we also run out of money,»says Maurer. «When we go into debt, we spend our children's money.»", "📄\nThis is the official document from the Swiss government with the new rules on travelling, quarantine, rapid tests, etc. \n\n#CoronaInfoCH #Switzerland #Schweiz #Swiss #Quarantäne #Bundesrat\nhttps://t.co/pkpVY683mo", "@yelrekcazaf this is a confusion indeed. also to me. i guess with 'risk country' they mean quarantine country.", "\"Our infection numbers are lower than they have ever been since October,\" says Berset. «That is good news. But the variants that have led to strong increases in other countries are also present here. The development could also happen here.»", "Do drivers entering Switzerland by car also have to show a negative test?\n\"If they come from a risk area, yes,\" says Berset.", "New: If you travel to Switzerland from a risk country or any other country (via airplane), you have to present a negative PCR test no older than 72 hours.  \nhttps://t.co/AOMTGOFsgt\n#CoronaInfoCH #Switzerland #Schweiz #Swiss #FlySwiss", "@AlessioCavalla1 @jeremyelmaleh Thanks!", "@jeremyelmaleh yes but on the contrary, travellers (airplane and risk areas) should present a test result upon arrival. this he also said.", "In which cases does Switzerland pay mass testings? \n– \"At institutions like nursery homes, or when it comes to preventing local outbreaks.\"", "@jeremyelmaleh Source? \nBecause they only mention risk areas.", "“We have also introduced new rules for travel quarantine. Anyone who returns from a high-risk country must show a negative test. Also all plane travelers.\" \n– (this seems confusing. 'all' plane travellers? i'm not sure. i will look into it later)", "The test one does in order to potentially leave quarantine after day 7 has to be paid by the patient.", "Mask refusal or illegal private event: the police can now issue fines between 50 and 200 francs.", "Commuters between Switzerland and neighbouring countries are not affected by the new testing regulations! \n#CoronaInfoCH #Schweiz #Grenzgänger #Deutschland #Österreich #France #Italia https://t.co/HLRhWBsOSW", "\"The cross-border commuters are not affected by the new decisions,\" says Berset. «We need a solution that can be implemented. We can't all test at the limit.»", "New: Quarantine can be left after 7 days, if a negative PCR or rapid test is available. https://t.co/MrnT2XzhZn", "Another decision was made regarding the quarantine rules. «If a person is in quarantine, it can now be lifted after 7 days instead of 10 – if a negative PCR or rapid test is available», says Berset.", "New: Rapid tests for the symptom-free are now paid by the Swiss government. #CoronaInfoCH https://t.co/UQlf2SzgYo", "Berset confirms: “The federal government is now also financing  rapid tests for symptom-free patients because the were only rarely used. Use them! In schools, companies, nursing homes.\"", "Berset: \"The infections have decreased, but the level is still high.\" For the new mutation, he sees a doubling every two weeks, which is hidden in the total (falling) numbers. “We still have to be very careful,” says Berset.", "\"The daily allowance for the unemployed has been extended by three months,\" says Parmelin. “We know that it is difficult to find new work at the moment. The Federal Council is making a further CHF 8 billion available for short-time work. \"", "Every minute Switzerland goes 100'000 CHF more in debt due to the pandemic. #CoronaInfoCH https://t.co/bIKvsYwxxV", "«We have spent around 15 billion on the Covid measures in 2020,» says Maurer. «In 2021 there will be (almost) another 15 billion. The state has run out of money, we go 150 million francs in debt – every day, that's 100,000 francs a minute.».", "Ueli Maurer speaks about the hardship cases. “We are increasing the hardship cases from 2.5 to 5 billion. That is our current estimate. \" This requires an urgent change in the law, which is to be worked out by next Wednesday and submitted for consultation.", "«What I can assure you: our discussions are open and honest. We want to find the best-adapted solutions for the respective situations that best help the country. There will always be people who are dissatisfied with it – there are just too many aspects in this pandemic\", Parmelin", "\"The  Council is aware that many people in Switzerland are suffering from the current situation,\" says Parmelin. Efforts have been made to find a compromise that is acceptable.", "(Live thread) \nPress conference with Swiss Federal council on #Coronavirus, 27.1.2021\n#CoronaInfoCH #Switzerland #Schweiz #COVID19", "Today 14:00 #Covid19 Press conference with Federal Council. \n\nI will tweet live. 🔴\n\n#livetweets #COVID19 #CoronaInfoCH #coronavirus #Schweiz #Switzerland https://t.co/oZHozIPlIq", "Correction: They will discuss these points *today*, not tomorrow. It might be that we have already news by today. Stay tuned. #CoronaInfoCH https://t.co/SQ0TlnaA71", "@terryltucker No worries! They didn't really make that clear. They closed 'non essential shops' but consider a hairdresser as a 'service provider', which all remain open. I understand and agree it's confusing / doesn't make much sense, regarding social distancing. But that's how it is unfort.", "@wonderspirit Right now there is no news – but if schools have to change their learning methods, high schools would be the first ones to change to distance learning, according to current news. More about this after the Council has met tomorrow.", "For everybody who can't understand why there is a tendency for stricter measures despite falling numbers: The new Covid strains can be seen as a 'pandemic within the pandemic', and science and politics are expecting &amp; trying to defeat a new high rise in new cases. #CoronaInfoCH", "Interesting interview with sociologist Mike Davis on how  factory (animal) farming causes pandemics. Also his book «The Monster at Our Door» (2005) is highly recommended. It can be read as a scary prediction of what's happening now. #CoronaInfoCH https://t.co/xIUFf6Mb2V", "All swiss political parties want a strict testing regime for everyone crossing the border. 350'000 cross border workers are afraid of that and want to fight against it. #CoronaInfoCH https://t.co/FDGsdBjNBU", "Up to now, the police had to report cases, which caused a complicated bureaucratic process.", "=&gt; Fines\nViolations of the Covid rules should be punished unbureaucratically. The Federal Council should therefore adapt the ordinance. Anyone who takes part in a private party with more than five people should get a fine of 100 francs, the organizer a fine of 200 francs.", "The focus is on half-class lessons and, in a second step, the switch to distance learning, especially at high schools.", "=&gt; Schools\nAccording to the wishes of the cantonal education directors, the primary schools should definitely remain open. However, the federal government is working out a concept for the case if the epidemiological situation worsens.", "or old nursery homes and cover the costs. Also preventive tests at schools or companies are planned. Mass tests can be helpful to detect hotspots, for example in villages or in hotels. The authorities could also penalize people who do not show up for a test.", "Mass testing:\nIt is believed that more than half of  transmissions take place through asymptomatic people who do not notice that they are infected. The federal government now wants to change the test strategy. He would like to promote regular tests for employees of hospitals...", "=&gt; Borders\nBerset wants travelers from risk areas to present a PCR test upon arrival. The quarantine will be 7 days if a new negative test is then present.", "(Thread) \nBreaking \nThis is how Alain Berset wants to tackle/minimize the outbreak of new #COVID19 strains in Switzerland. The council will discuss these strategies tomorrow. \n#CoronaInfoCH #Switzerland #Schweiz \nhttps://t.co/0LFjJKsGRD", "@MarkatCIFF Well that’s hopefully not the aim!", "Covid vaccine supply issues could see Dutch violence repeated in rest of EU \n#CoronaInfoCH #europe  https://t.co/OiSVZX0Z9e", "@IMNOTYELLING Yes, the Task Force (Ackermann) mentioned something that goes in this direction: They decided to buy 'less' because the doses have been used up as quick as possible.", "Today's press conference. \n- Task force expects cases with new mutations to double every other week \n- While infections currently decrease \n- Despite difficulties with vaccine capacity, the BAG is positive and thinks that goals can be reached \n#CoronaInfoCH https://t.co/o609xQMFJf", "End of press conference. Thanks for following!", "The British mutation continues to cause concern. The BAG assumes that by March more than 50 percent of all Covid cases will be due to variant B.1.1.7.", "Don't we need FFP2 masks in public transport?\n“That has to be clarified scientifically” says Hauri. «Public transport is not my focus because the volumes are relatively large. The problem is rather in narrow and small spaces, where wearing FFP2 masks would be an option.\"", "What counts as test evidence from tomorrow on?\n“A proof of a test result can be shown on a cell phone or on paper,” says Mathys.", "Can anyone who wants be vaccinated by summer?\n\n\"We bought 15 million doses,\" says Kronig. \"I cannot make any statements about vaccines that have not yet been approved.\"", "Was Switzerland too slow with the vaccine? \n\"That is wrong. We have signed contracts with three companies, we were the first country to sign a contract with Moderna. In an international comparison, we have are doing quite good. We are confident about our vaccination campaign. \"", "The timely administration of the second vaccination could be at risk - how does the BAG react?\n«The planning and implementation of vaccinations are basically a matter for the cantons. If there are delivery bottlenecks, it's because Switzerland doesn't get deliveries on time.»", "Could Switzerland be cut off from deliveries of vaccines from the EU?\n\"We are following the situation very closely,\" says Kronig. \"We will see how the discussion develops within the EU and how we will position ourselves it it.\"", "\"We already have the announced 500,000 January vaccination doses in Switzerland,\" says Kronig. “It still looks as if we will get the promised deliveries between January and March, including the million vaccine doses in February. But there can be fluctuations. \"", "Do we need new measures due to the new virus variants? \n– \"We are currently expecting a doubling every two weeks,\" said Ackermann. \"It is currently not possible to estimate what impact the new measures of January 18 had.\"", "The cantons will be able to expand their test capacities. “There are mass tests at schools, social institutions, service providers and companies with frequent customer contact up for debate,” says Hauri. FFP2 masks could be made mandatory in certain circumstances.", "Are the mutations more or less deadly? Martin Ackermann from the Science Task Force: “The variants are more contagious. And a more contagious virus has more potential to kill people than a more deadly one.\"", "\"The vaccination is one part of the protective measures against the coronavirus, it does not cancel any other measures,\" says Berger. The current aim of the vaccination is to protect the  vulnerable.\"", "Nora Kronig, Head of International Affairs at BAG, speaks about vaccinations. To date 197,368 vaccinations have been administered in Switzerland.", "Mathys is very concerned about the new corona mutations. Over 1100 cases have currently been detected in Switzerland.", "Mathys describes the number of hospitalizations as \"very positive\". It is falling very sharply. However, 70 percent of the intensive care beds are still occupied, mostly by Covid patients.", "\"We are going in the right direction – but not fast enough,\" says Mathys from BAG. He refers to the current numbers, which are falling. However, the flattening has decreased in recent days.", "(Thread) \nPress conference with BAG on #Coronavirus in Switzerland, 26.01.2021. \n#CoronaInfoCH #Switzerland #Coronavirus", "Task force expects that the number of cases with the new strain will double every two weeks. In March, most cases will be due to the new strain. #CoronaInfoCH", "@lpuerto And licking her fingers...", "@lpuerto 🤌🤌🤌", "@tomasz_susul @BAG_OFSP_UFSP Haha no I won't.", "@DRO_oDR smart.", "@lpuerto You're right, it's a difficult topic. Anyhow, a sip of water takes a couple of minutes. A kebab longer – it feels like hours when you sit next to the person who enjoys it.", "BAG has updated their website. There is a lot of info available in English now! \n\n#CoronaInfoCh @BAG_OFSP_UFSP #Covid_19 #Schweiz #Switzerland \n\nhttps://t.co/1N9mPBXpyw", "What to do with people that are 'sneaking out' of mask requirements by eating and drinking in public transport? \nWell, the nasty Big Mac smell has always been unpleasant, long before Covid. #CoronaInfoCH https://t.co/MfxUsMxlUE", "1884 new lab-confirmed cases\n21'618 tests\n8,7% positivity rate\n92 hospitalisations\n57 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. \n\n#CoronaInfoCH", "Third day of riots in the Netherlands, after the country has introduced an evening/night curfew due to #Coronavirus. #CoronaInfoCH #Netherlands \nhttps://t.co/ZhSU4ceE80", "@sitnsmile @gd_zuerich Got a big nose?", "There is a press conference on the Covid situation in Switzerland at 14:00h. I will summarise afterwards! #CoronaInfoCH", "1 of 10 people suffering from milder cases of Coronavirus might suffer from «Long Covid». This causes a major challenge for insurances &amp; social systems – and also immense costs for the state.\nIs that (amongst other reasons) why the Council is suddenly more alert? \n#CoronaInfoCH https://t.co/MThZFEXX4i", "Bottom line, the situation about Long Covid sufferers will be complicated and be a major struggle for them. The Swiss government needs a lot of further research to learn more about Long Covid and perhaps to adjust certain insurance policies, both work, social and private.", "It will also be difficult to distinguish if someones symptoms that cause inability to work are due to Covid. E.g. chronical exhaustion could also be due to depression, etc. Similar challenges / debates have been faced by illnesses such as whiplash.", "For people suffering from Long Covid symtpoms, it will at some point also be a question where they got infected. In private – or at work? The judges that will have to decide over this, which is obviously complicated, and decide which insurance comes into place.", "It's also a major challenge in terms of social security / insurance. Will the symptoms of long covid not disappear, also other insurances will come into place. In Switzerland it's the IV (Invalidenversicherung) that covers your loss of income due to illness.", "Long Covid also causes a major challenge when it comes to the question of 'who pays the costs'. It's difficult to get a health insurance pay for the treatment, as symptoms are similar to other diseases.", "Currently, «Long Covid» suffereres have a hard time finding help. On the contrary, other countries have already openend Long Covid clinics. Great Britain has 69 of those clinics.", "The Swiss Covid Taks Force writes in their «Long Covid Briefing» that these patinents suffer from chronic shortness of breath and other physical and mental disabilities after their Covid-19 infection.", "To this numbers, we have to add 490'000 people in CH that had a mild versio. Given the British statistics, 50'000-100'000 of these might suffer from «Long Covid».", "The German Robert-Koch-Institut estimates 40% of all hospitalized cases to have negative long term effects. In Switzerland that is 7000 people so far, according to the numbers of previous hospitalisations. (21000 hospilalised, 17000 survived).", "An epidemiologist from Universität Zürich thinks that 20% of all even mild cases will have long term effects on one's health.", "https://t.co/wp8XXVSC0w", "(Thread) \nVery interesting article on «Long Covid» (milder cases with long term effects) and it's impact on public health and economy. \nAccording to the British office for Statistics, every 10th case leads to long term symptoms. \n#CoronaInfoCH #LongCovid", "Study shows: Moderna vaccine also works with the new mutations. #CoronaInfoCH #Moderna https://t.co/M2jmzajPBD", "@MartiniAlex @tagesanzeiger Mind that the numbers are per 100k.", "From February on, Alain Berset wants to have 525 / 100'000 people vaccinated. From July on, he even wants to have 3 times as many / day vaccinated (1575). @tagesanzeiger writes that CH doesn't get enough vaccine delivered for these plans. #CoronaInfoCH \nhttps://t.co/8sjQNw8QD0", "– So far, 535'115 vaccine doses have been delivered to Switzerland \n– 197'368 doses have been given to people \n– This is 2,29 doses per 100 inhabitants \n#CoronaInfoCH #Switzerland #Vaccine \nhttps://t.co/8SN7ih1l3B", "4320 new lab confirmed cases\n55'071 tests\n7,8% positivity rate \n129  hospitalisations \n85 deaths \n\nrelated to #Coronavirus in the last 72 (!) hours in #Switzerland. \n#CoronaInfoCH #Covid_19 #COVID19", "@ValeJustCoco Get well soon!!", "Netherlands: Two weekends of protests, after the government has announced (and introduced) a national wide night curfew. #CoronaInfoCH https://t.co/4VoeRUFZSy", "Israel closes international Airports, due to #Coronavirus mutations. #CoronaInfoCH #Israel https://t.co/8m3aWCwHYW", "Swiss study shows: The first #Lockdown saved 35'000 lives in Switzerland. #CoronaInfoCH https://t.co/IVuyIaSQis", "Official advise from the Swiss government: Pregnant women with chronic diseases such as high blood pressure, obesity or diabetes should get the vaccine. But always consult your doctor for further explanations. https://t.co/zJYw3tAZ9d #CoronaInfoCH", "Wishing you all a happy week! ☀️ What's your goals for until Friday?  #CoronaInfoCH", "Larry King died in the hospital where he was trying to recover from #Coronavirus. #CoronaInfoCH #LarryKing https://t.co/1JPSjphAoQ", "Imagine all those stiff upper lipped grim faces", "Bern: Corona sceptics plan a no-mask-flashmob for tomorrow. Their idea is to enter different stores with a mask but take it off at a certain hour – all at the same time, so there should be shops full with un-masked people. #CoronaInfoCH #Bern \nhttps://t.co/e1Ec8XDD4G", "Check the graphics in this article and find out how many people each canton has vaccinated so far. #CoronaInfoCH https://t.co/bePiU9tZuj", "Two private schools temporarily close due to cases with one of the new mutations. #CoronaInfoCH https://t.co/zJYw3tAZ9d", "Aldi has the cheapest FFP2 masks: From tomorrow on you can purchase a 50pack for 50CHF. #CoronaInfoCH \n\nhttps://t.co/8t8xJF4sbK", "170'000 vaccine shots have been given so far in Switzerland. #CoronaInfoCH \n\nhttps://t.co/BxJYdfmv5b", "2156 new lab-confirmed cases\n26'667 tests\n8,1% positivity rate \n92 hospitalisations \n62 deaths\n\nrelated to #Coronavirus in the last 24 hours in Switzerland.", "As already mentioned 2 days ago – better get some FFP2. #CoronaInfoCH\n\nhttps://t.co/67q3twar7m", "2205 new lab-confirmed cases \n28'094 tests\n7,8% positivity rate\n93 hospitalisations \n47 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. \n\n#CoronaInfoCH", "In case of an infection with a new strain, the BAG requires from  cantons' contact tracers to investigate up to '2nd grade contacts'. Therefore an average of 65 people have to quarantine in those cases. #CoronaInfoCH https://t.co/64vNDUYk8U", "@jeremyelmaleh Interesting take. But that would only make sense if people eat less in general? I assume that producers deliver more to stores as they deliver less to restaurants? But some producers definitely suffer, as gastro doesn’t buy the same produce as consumers.", "St. Moritz: Mass testing with almost 3200 participants show that +/- 1% is infected. \nBut: 31 members of the hotel staff are infected with the mutated version of Coronavirus. \n#CoronaInfoCH https://t.co/sDwG9F05FD", "Zürich: The canton fears a high increase of new cases, due to the new strains. Mandatory masks for all school kids from 4th grade. #CoronaInfoCH \nhttps://t.co/KtnmwLrATc", "Good morning! How's your day? ☕️", "@Valeria97441393 :D", "@dimkoutsouk https://t.co/HFrEmk71RX", "@Valeria97441393 Shipped from Wuhan.", "@pierrech Tele-vision-watching.", "@jeremyelmaleh I assume this could happen. I just ordered a bigger pack, so I don't have to deal with it when everybody is queueing.", "It is problematic to some degree, as those masks are way more expensive than the blue ones. Not everybody can just easily afford them (1 piece around 6 CHF, while they are still just 'disposable' masks). Let's see how the CH gov deals with it.", "Heads up. #FFP2 masks are now mandatory in Bavaria &amp; entire Germany considers making them mandatory. They offer more protection than the cheaper ones. More and more news reports about / ads for those masks are popping up. Maybe look into it. #CoronaInfoCH https://t.co/9hOEfRFAgN", "2727 new lab-confirmed cases\n32'716 tests\n8,3% positivity rate\n137 hospitalisations\n70 deaths \n\nrelated to #Coronavirus in the last 24 hours in Switzerland. \n\n#CoronaInfoCH #Switzerland #Covid19", "This is how many people each canton has vaccinated so far. Source @Blickch #CoronaInfoCH #Switzerland \nArticle: https://t.co/6vi5gDXS3D https://t.co/F4lrQf8vPK", "Are you wearing FFP2? #CoronaInfoCH", "@savascha I was also thinking about this, yes.", "@ecmarc8 Nothing has been said regarding borders, no!", "Swiss gov is already preparing the closing of schools, if the situation and numbers of new infections get worse. However, they try to avoid it, as it can lead to major damage to the students mental health and learning process, as they say. #CoronaInfoCH https://t.co/V1we6Pjx5Q", "@noaggs Remain open."], "description": "Curated and translated by @kamber_marco\nAll donations are very much appreciated: \nhttps://t.co/PEuJmvCQPq\nhttps://t.co/2vFeCF0LaC\nhttps://t.co/NpfgQa5hDe", "location": "Zurich", "lang": null, "friends_count": 178, "entities": {"url": {"urls": [{"url": "https://t.co/wMMxvGBUlm", "expanded_url": "https://www.coronaenglish.ch/", "display_url": "coronaenglish.ch", "indices": [0, 23]}]}, "description": {"urls": [{"url": "https://t.co/PEuJmvCQPq", "expanded_url": "http://bit.ly/2WmdFWV", "display_url": "bit.ly/2WmdFWV", "indices": [82, 105]}, {"url": "https://t.co/2vFeCF0LaC", "expanded_url": "http://paypal.me/coronaenglish", "display_url": "paypal.me/coronaenglish", "indices": [106, 129]}, {"url": "https://t.co/NpfgQa5hDe", "expanded_url": "http://buymeacoffee.com/CoronaEnglish", "display_url": "buymeacoffee.com/CoronaEnglish", "indices": [130, 153]}]}}}