{"id": 740410251107794944, "screen_name": " DanielCoronaNV", "name": "Mayor Daniel Corona", "statuses_count": 4050, "followers_count": 2541, "tweets": ["RT @ZConine: $2.5B for Roads\n$459MM for Public Transportation\n$402MM for Water \n$293MM for Airports\n$225MM for Bridges\n$100MM for Broadband…", "RT @GovSisolak: I applaud the passage of the historic Infrastructure Investment and Jobs Act that will make life better for millions of Nev…", "RT @POTUS: It’s official, folks: I’ve signed the Bipartisan Infrastructure Deal into law.", "RT @leagueofcities: .@Woodards4Tacoma joined today's Board Legislative Action Committee for a discussion on NLC's federal advocacy efforts…", "RT @PressSec: For anyone who needs to hear it. @VP is not only a vital partner to @POTUS but a bold leader who has taken on key, important…", "Congratulations, Speaker @JasonFrierson!!! 🎉🎉 https://t.co/bZ3UrdbrVF", "✅ Steve Bannon getting indicted\n✅ Britney Spears being freed from her conservatorship\n✅ The start of the #NVLeg redistricting special session \n\nWhat a great start to the weekend!! #TGIF", "@naijaluv409 @AlexGoffNV @NewAmericanLd Congrats Nnedi!!!!! 🎉", "RT @RespectableLaw: One of the cool things about electric vehicles is that we can stop making cars that have been aerodynamically shaped to…", "RT @leagueofcities: #CitySummit2021 starts TODAY! Download our app now to schedule your agenda and get involved!\n\nApple App: https://t.co/W…", "RT @OliverWDahl: My order of all the WENDOVER photo books shipped today! 🎉\n\nLimited copies are still available at https://t.co/LgyKZ4TkEP…", "“Burritos, Bikes &amp; Beauty!” I think we just found a new motto #WestWendover!! https://t.co/1FkUeE0HrQ", "RT @GovSisolak: Today, I am focused on honoring &amp; paying tribute to Nevada’s Veterans for all they have done for our country. On Friday, I…", "RT @RileySnyder: New: Nevada's special session for redistricting will start tomorrow at 1 p.m. https://t.co/gss9Q4tXSw", "RT @flywithkamala: French President Emmanuel Macron greets @VP Kamala Harris at the Arc de Triomphe before a Parisian Armistice Day celebra…", "RT @SenJackyRosen: We owe our veterans and military families an endless debt of gratitude. This #VeteransDay, let’s reflect and thank our h…", "Thank you to all who have served! #VeteransDay https://t.co/Vq0GWIpJO0", "Federal &amp; state officials have faced harassment from the public for decades, but now the trend is trickling down to cities. New @leagueofcities report examines the unfortunate uptick in threats against local leaders &amp; outlines solutions to keep them safe. https://t.co/tRJXQhWehH https://t.co/qXnA5zdwtq", "RT @ceanthony50: We must take care of all members in our communities -- this includes our local leaders who are more than just their job ti…", "This is fantastic news for Nevada’s small businesses! Thank you for your leadership, @GovSisolak!!!!! 👏🏼👏🏼👏🏼 https://t.co/uLBhjotRtK", "@DudeGoods Yes! It is very good.", "@BitterWaterBlue Agree completely!!", "\"As things on the national level started to get more divisive and more painful, that’s when I started to receive threats.\" \n\nGrateful to @leagueofcities for this report &amp; shining a light on this growing challenge facing City leaders!!\nhttps://t.co/9OiOsG9ikg", "The sky decided to show off this morning!! 🌅🤩 https://t.co/vNIXOYAmbD", "RT @IrmaDiggs: .@leagueofcities City Summit is virtual &amp; starts on Friday. Great line up including informative sessions for cities meeting…", "RT @TheNVIndy: Nevada is poised to receive more than $4 billion for highways, transit, broadband, airports and drought mitigation under the…", "RT @YvannaCancela: 4,000 jobs! Kicking off #InfrastructureWeek with a bang in Nevada thanks to @nevadadot!", "RT @AZCardinals: Struck Gold ⛏ https://t.co/0qk5NVCUpv", "RT @AaronDFordNV: While speaking to residents of rural and frontier Nevada, one commonality I heard was the lack of, and grave need for, ho…", "Today was the perfect fall day for a hike up to the Goshute Mountain @hawkwatchint site. 🦅🥾⛰ https://t.co/li1saAKZkm", "RT @RobertGarcia: I want to highlight and thank my fellow @usmayors who for the last several months have been meeting, working, and advocat…", "RT @youngdems: 🌉Bridges - $40b\n⛑Safety - $11b\n🚌Transit - $39b\n🚅Amtrak/rail - $66b\n🔌E-Vehicle Chargers - $7.5b\n🛳Ports - $17b\n🛩Airports - $25…", "RT @AlexGoffNV: It was wonderful seeing everyone today at the @NV_Dem_Vets! Congrats to the fellow Horner award winners and Speaker @bbuckl…", "RT @AlexGoffNV: In addition it was an honor to receive a Congressional Commendation from @repdinatitus and a Certificate of Recognition fro…", "RT @RTCWashoe: Thank you @SenCortezMasto for your work on the bipartisan infrastructure bill for Nevada’s roads, transit, and the inclusion…", "RT @KarlCatarata: What is *out of touch* with Nevada voters are these ridiculous, misleading stretch of falsehoods via @amy4thepeople.\n\nSin…", "@80Data This idea that all members of the opposing party are bad so if you ever agree with even a handful on ANYTHING, is why Congress has such low approval ratings. When we’re able to provide historic investments like in BIF we should be proud that we did it with bipartisan support!", "Because making historic investments in critical infrastructure including replacing every lead pipe in the US &amp; ensuring every person in the country has access to safe &amp; clean drinking water is a bad thing… 🙄 https://t.co/MyGCtohKiE", "RT @ceanthony50: For more than half a decade, NLC and local leaders have called on federal leaders to \"rebuild with us!\" and to invest whol…", "RT @IrmaDiggs: In case you need a refresher on how the infrastructure bill now headed to President’s desk will help our nation’s cities, to…", "RT @leagueofcities: Did you just wake up? It wasn’t a dream! Infrastructure passed the House. Learn what it means for you! ⬇️", "RT @AlexGoffNV: Honored to receive the Horner award today. https://t.co/5A7FuQ6zz3", "RT @WhiteHouse: The Bipartisan Infrastructure Deal represents the most significant long-term investments in American infrastructure and glo…", "RT @MeghinDelaney: .@GovSisolak made sure we kickstarted funding into the State Infrastructure Bank in the 2021 legislative session. \n\nNeva…", "RT @OliverWDahl: One of my favorites—from my very first trip to Wendover. It was love at first sight.\n\nIncredibly grateful for @stevedampma…", "RT @SecretaryPete: It’s an extraordinary moment - and our team at @USDOT stands ready to get to work delivering these resources to create j…", "RT @SecretaryPete: With bipartisan support, @POTUS will sign into law the Infrastructure Investment and Jobs Act - the most significant inv…", "RT @RepShontelBrown: Proud to cast my vote in support of the largest infrastructure bill in decades on my second day as Congresswoman.", "This is a major win for communities across the country of all types &amp; sizes who have long been asking Congress to be a partner in rebuilding &amp; repairing our country’s crumbling infrastructure!! S/O to @IrmaDiggs &amp; everyone who worked tirelessly to get this bill passed!! /END", "Nearly three years ago I was invited by @leagueofcities to speak on a panel at the US Capitol on the desperate need for a bipartisan infrastructure bill. Today one finally passed &amp; is on its way to the president’s desk to be signed! 1/2 https://t.co/Y5aIiSpm8Q", "RT @SusieLeeNV: The House just voted to pass the Bipartisan Infrastructure Deal. Nevada will receive historic funding for:\n\n🛣 Roads and bri…", "It finally happened, INFRASTRUCTURE WEEK FINALLY HAPPENED!!!! 🎉🎉🎉🎉🎉🎉👏🏼 https://t.co/w9a4fp47m4", "RT @IrmaDiggs: Pinch me. Am I dreaming? Unbelievable. #InfrastructureNow https://t.co/BOMuGD6xYj", "RT @IrmaDiggs: 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽 https://t.co/7EaffRGoM5", "RT @BadFatBlackGirl: Just so we’re clear, this is a story is about the criminalization of poor people, and the specific criminalization of…", "@AlberiaMartinez ECSD is such a mess right now that, and I cannot believe I’m about to say this, I think that allowing the money to go to the county &amp; ECSD needing to work with the County Commission to receive those funds provide some much needed oversight &amp; accountability of the funds.", "ECSD hasn’t used funds responsibly over the last several years. In 2020 56% of voters rejected renewal of the .75 fee so ECSD is hoping to sneak through a .50 fee during a low turnout special election without addressing concerns about lack of oversight! I urge you to vote NO!/END", "Hey #ElkoCounty! Did you know there’s a special election on Dec. 16!? Mail ballots are going out now so be sure to fill yours out &amp; send it back in ASAP! There’s only one question on the ballot &amp; though I have been supportive of pay as you go funding for ECSD in the past.   1/2 https://t.co/8J5i1HfV2G", "@dichiaranv To be fair, they are probably the only enchiladas worth driving hundreds of miles for.", "Using only food, where did you grow up?\n#IYKYK https://t.co/Az1CSdzeMH https://t.co/9p3atOBdqc", "@zach_solomon1 @AlexODiazNV Sandoval won W. Wendover with 56.4% of the vote. Trump lost W. Wendover with 46.6% of the vote. Biden beat Trump here with only 47.8%. The Dem nominee for Gov in ‘14 only received 23.4% of the vote.\nFun fact: ‘20 was W. Wendover’s highest turnout election.", "Hey #WestWendover!! The JAS Foundation is now offering FREE COVID19 testing daily Monday-Friday 8am-2pm at the West Wendover Senior Center (1930 Plateau Way). To register to receive a test visit: https://t.co/KH9W2zoH2q", "RT @GregCasar: A better world is possible, if we fight for it. Organize for it.\n\nThat’s why I’m running for Congress. To stop the attacks o…", "RT @KalaniTissot: I am very excited to announce that Tissot Solutions LLC is starting the search for our 2nd Finance Associate. Do you know…", "RT @AlexGoffNV: Just received my booster shot of moderna. Thank you for a smooth process @WashoeHealth and @NVNationalGuard! The holidays i…", "RT @lpackard: Only one thing to say rn re:Virginia: I never signed up for Terry Mac's email list, &amp; yet I was bombarded with \"all hope is l…", "RT @KalaniTissot: Regardless of tonight's outcome, we have a LOT of work to do here in Nevada. 371 days to go!", "RT @wutrain: Thank you, Boston. 💜", "@ashleyvanorny Congratulations!!! 🎉🎊", "RT @LocalProgress: Congratulations to Local Progress Board Member @AttyStepMorales on her reelection as Commonwealth's Attorney in Portsmou…", "RT @LasVegasLocally: Under Nevada law, DUI resulting in injury or death is a Class B felony. Punishment includes 2 to 20 years in prison, $…", "RT @leagueofcities: NLC is proud to announce @hmcghee as a #CitySummit2021 speaker! Heather McGhee is the author of the NYT bestseller #The…", "RT @sahilkapur: .@lisamurkowski says she’ll vote YES to break a filibuster on the John Lewis Voting Rights Advancement Act.\n\nShe’s currentl…", "RT @AndrewJBates46: Wait, Republicans are now attacking us for stopping fentanyl trafficking?", "RT @WestLeaders: In honor of #NativeAmericanHeritageMonth we’re excited to host a webinar to highlight the leadership role Indian Country p…", "If you are 65+ or have a health condition that makes you more susceptible to the more serious side effects of COVID19 don’t delay, get your booster shot today! \n\nI just got my booster this morning &amp; the entire process took no more than 20 minutes!! https://t.co/LRnniD68oZ", "@cyclingutah Just above Liberty Lake in the Ruby Mountains", "RT @GovSisolak: Happy 157th birthday to the great State of Nevada! Today President Abraham Lincoln signed his pen to Proclamation 119, admi…", "If you don’t listen  @thekillers rendition of “Home Means Nevada” on repeat at least a few times today are you even celebrating Nevada Day!?!? https://t.co/h80bQHuT69 via @YouTube", "@PaprikaPink Thank you! It’s Liberty Lake in the Ruby Mountains.", "RT @Pres_Sandoval: Happy Nevada Day, Wolf Pack! Today, our Silver State celebrates its 157th anniversary of statehood. From the Sierras to…", "RT @MeghinDelaney: Five years ago, I had just flown into Vegas for the first time &amp; spent Nevada Day interviewing for a reporter job at the…", "Happy Nevada Day! There is no place on earth I would rather live than this beautiful state that we are so fortunate to call home!!! #HomeMeansNevada https://t.co/PyNrh3SUUT", "RT @calvertphoto: \"Way out in the land of the setting sun... https://t.co/2X0eDWFaOe", "RT @SteveSisolak: Helping Nevada families shouldn’t be a partisan issue.\n\nThat’s why my administration has prioritized getting folks back t…", "@ElliotMalin Sounds like the Senator had one too many Picons….", "RT @SteveSisolak: Celebrated Nevada with my friend, @Pres_Sandoval at the Nevada Day Parade.\n\nNevadans came out in force today in support o…", "RT @GovSisolak: From Ely to Vegas, NV is home to some of the West’s most iconic history. You can help preserve NV’s treasures by taking par…", "RT @leagueofcities: Cities, towns and villages across the country are ready to rebuild and recover from the impacts of the COVID pandemic.…", "RT @OliverWDahl: This was a real scene—a real moment in time. I asked nicely to take their photo and they let me. These scuba divers standi…", "RT @OliverWDahl: This photo + some text about Blue Lake makes up one of my favorite spreads in my WENDOVER photo book.\n\n4 days left to pre-…", "RT @GovSisolak: Returning from a one-year hiatus, First Lady Kathy Sisolak and I looking forward to hosting trick-or-treating at the Nevada…", "RT @ananavarro: I really don’t care who gets triggered by me bringing race into this. The truth is, no woman of color could possibly dress…", "RT @AlexGoffNV: I am so proud of my wife @RebeccaGoff85 and amazing friends who have made this list!! 1 more step to 20 under 40, but to ma…", "Two great Nevadans, two great Governors!! Love seeing @GovSisolak &amp; @Pres_Sandoval work together!! https://t.co/PojF53ewp5", "RT @NevadaAG: LANDMARK | Wendover Will took time out of his busy schedule as well to meet with the AG.  #AGFordRuralTour2021 https://t.co/r…", "It was great welcoming @NevadaAG @AaronDFordNV &amp; staff to #WestWendover today! Thank you for swinging by &amp; including our community as a stop on #AGFordRuralTour2021!! https://t.co/Z31RDrhqc5", "RT @OliverWDahl: Everyone say “howdy” to Wendover Will. 🤠\n\nThis is the photo I used as the cover for my photo book, WENDOVER.\nhttps://t.co/…", "RT @SteveSisolak: As a product of public schools, and father of two daughters who attended public schools, I know the value of high-quality…", "RT @AZCardinals: RT if your team is 7-0.", "RT @SteveSebelius: A man (allegedly) commits voter fraud, a felony. An investigation catches him having (allegedly) committed voter fraud.…", "RT @AaronDFordNV: Today, the @NevadaAG Office announced voter-fraud charges related to the 2020 election, where the defendant claimed someo…", "RT @mbforgey: How it started:                How it’s going: https://t.co/1K23J3Mo8c", "RT @lachicamayra: So it almost takes Latinas an additional year (10 months) to make what our white male counterparts make in a year... \n\nHa…", "RT @latinovictoryus: Today is #LatinaEqualPay Day, the day Latinas’ average pay catches up to what white, non-Hispanic men made last year.…", "RT @NanaTeacher22: You know this is starting to get a little unnerving. We've already lost one of the best superintendents we've ever had b…", "RT @OliverWDahl: Both the casinos and the bouncy house look like fun and require crossing a border/boundary to get to. For all their color…", "RT @OliverWDahl: In the middle of a mostly colorless desert, the bright, visual siren call of the casinos makes them look like a ton of fun…", "RT @OliverWDahl: (Gambling is illegal in Utah, but a few steps down the road, the law changes… and the casinos take advantage of this.) Thi…", "RT @OliverWDahl: Wendover is actually two different towns—one on each side of the Utah/Nevada state border. You can tell when you cross the…", "@ItsJustMarkNV A+ tweet.", "@kristiancarrnza Lance Bass!", "Colin Powell was a trailblazer &amp; a true statesman. Prayers to his family &amp; those that knew &amp; loved him, may he Rest In Peace. https://t.co/B31rc4W2Dt", "RT @TheBlackCaucus: We are deeply saddened by the passing of General Colin Powell, the first Black Secretary of State and the youngest Chai…", "RT @lvlcc: A new Stanford study has found that Latino-owned businesses contributed about $500 billion to the U.S. economy in annual sales.…", "Wishing @GovSisolak a quick recovery! Glad to hear that any injuries were only minor!! https://t.co/MwqS9cKhhJ", "RT @WhiteHouse: The cost of the Build Back Better Agenda is $0.\n\nThe President's plan won't add to our national deficit and no one making u…", "RT @GeoffRBennett: West Virginia as of 2019 had a child poverty rate of roughly 20% — with a national average of 9%", "RT @AZCardinals: You left the best receiver in the NFL open? 🧐\n\n@DeAndreHopkins x #RedSea https://t.co/xcgoIREjk5", "RT @asorellana: \"A candidate Republicans hope will help them retake control of the Senate next fall..Laxalt was in the unwelcome position F…", "RT @nowthisnews: Catherine Cortez Masto made history in 2017 when she became the U.S.'s first-ever Latina senator — now she’s using her pos…", "RT @OliverWDahl: Liminal spaces near the state border https://t.co/2lNJqLxuMz", "RT @LasVegasLocally: Nevada cannabis dispensaries sold $1,003,467,665 worth of marijuana products in the fiscal year 2021.\n\nClark County so…", "RT @DallasHarrisNV: Gabby Petito deserved better. I hope her family finds peace. \n\nSadly, the unrelenting rate of Indigenous women disappea…", "RT @GovSisolak: This is what Nevadans expected since the legalization of recreational marijuana. Education remains one of my top priorities…", "RT @AlexGoffNV: This Sunday is my 37th birthday!! Can you help me reach my fundraising goal and donate 37 dollars today?\n\nhttps://t.co/9oTX…", "RT @RalstonReports: News: Democrat @SenCortezMasto reports $3.15 million raised for her re-election in the third quarter, more than doublin…", "Happy birthday, @MayorSchieve!!! 💙🎉🕺🏻 https://t.co/ouqsPqspsK", "Meanwhile, West Wendover continues to have the lowest number of active cases in Elko County. It’s almost as if, and this might be a stretch here but hear me out, the infectious disease experts were right &amp; masks as well as vaccines actually work.….. 🙄🤦🏻‍♂️ https://t.co/kZ2RYeSdcw", "How cool is this!?!? Now everyone can have a little piece of Wendover in their home, no matter where you live!! https://t.co/D6eLkpTzU4", "Whether you’re an out or closeted LGBTQ+ person in our community know you’re seen &amp; loved, your life has value &amp; as long as I’m your mayor I will continue to fight with all that I have to ensure that West Wendover remains a safe &amp; welcoming place for you to live &amp; flourish!! /END", "&amp; authentically we will continue to celebrate LGBTQ+ representation. The difference between having LGBTQ representation in media, politics &amp; communities can quite literally be the difference between life &amp; death. That is why we celebrate #PRIDE, #NationalComingOutDay, etc. 3/4", "until the day that trans people especially trans people of color no longer have to constantly look over their shoulders with the fear of being brutally murdered, until the day that we can no longer be fired from our jobs or evicted from our homes for living openly 2/4", "In 2016 I became the first openly LGBTQ person in any city in Nevada to be elected to serve as mayor. This shouldn’t matter, but it does. Until the day that kids are no longer thrown out of their homes &amp; onto the streets because they want to live openly &amp; authentically, 🧵1/4 https://t.co/5lznPxmG6Q", "RT @GovSisolak: Today, we honor #IndigenousPeoplesDay2021 - recognizing the important contributions, rich culture and history of Indigenous…", "The weather app says it’s raining, it’s actually snowing. I guess our week of fall was great while it lasted… 🤦🏻‍♂️🥶 https://t.co/YCFZSz2SWh", "It’s #IndigenousPeoplesDay, so here’s your yearly reminder that ancient Indigenous civilizations were incredibly complex &amp; advanced. In fact the Iroquois Confederacy greatly influenced our current political system. \n\nAlso, the guy credited with “discovering” the Americas was 🗑. https://t.co/6sRhsfSpdf", "RT @LakotaMan1: Your daily reminder that Indigenous people predated Columbus by — wait for it — 23,000 years. #IndigenousPeoplesDay https:/…", "RT @GlynisOMeara: https://t.co/zJGGfJUI10", "RT @leagueofcities: Thank you @SecDebHaaland for the opportunity to share ideas for how @Interior can partner with local governments &amp; elev…", "@Ben_Kieckhefer Thank you for your service to our state, @Ben_Kieckhefer!!", "RT @brucefranksjr: Don’t tell me Black Lives Matter, Don’t just tweet Black Lives Matter \nShow me Black Lives Matter :\n\nDonate: https://t.c…", "RT @JulianCastro: I’m excited to announce that the second season of Our America premiers on October 13th!\n\nJoin me and @SawyerHackett as we…", "RT @JulianCastro: My thoughts are with the students, parents, and faculty at Timberview High School.\n\nThis violence is not inevitable. We m…", "@ZConine Thank you! Wouldn’t have been possible without all the help from you &amp; @ErikJimenezNV!!", "Stop by City Hall &amp; checkout the new DMV kiosk!! Thankful to everyone who worked with us I’ve over the last several years to finally bring DMV services to West Wendover!!! https://t.co/2ylW1aSv00 https://t.co/9E2jsMMK5R", "RT @themaxburns: The bigger issue with the Sinema bathroom kerfuffle is that Sinema's constituents feel this is the only way to reach her.…", "Both @SteveSisolak &amp; @CatherineForNV are ahead in their re-election races because Nevadans know we can trust them both to continue to lead us. Both have proven themselves as levelheaded pragmatic leaders who get things done &amp; Nevadans know it!!! https://t.co/40JuE2xUNE", "@48sonjia 💯", "It’s a beautiful evening to watch #SundayNightFootball &amp; enjoy great pizza &amp; beer on the patio at #FratelliWestWendover!!! https://t.co/irGfUgRs3p", "RT @rap_knewnie: oh my god its the first day of halloween i can finally post the most important video https://t.co/pObm8LHRSB", "RT @adamkotsko: $3.5 trillion over ten years = $350 billion per year. The population of the US is 329.5 million, so that means that the big…", "RT @ElliotMalin: Thanks for allowing me to share some thoughts, @rgj. \n\nVaccine and mask mandates are not like the Holocaust. Like, at all.…", "RT @areynarivarola: Ask yourself: what is your commitment to undocumented immigrants outside of research?", "RT @sandra4nv: https://t.co/GwPLqfc4Q3", "Both local papers have published negative things about me several times in the past. But you know what, when they reach out with questions I answer them. Because that’s what adults do. Either grow up or stop seeking public office if you can’t handle scrutiny, @AdamLaxalt. https://t.co/pFv7GUreAr", "@AlexGoffNV @RebeccaGoff85 Happy anniversary!!!! 🎉", "@AlexGoffNV Still waiting on that mixtape to drop tbh….!", "Obviously our end goal will always be a full service office so that folks no longer have to make the three hour trip to &amp; from Elko or Ely to obtain a drivers license or ID but, this kiosk is a major &amp; long overdue step forward for our community!!", "RT @IDoTheThinking: The Squamish Nation owns many parcels around Vancouver exempt from local zoning. With 87% of the nation voting in favor…", "After several years of hard work by so many people, West Wendover FINALLY has DMV services available in our community! You can now renew your registration, get a driver history report, get duplicate or replacement decals &amp; more at City Hall!! https://t.co/uPRjyynPzM", "RT @GovSisolak: We continue our work to vaccinate Nevadans against #COVID19.\n\nAs of today, the top 5 counties with Nevada resident-initiate…", "@tophatmichaels Took a 20 minute break from work to get it checked out and went straight back to work. 🤣 Luckily it doesn’t hurt &amp; I am able to keep to working!", "@Matt_J_Kimball Thank you!", "Last year I broke a toe while fishing so it’s only fitting that this year I’d break my thumb playing with Koopa. 😅🤦🏻‍♂️\n\nLuckily it’s a minor break &amp; only has to be in the splint for a couple weeks!! https://t.co/JN99GqxBhn", "As a teenager I worked at @MySmithsGrocery &amp; being able to make announcements over the store intercom was a major reason that I applied for the job! 😅 https://t.co/Gxl4mxVlAc", "@ElyseMonroy When you allow/have packaging that resembles kids favorite treats preventing underage use, either accidental or intentional, becomes that much harder!", "@ElyseMonroy I was amazed the first time I went into a dispensary in California &amp; saw the edible packaging. Luckily, Nevada has some of the best cannabis packaging laws in the country &amp; it’s for this reason.", "*Additionally\n\nThis is what I get for tweeting while walking Maxine &amp; Koopa. 😅🤦🏻‍♂️", "Additionaly thanks to @farley_pattie @tsegerblom &amp; others, Nevada has some of the best cannabis packaging laws on the books to prevent your little ghouls &amp; goblins from accidentally consuming an edible not just at Halloween but all year round. https://t.co/TdIu7XnPxY", "Edibles are expensive, I do not know a single person who would buy them to give to kids. Your kids are more likely to get into your stash than they are to get an edible from a stranger while trick or treating. \n\nKeep your cannabis products stored in a place that is out of reach! https://t.co/WHjBpe5YNU", "RT @LocalProgress: After 16 months of the pandemic, we need bold investments in our communities more than ever.\n\nWe’re excited to see @USPr…", "Happy #NationalVoterRegistrationDay!\n\n🗳️If you're not yet registered to vote, today is a great day to do so!\n🗳️If you recently moved, update your registration!\n🗳️If you're registered at your current address already, get a friend to register today!\n🗳️Visit: https://t.co/ClFFC49hYY https://t.co/Rt16aFDG61", "RT @jemelehill: This is who the NBA should get to talk to those player who remain unvaccinated. KAT has been through hell. Really wish this…", "We can do better, we MUST do better Elko County!! It is imperative that you don’t wait until it’s too late to get vaccinated to protect yourself, your loved ones, your neighbors or someone in our community you might not even know! https://t.co/x9psMC5z3R", "RT @tedlieu: Anti-vaxxers are getting out of control. If you are so sick with COVID that you need to be hospitalized, listen to the doctors…", "RT @SawyerHackett: More Texans under 60 died in August than any other month in the pandemic.\n\nMeanwhile the governor is focused on auditing…", "RT @RitchieTorres: Promoting peace between Israelis and Palestinians is the only way forward.  Calling Palestinians “a people from a fictio…", "RT @woodrumlaw: Please help my friend @AlexGoffNV by reporting this fake account if you're on Instagram: https://t.co/KMwZm8RUcb", "RT @GovSisolak: Kathy &amp; I join @SenatorReid &amp; the State of Nevada in mourning the loss of Major General Bob Herbert. He dedicated his life…", "RT @cityofhenderson: Our hearts go out to Major General Bob Herbert and his family. He dedicated his life to serving Nevada and the nation…", "@80Data Omg yes, just let me know when! (Minus making you carry my bag 🤣) I think everyone should make it to Liberty Lake at least one time!!!", "Did you take time to #GetOutside for #NVPublicLands Day!? It was a beautiful evening for a walk through the desert with Koop &amp; Maxine!! Happy Public Lands Day everyone!! https://t.co/bppEZVK3lc", "Uhhh that’s @Castro4Congress 👀🙃 https://t.co/man5ZqhPAJ", "RT @Joeingles7: 😂😂😂 ‘yeah a lot’ \n\nI’m dyinggggggggg @JordanClarksons", "RT @ZConine: One of my proudest achievements as your Treasurer is assuredly our achievement and consistent protection of Nevada’s highest-e…", "RT @MickyWhiteNV: It cannot be overstated what a significant accomplishment this is considering the financial hardships Nevada experienced…", "RT @GovSisolak: Today, Treasurer @ZConine &amp; I announced NV has received ratings upgrades from Fitch Ratings, Moody’s Investor Services, and…", "Happy birthday, @MeghinDelaney!!! 🎉🎊 https://t.co/Fi3vz3rnFr", "RT @SawyerHackett: Jfc. This isn’t about whips vs reins. It’s not even about the damn horses. \n\nIt’s about Haitians having to cross the bor…", "RT @JulianCastro: It’s baffling and disappointing that President Biden has not spoken out about the mistreatment and continued deportation…", "Wishing you a speedy recovery, @MayorSchieve!! Get well soon! 💙 https://t.co/nEfKLhHjB7", "We cannot just be outraged when things like this happen under Republican presidents we must hold @POTUS feet to the fire &amp; demand that our broken immigration system be overhauled! A good first step would be to #AbolishICE! https://t.co/tIBIXVquUL", "RT @SawyerHackett: Julián Castro, in April:\n\n“I'm hopeful that in short order the Biden administration will end Title 42, which has suspend…", "What an awesome opportunity for one young Vegas artist!!!! 👇👇👇👇 https://t.co/RJ8ojBPsiB", "RT @colinrobertson: Hey #Nevada! We got some good news recently and want to share it with you! #trails #outdoorrecreation #publiclands @Sen…", "@TheOnlyShadrach @VisitElyNevada This is fantastic!!! Congratulations!! 🎉🎉😃", "The #JASFoundation is hosting a @ImmunizeNV Vaccine Clinic at the W. Wendover Senior Center until 2pm! They have all 3 COVID vaccines available &amp; have been getting folks vaccinated &amp; on their way in under 20 minutes! If you’ve been waiting, today’s a good day to get vaccinated!! https://t.co/GHr6pZpkGs", "RT @colinrobertson: Hey #Nevada we need to get the best ideas for #outdoorrecreation projects in our state in this framework. Please the li…", "RT @SeriouslyJr: When you see and hear everybody now echoing @JulianCastro on immigration and Title 42. He told y’all before but some folks…", "RT @TheNVIndy: Nevada is preparing to resettle 50 people evacuated from Afghanistan in Southern Nevada and 100 in Northern Nevada as part o…", "“NV2: Reno and the Rurals” https://t.co/yY79YNMM7N", "RT @BenjaminPDixon: Just imagine he outrage had this been under the Trump administration. https://t.co/iMPWOSuxGH", "RT @PLANevada: It is unconscionable for the Biden admin to resume deportation flights to Haiti, despite the country's ongoing political &amp; e…", "RT @stew_boss: remember when Heller's position was \"I do back a woman's right to choose abortion. It is the conservative position.\" ? https…", "“Give me your tired, your poor, your huddled masses yearning to breathe free, the wretched masses of your teeming shore. Send these, the homeless, tempest-tost to me, I lift my lamp beside the golden door!” \n\nDo we no longer believe in the words etched into the Statue of Liberty? https://t.co/3ke7i8T6uB", "RT @LocalProgress: Seeking asylum is a human right.\nSeeking asylum is a human right.\nSeeking asylum is a human right.\nSeeking asylum is a h…", "RT @DemVictoryNV: Dean Heller is entering a civil war, but let’s be clear--he’s going into battle for himself, not Nevadans. Nevada rejecte…", "Nevada has no sanctuary cities.\n\nCRT is not taught in our schools. \n\nThere is no evidence of widespread voter fraud in the 2020 election. \n\nNo one is defunding the police. \n\nGovernor @SteveSisolak has handled this pandemic better than any of the GOP candidates for gov would’ve. https://t.co/KfaDbyPdH7", "RT @SenJackyRosen: Rep. Jim Bilbray was a Nevada treasure. His tireless commitment and devotion to public service was unmatched, and we wil…", "@DudeGoods @AZCardinals @amandaaalso Figured after that game Kyler Murray’s face would be seared into your memory… 🙄🤣", "Happy birthday @DudeGoods, sorry the Vikings had to lose to @AZCardinals today! 🤣🎉🎉🎉🎉 Hope @amandaaalso makes the rest of your day special!! 🎈🎁🎊 https://t.co/iXidPrj6vy", "RT @calvertphoto: For @TheNVIndy, I photographed Ryan Callahan and his mother, Kim. Ryan lives in a low-rent, communal home for people with…", "RT @formerpsaspy: While #GabbyPetito is trending, here is a thread of other people who are also missing in America.", "RT @ZConine: We had our 75th event today for the #NevadaRecovers listening tour. Originally we planned to do 75 events in 75 days, but the…", "RT @TheNVIndy: Outgoing Lt. Gov. @KateMarshallNV said when she got the call about her new White House role, she was stunned. It was Preside…", "RT @keyon: have you looked into the Hispanic scholarship fund?", "RT @SteveSisolak: Nevada is proud to welcome arriving Afghans home!\n\nOur state has always been and always will be a welcoming place for all…", "RT @natimontelongo: Happy birthday to one of the greatest bosses I’ve ever had, @JulianCastro. \n\nThank you for teaching me, and so many oth…", "@AlexGoffNV @WashoeDEMS If Space Whale ever ends up being moved your front yard is the perfect location to serve as its next home!!!", "RT @garymartindc: Nevada is expected to see 150 Afghan refugees and Biden administration prepares to resettle evacuees from that war-torn c…", "And on the first day of #HispanicHeritageMonth!!! Congrats, @sandra4nv!! #TheFutureIsLatina https://t.co/pOyGi9gIY7", "RT @SenCortezMasto: I'm proud to see many events celebrating Latino culture in Nevada during #HispanicHeritageMonth. As the first Latina in…", "RT @ARamosofficial: I don’t want to be hired for being [ethnically] ambiguous. I want to be hired for who the fuck I am. \nNosotros estamos…", "Thank you, @Pontifex! 🙏🏼 https://t.co/wjb9auThUl", "RT @Nicole4Nevada: At the start of #HispanicHeritageMonth, I want to celebrate Senate President Pro Tem @MoDenisNV. Mo has served at #nvleg…", "RT @slcmayor: As pleased as we were to be chosen as the host city for @LeagueofCities annual conference in November, I fully support switch…", "Wishing @Pres_Sandoval a speedy recovery! https://t.co/TJFCM7Lx9e", "RT @GovSisolak: I am so glad that @Pres_Sandoval is fully vaccinated against #COVID19 and is only experiencing very mild symptoms. \n\nThe va…", "Had 2018 gone differently Nevada would currently be going down the same path as Florida. However, thanks to @GovSisolak's leadership we are seeing groups/businesses, like the @Raiders, step up in a major way to get our state vaccinated! Keep up the great work, #RaiderNation!! https://t.co/txwbGllKDt", "Happy #HispanicHeritageMonth! I’m proud that I have the honor of serving the residents of #WestWendover, of which nearly 70% identify as Hispanic or Latino! This month we celebrate the many contributions our diverse community has/continues to make in betterment of our society! https://t.co/ov4l0ZV1aG", "RT @JulianCastro: Happy #HispanicHeritageMonth!\n\nThe destiny of our nation is intertwined with the destiny of the Latino community like nev…", "RT @lachicamayra: Happy start of #HispanicHeritageMonth!\n\nLet this month be the push you needed to support your local Latino author, try ou…", "RT @DentzerNews: Reno man accused of making death threats, racial smears aimed at lawmakers on Twitter, charged with aggravated stalking ht…", "RT @CatherineForNV: I’m thinking of all the proud Latinos and Latinas who helped pave the way for me to become the first Latina Senator. I’…", "RT @latinovictoryus: 🚨ENDORSEMENT ALERT🚨: We are proud to endorse Senator Catherine Cortez Masto—a dedicated leader &amp; champion for Nevadans…", "RT @MayorSchieve: Come have lunch w me today at one of my favorite lunch spots @suprestaurant 11a-12p. The first 30 guests who get vaccinat…", "RT @GovSisolak: Today marks the first day of #HispanicHeritageMonth, a time to celebrate the profound impact the #Latinx community has had…", "RT @JulianCastro: Congratulations to Governor @GavinNewsom and the people of California on defeating the recall.\n\nCalifornians showed up to…", "Vaccine requirements are helping encourage folks who’ve been putting off getting vaccinated to finally get vaccinated! Good job, @Raiders! Grateful to @GovSisolak’s leadership in giving venues the option to go maskless if they require proof of vaccination!!! https://t.co/zEGDaWjcTm", "@GovSisolak @BaileyBortolin Congratulations @BaileyBortolin!", "RT @EmergeNevada: 🎉 Congratulations to the Emerge Nevada Class of 2021! 🎉 We are so proud of you and cannot wait to support you when you ru…", "RT @NanaTeacher22: OK twitterverse - especially those with New Jersey or New York experience.  My husband and I are traveling to Asbury Par…", "Congratulations to all of this year’s @EmergeNevada graduates! Can’t wait to see all that you each accomplish &amp; to support each of you once your name is on the ballot!!!!", "RT @AliciaOnMSNBC: \"I have been undocumented for almost 30 years at this point...\nMy entire life depends on these next few decisions... Now…", "RT @Reach4ACopsGun: In June 2001, Konstantin Petrov, an immigrant from Estonia, got a job as an electrician at the restaurant atop the nort…", "RT @NBCNews: FULL SPEECH: Former President George W. Bush speaks at the Flight 93 National Memorial in Shanksville, Pennsylvania, on the 20…", "RT @danielrothberg: I remember every moment of 9/11. When my parents turned on the news that morning, I knew something was wrong even befor…", "RT @ABCNewsLive: AMERICA REMEMBERS: A moment of silence is held at 8:46 AM, the time that American Airlines Flight 11 crashed into the Nort…", "Senior Center Director/Mayor\n(Anyone who has attended/watched a city council meeting will probably tell you I still talk too much. 🤣🤷🏻‍♂️) https://t.co/M6r5xEg4Hd", "NV is a better place because of @LGKateMarshall’s service &amp; our country will be a better place because of her service in the Biden Administration. Godspeed, Kate.  NV will be ready to welcome you back with open arms when you’re done serving our country! #HomeMeansNevada 💙 /END", "It would’ve been easy for Kate to go on with her life &amp; forget that child. But that’s not the type of person she is, it’s not the type of politician @LGKateMarshall is. She is a compassionate leader who deeply cares about the work of improving our collective quality of life. 3/4", "Over the course of several weeks we worked to get the child a spot in the classroom. @LGKateMarshall called or text me nearly everyday for an update. Eventually, we were able to get the child a spot. 2/4", "🧵: @LGKateMarshall visited West Wendover while she was campaigning for LG in 2018 several times &amp; during one of her visits Kate &amp; I met a young mother who was worried because her 4 year old was put on a waitlist for pre-k &amp; she felt he was already behind his peers. 1/4 https://t.co/7UM8VHGp9T", "RT @GovSisolak: I will remain grateful for Lt. Governor Kate Marshall's service &amp; her steadfast leadership to the Silver State. From expand…", "RT @MichelleRindels: .@LGKateMarshall is tendering her resignation to the governor, effective 5 p.m. Sept. 17, saying she has \"the honor to…", "RT @Jammin27Ben: Thank you Mayor @DanielCoronaNV for your strong leadership! I’m proud to have you along with us on this fight for a pathwa…", "I’ve long said that Obama’s 2012 &amp; @KateMarshallNV’s paths to victory in 2018 should serve as the roadmap that every statewide dem candidate follows. That’s how we avoid upsets like 2014 when Laxalt lost Washoe &amp; Clark but won with a big enough margin in the rurals to become AG. https://t.co/aDVFVXrJTO", "@MelanieScheible Yay!! Let me know when you start knocking doors, I'll come down &amp; make a weekend out of it! 😃", "Six Elko County schools have now been deemed as having an outbreak of COVID19 cases. Sadly, until more people get vaccinated &amp; start masking up this is only the beginning of outbreaks in our schools. We have a clear path to ending this pandemic, but we all must do our part!!! https://t.co/w5gZ0gb09I", "RT @chrislhayes: Just gonna throw this out there because, again, I feel like I'm losing my grip on reality but for private sector worker su…", "I’m not sure that wanting to “gut” the agency tasked with protecting workers from dying or getting severely injured as a result of doing their job in an unsafe environment is the flex @RepCawthorn thinks it is… https://t.co/g8WF1FchRr", "RT @YvannaCancela: Decisive leadership. That’s @GovSisolak. Team’s working on it as I Tweet!\n\nGrateful for a Governor that always puts the…", "RT @MercedesLV: Did my dad help you on September 11, 2001? If so, I'm trying to find you. (a thread)\n\nOn September 11th, 2001 my dad caught…", "On behalf of my constituents, I am urging Congress to deliver a path to citizenship for millions of immigrant #EssentialWorkers who helped care for our communities throughout the pandemic! #WeAreHome https://t.co/b1lEslPRuE", "RT @meganmesserly: Realized something sad writing this week's \"Coronavirus Contextualized.\"\n\nRural Nevada makes up 11 percent of the state'…", "RT @elizaorlins: In case there was still any question as to whether we were in The Bad Place…", "Once Nevada’s public option is in place thousands of Nevadans for whom affordable healthcare would otherwise be unattainable will FINALLY be able to access quality care at an affordable price! Governor @SteveSisolak &amp; @Nicole4Nevada’s leadership will almost definitely save lives! https://t.co/XpOuy4TbFI", "@amandaaalso @DudeGoods You &amp; @DudeGoods both have jokes tonight I see… 😅🤣", "@amandaaalso @DudeGoods Well if you wouldn’t have taken her to the other side of the state…. 🙄😒😅", "Just had our first soccer practice, my team is pretty dang good already (no thanks to me). Probably a good thing @DudeGoods ended up not coaching &amp; our West Wendover/Henderson 5-7 rivalry ended before it began, we would’ve crushed those kids! 😉🤣⚽️ https://t.co/2QqI5qhmM9", "One mayor is heads &amp; shoulders above everyone else (just maybe not physically) &amp; that is @MayorSchieve! It’d be hard to find any mayor who has led their city better &amp; not just only over the last 18 months but also over the last several years! Reno is lucky to have her!!! https://t.co/7bVcmhEgtX", "RT @KateMarshallNV: Getting to YES by working together - In Ely we got to YES ON BOOKS!  #readinginspires  Books by the Ton flood White Pin…", "RT @AlexODiazNV: Notable Mexican Supreme Court rulings:\n\nJul 2015: Legalizes Gay Marriage\nJul 2021: Decriminalizes Marijuana\nSep 2021: Decr…", "RT @AaronDFordNV: Read something recently about a Nevada US Senate candidate threatening to sue over the 2022 elections before they even oc…", "Nothing like the Tuesday after a holiday weekend to make you long for the weekend! \n\nHere are a few pictures of Koopa &amp; Maxine at the lake this past weekend to help ease those Tuesday afternoon blues!! https://t.co/zeG1DtPO5V", "RT @DemVictoryNV: A federal judge, the NV Supreme Court, and Nevada's GOP Secretary of State already rejected Laxalt's Big Lie about the 20…", "RT @naijaluv409: Thrilled to have the chance to chat with Sam Shad on @NVNewsmakers  about @youngdems, how we build community, and the impo…", "RT @NVNewsmakers: Great to have @naijaluv409 on the show! Watch this great conversation right here: https://t.co/iZ31iJXCAY", "Very smart of @NVNewsmakers to get on the @naijaluv409 train early! Nnedi is the future of the Democratic Party here in NV &amp; nationally, take the 30mins out of your day to watch this interview!! 👇👇 https://t.co/g1k77zRYw6", "RT @DrugPolicyOrg: Good morning. End the drug war.", "RT @Blackamazon: Before you demonize addiction, before you spit a hot take . \n\nStop. Please .", "RT @Sifill_LDF: This framing is so disappointing. “Red &amp; blue states moving in opposite directions.” “Some tightening…some loosening.” No.…", "RT @USConst_Amend_I: I protect you from the government, not from GoDaddy https://t.co/gjgj3cLntb", "RT @AlexGoffNV: Thank you to my brothers and sisters in the labor movement that fight for fairness and dignity at work everyday. Enjoy this…", "@AlexODiazNV It only took them 4 years of begging the county &amp; the threat of working towards becoming an incorporated city for Elko County to finally allow it to happen! Excited for the town of Jackpot to finally get this economic boost to their community!!", "RT @ZConine: As we left, Debbie was talking to other patrons and sending them to https://t.co/OLfGq6GWko\n\nWhen we say every Nevadan… we mea…", "RT @AlexODiazNV: Nevada Rural Precincts that voted for Biden in 2020, and are NOT Native reservations.\n\n1. Silver City, NV\n2. Jackpot, NV\n3…", "RT @DrGJackBrown: BREAKING: GoDaddy is going to discontinue Texas abortion snitch website off of its service in less than 24 hours.", "@BuzzIzarownd @AlexODiazNV As far as I know West Wendover was the only city in Elko County to go blue in the last few elections.", "RT @AlexODiazNV: In 2016, @DanielCoronaNV became the first LGBTQ and Hispanic mayor of West Wendover, Nevada. West Wendover is a small town…", "RT @SteveSisolak: Some good signs our economy is getting stronger every day:\n\n✅ Gaming revenue has shattered pre-pandemic records month aft…", "RT @LGKateMarshall: Libraries opened doors for me as a child. Today, our libraries do the same for Nevadans. They play a key part in our fu…", "RT @KateMarshallNV: Support in Nevada for safe and legal abortion has always been strong, and remains so today.  Women can and should be ab…", "Thank you @ZConine &amp; @GovSisolak for traveling the state to ensure that EVERY Nevadan, no matter where they live, has the opportunity to be heard! If you have thoughts on how the state can spend its $6.7billion in ARP funds submit them at: https://t.co/Pqi83MKByj https://t.co/NaAFAdBfkL", "@Madeline_Burak @ZConine @ErikJimenezNV Was so great finally meeting you face to face!!! Thanks again for making the trip to #BestWendover, hope you have safe travels!!!", "RT @Madeline_Burak: And that’s a wrap on day #2 of the rural #NevadaRecovers tour! Thanks to @DanielCoronaNV for joining @ZConine, @ErikJim…", "@jazmin1orozco Odeh’s is definitely an underrated gem!! Welcome to Elko County!", "Welcome to Elko County, @jazmin1orozco! I’m positive that with all the madness going on at county commission &amp; school board meetings lately you will have no shortage of stories! https://t.co/5I6qwal03S", "RT @jbouie: deputizing citizens to suppress the rights of other citizens while courts say “our hands are tied if private citizens are suppr…", "RT @MickyWhiteNV: Tonight I’m grateful to live in NV where we value a woman’s right to reproductive freedom. But I mourn for the women in s…", "RT @KSVesq: You’re sitting in the waiting room for your 12-week scan. It’s your third baby. Very much wanted by a loving family. Very much…", "RT @ZConine: Thanks to Mayor Stone from @WinnemuccaNV, members of the Humboldt County Commission and so many community members for joining…", "RT @MichaelDTubbs: You hate to say it but @HillaryClinton was right about Russia, about the Supreme Court, about all that was and is at sta…", "RT @POTUS: Texas SB8 will impair women's access to health care and, outrageously, deputizes private citizens to sue those they believe help…", "RT @MadonnaLong: stop the damn surge get vaccinated💉 wear a 😷mask and protect someone. Be hero", "RT @wildwestfund: Lots of abortion fund requests this morning, and we’re planning on fulfilling all of them. Please make a donation to help…", "RT @NVHealthRespon1: Take a look at the latest Nevada county mask guidance. All counties in Nevada with a substantial or high transmission…", "@amandaaalso @DudeGoods Now how are we going to start the greatest in state little league soccer rivalry in modern history!?!? https://t.co/LAkPGGy8kL", "@ErikJimenezNV Koopa ate my wallet for breakfast this morning, hope you’re prepared to also leave West Wendover with a dog…. 🤣", "RT @uwnns: Volunteers are needed to support #CaldorFire evacuee shelter operations with the @RedCrossNevada💛 Please consider donating your…", "RT @RepSusieLee: I support choice.\nThe majority of Nevadans support choice.\nThe majority of Americans support choice.\n\nThe law that just to…", "RT @TheOnlyShadrach: 1.8 acres burned in Baker, NV. City of Ely Fire, BLM, Baker, and Park Services responded to a structure and vehicle on…", "RT @MichaelDTubbs: Gilead wasn't built in a day.", "RT @SophieNovack: 🧵 As Texas 6-week abortion ban goes into effect today, some context on the reproductive health landscape this is occurrin…", "RT @NVNationalGuard: GOV. SURVEYS CALDOR FIRE: Gov. Steve Sisolak and Adjutant General MG Ondra Berry flew aboard a ⁦@NVNationalGuard⁩ Blac…", "RT @wildwestfund: And we’re NV’s sole abortion fund. We’re here to help, and we aren’t going anywhere.", "RT @ananavarro: TX Republicans think masks and vaccines violate their right to control their bodies, but allowing anyone to sue an Uber dri…", "Grateful that while some weaponize their religion there are religious leaders, like @RebbeSMZ, who are working to ensure safe access to healthcare for women during this incredibly dark time! Women should NEVER be forced to sneak out of state to access an abortion!! https://t.co/mcE1ED1FhT", "Also if you are, like me, someone who would never have to make the extremely difficult choice to seek an abortion (i.e. cis-male) your opinion on abortions is invalid. More of us need to take a seat &amp; stop trying to tell others what they can/can’t do with their own body! https://t.co/9MyzILVRFM", "RT @TheOtherMandela: Most women don’t even know they’re pregnant at six weeks. What’s happening in Texas is abhorrent. Abortion is health c…", "Abortion bans don’t lower abortion rates, they increase rate of unsafe abortions. \n\nWant to actually lower abortion rates without risking women’s lives? Make contraceptions free for all &amp; teach comprehensive sex-ed in every middle school &amp; high school in the country.", "RT @alexismcgill: To be clear: Planned Parenthood health centers remain open, and we are here to help Texans navigate this dangerous law. W…", "RT @laurenthehough: Just an FYI because my mom didn’t know so I assume someone else doesn’t: if you’re immunocompromised, you can schedule…", "@MayorSchieve @AlexGoffNV You are too kind. ☺️ I guess I’ll let Alex off the hook… this time! 😅\nHope you are doing well my friend! 💙", "@AlexGoffNV @MayorSchieve Umm….. are we going to talk about the “My favorite Mayor” comment….? 🙄\n\nFor the record @MayorSchieve is MY favorite mayor so I get it. It still hurts for you to break the news to me in this way, Alex….. 🤣", "RT @MayorSchieve: This is a great resource of our hotels offering rooms. #caldorfire ⁦\n@renotahoe⁩ is here to assist. We have opened up our…", "RT @NorahODonnell: Biden details human and financial costs of war in Afghanistan: \"I refuse to continue a war that was no longer in the ser…", "RT @JoshEdelson: The #CaldorFire today took many homes, sent tens of thousands of fleeing evacuees into a crazy gridlock traffic jam and ev…", "RT @CityofReno: Looking for info about the #CaldorFire?\nIncident &amp; Evacuation Updates:\n   NV: @NVEmergencyMgmt\n   CA: @CALFIREAEU\nRoad Clos…", "RT @danielrothberg: Gov. Sisolak holding a press conference on the #CaldorFire after a briefing this morning with members of Nevada’s feder…", "Anyone feel that earthquake!?!? Usually I’m pretty sensitive to them but didn’t feel this one! https://t.co/foNhl69kfB", "RT @NOAASatellites: This current view of the southwestern United States, brought to us via the #GOESWest 🛰️, shows thick #smoke plumes eman…", "RT @Ben_Kieckhefer: For folks back east trying to understand the scope of the #CaldorFire ... 191,607 acres is almost exactly 300 sq mi. Th…", "Signed up to coach 5-7 year old soccer this season, I am a soccer novice but my niece wanted to play &amp; they were two coaches shy of being able to have a season. First games are in two weeks, I'm off to watch every soccer movie I can find to prepare! 😅😅 https://t.co/NJR2QRZeqC", "RT @MayorSchieve: I love these peeps. Give them a follow to help with random acts of kindness. #caldorfire\n🙏💔", "RT @HistoryNevada: The very first \"Google doodle\" appeared on https://t.co/o4mIWNtiZW on Aug 30, 1998 with a simple Burning Man logo behind…", "RT @JohnMiddlekauff: Surreal video from a buddy. Tahoe in major trouble - Firefighters are certified badasses https://t.co/i6rXXxb6iK", "RT @nevadadot: Keep updated on #CaldorFire Nevada highway closures by also following @nevadadotreno.\nHighway conditions: https://t.co/xDLCL…", "RT @TheOnlyShadrach: WHITE PINE COUNTY NEWS- White Pine school district has moved from optional mask recommendations to a mandatory mask po…", "RT @MayorSchieve: Grateful to the men and women from all jurisdictions helping to assist #CaldorFire \nThese scenes are truly heartbreaking.…", "RT @MickyWhiteNV: .@CountyofDouglas update re: #CaldorFire ⬇️", "RT @MayorSchieve: Reno Sparks Convention Center @ 4590 S Virginia St is now open for #CaldorFire evacuees with limited capacity for pets. I…", "The images coming out of Tahoe are absolutely heartbreaking, praying that the brave firefighters battling the #CaldorFire are able to get it under control soon! Evacuation warnings were expanded this morning, if you’re under a warning please get an early start &amp; leave ASAP. https://t.co/MFr0GIQfls", "RT @tahoefire: UPDATE EVACUATION WARNINGS 🚨 Please be prepared and stay alert https://t.co/pQkhSdtamf", "RT @ChiefDave_RFD: Crews continued to work overnight on the #CaldorFire Here personnel are doing structure protection at the Echo Summit Lo…", "RT @WhiteHouse: U.S. service members have officially completed the largest non-combatant evacuation in U.S. military history – evacuating m…", "RT @AlexGoffNV: There is so much stress on our region right now. I just hope for health and safety for all of our residents. May those who…", "RT @blkahn: In California, fire conditions are so intense that they are once again spawning firenadoes. This is from the Chaparral Fire bur…", "RT @danielrothberg: CalFire Chief confirms that the fire is in the Tahoe Basin", "RT @NVconservation: ICYMI: West Wendover Mayor @DanielCoronaNV joined several mayors from across the Intermountain West for a climate crisi…", "RT @YoungDemsNV: Join @YoungDemsNV in welcoming our new President Susan Florian. We are excited to have her take on this role at a pivotal…", "RT @NorahODonnell: BREAKING: The U.S. has completely withdrawn from Afghanistan. The last C-17 lifted off at 3:29 pm ET.", "A heartbreaking story that has become all too common. A few weeks ago an older lady came into the Senior Center needing help to find a place to live, she became unhoused for the first time in her life after her landlord in SLC evicted her at the first opportunity they got. https://t.co/wp2JK95lzD", "RT @brianduggan: If you haven’t already, get out of South Lake Tahoe NOW.", "RT @talkspace: Today is National Grief Awareness Day. While #grief is a common human emotion, it's complicated &amp; can be hard to manage on y…", "RT @SteveSisolak: With unemployment dropping, kids in the classroom, and more than 3 million shots in arms, we’re going to keep moving forw…", "RT @SteveSisolak: Nevada is one of the states being targeted by Trump’s PAC in 2022. Republicans will stop at nothing to try to slow our pr…", "Great piece by @80Data on @TheNVIndy website this morning!! Take a minute or two to read it, America is not dead.…. yet! https://t.co/RWSRg2jlQx", "Happy first day of school WWES, WWMS, &amp; WWHS!! I hope that you all have a great first day back &amp; a productive year of learning ahead of you!! https://t.co/PIbp2YvpeT", "RT @LeesDiscountLiq: Lee’s Discount Liquor is saddened to announce the passing of Hae Un Lee, better known as Mr. Lee, the founder of Lee’s…", "\"The proposed multistate settlements would be a bad deal for West Wendover as well as the state of Nevada,\" West Wendover Mayor Daniel Corona said. https://t.co/tyVZSd99LB", "Mr. Lee was the personification of the American Dream, an immigrant from South Korea who became one of the most prominent business leaders in Nevada. Today is a sad day for anyone who was fortunate enough to know him &amp; for our state, we have lost an incredible Nevadan. May he RIP https://t.co/kMZ8UQPCx8", "@AudreyStJames1 Koopa on his way home from the shelter after being in there for nearly seven months! Shelter pets are usually make for the most loving &amp; loyal pets!! https://t.co/mGdLVsLpOv", "@Donna_West I’m in Sparks", "RT @BaileyBortolin: Tell people not to give up. We can make tenants &amp; landlords whole and help everyone move forward. \nThere is legal assis…", "RT @BaileyBortolin: @GovSisolak, the legislature, and the Courts forged a path forward to ensure that families have a route to stay and res…", "RT @BaileyBortolin: While this is disappointing, Nevadans should not panic. We have a plan: Apply for rental assistance, respond to all evi…", "Last night the conductor of a passing train laying on the horn woke me up at 4am, today it was a police officer banging on my hotel room door to tell me the passenger window of my car had been busted out. Luckily nothing was stolen from what I can tell, but come on!!! 🤦🏻‍♂️😡", "RT @JamesSurowiecki: On October 23, 1983, a terrorist drove a truck filled with explosives into Marine HQ in Beirut, killing 241 Marines. T…", "RT @oneunderscore__: A quick thread:\n\n\nA lot of people have asked me this week: Where did this ivermectin obsession come from? Who could po…", "Don’t talk about addiction in a way in which someone struggling with addiction will be afraid to come to you for help. Addicts are neighbors, friends, family members, etc &amp; if we continue stigmatizing addiction to the point that folks are uncomfortable seeking help, they won’t. https://t.co/aMsCXM0Ltv", "RT @ZConine: This screen capture adequately captures most of my day.\n\nJokes aside, always a pleasure to speak to the League of Cities to di…", "Great to hear from @NVTreasurer @ZConine on the #EveryNevadanRecovers framework &amp; the work that the state is doing to solicit feedback on how Nevada can best utilize ARPA funding. Visit https://t.co/Pqi83MKByj to submit your ideas! https://t.co/UEl75N94k6", "Congratulations @CJBear71, @SteveYeagerNV, @PeteGFacts, &amp; @NatalieYanish!! All four are true public servants in every sense of the term &amp; incredibly deserving of the awards they received this afternoon!!! https://t.co/n9tRNgEFho", "And because this app never has enough dog pictures here’s my favorite pictures of each Maxine &amp; Koopa. #NationalDogsDay https://t.co/zxnFgsfNTw", "It’s #NationalDogsDay &amp; sadly I don’t get to be home to spoil my two favorite rescue pups! It’s okay though because I think they are spoiled enough every other day anyways! 🤣 https://t.co/HbNVLiEQjv", "Obligatory smoke picture of Reno/Sparks. This extreme fire season should be a wake up call for us all, if we don’t address the climate crisis immediately fire seasons like this WILL be our new normal! #ClimateActionNow https://t.co/JaEL8AICT3", "RT @CullenMiguel: “At the end of the day, [Nevadans] put aside the partisanship and say what are we going to do to make it work? And I hope…", "Taking the Public Official of the Year trophy on one last road trip before it goes to this year’s winner later this week at the Nevada League of Cities &amp; Municipalities Conference in Sparks! Excited to see city leaders from across the state after nearly two years apart!! https://t.co/T5Ai50v2bk", "RT @AaronDFordNV: Proud that my decision has the support of several local governments, including Clark, Douglas, Humboldt, Mineral and Wash…", "RT @votolatino: Tonight's decision by the Supreme Court is sickening. The Biden administration was correct in ending \"remain in Mexico.\" No…", "RT @lindacavazos13: No warnings on Thursday. Wear a mask correctly, or you don’t come in. Period. Heckling and harassment will NOT be toler…", "Finally a step in the right direction! Grateful to Trustees Dastrup &amp; Wines for their leadership especially while facing loud opposition, I know it’s not easy!! https://t.co/a1WPc8eIpp", "@HeidiAnnSwank It’s already hard enough, once word gets out about how terribly the region has handled the pandemic it’ll be next to impossible for us to find good providers! Wish more of our electeds understood this &amp; would start making the difficult decisions needs to get us through it!! 🤦🏻‍♂️", "Koopa, who had to make sure that he was seen several times during the fundraiser, is also fired up and ready to help get @AlexGoffNV elected to the Assembly! https://t.co/BQPZASEwgP https://t.co/5EFNf5Iqwq", "It was my honor to join one of my best friends, @AlexGoffNV, for the first fundraiser of his Assembly campaign tonight! Alex is an incredible person who deeply cares about his community &amp; I cannot wait to head to Reno to knock on doors in the spring to help get him elected!! https://t.co/Is8gCSSaEl", "RT @Donna_West: It was great to join friends in supporting @AlexGoffNV at his first fundraiser for #nvleg Assembly https://t.co/0iqyI0tOkB", "RT @AaronDFordNV: This is such a sad commentary. Hate to see it. I pray for Nevada.", "@sodergrengirl Exactly! That is why we have been very clear since day one in West Wendover that we’ll trust the experts and make the decisions, even the difficult ones, that ensure we’re doing everything we can to protect the public health!", "That same commissioner told a councilmember, in response to being confronted over refusing to wear a mask in our facilities, “we all have to die one day”. Sadly as long as this “leadership” stays in place things won’t improve in the majority of Elko County. 2/2", "Recently West Wendover hosted a county commission meeting at City Hall, before the meeting commissioners were informed that West Wendover requires masks in public facilities per guidelines. Two commissioners refused to show another flat out refused to put one on. 1/2 https://t.co/qyJyagTgRf", "RT @AlberiaMartinez: Our hospital sent this out today. @RalstonReports @TheNVIndy @jacobmartinez85 https://t.co/Y9Lz95wHEK", "RT @GovKathyHochul: Today we mark the 76th birthday of Marsha P. Johnson, the transgender New Yorker who helped launch the modern #LGBTQ ri…", "RT @MichelleRindels: Nevada, which has had the country's only female-majority Legislature for the past several years, has never had a woman…", "https://t.co/JB9CDqzsRC https://t.co/BT0XI5LizH", "RT @RepSusieLee: Nevada was hit hard by this pandemic.\n \nThat’s why I just voted to move forward with the budget resolution. Combined with…", "A thread for anyone who thinks West Wendover “needs” a big box store… These stores often come at a hefty price to taxpayers &amp; many don’t pay living wages. Instead we should focus on lifting up small businesses, which have a more positive impact on the local economy! https://t.co/tbPzw6DCpw", "RT @RalstonReports: Breaking, via @s_golonka -- \n\nNevada to Pharma:\n\nHere is our offer:\n\nNothing!", "RT @AndrewJBates46: New: Roughly 21,600 people were evacuated from Kabul between 3 AM EDT on 8/23 and 3 AM EDT this morning.\n\nSince 8/14, w…", "RT @theebillyporter: #Transgender is trending just in time for Muva #MarshaPJohnson's Birthday tomorrow. Remembering this strong and beauti…", "RT @BenMargiott: Breaking: New employees at the @CityofReno will have to be fully vaccinated against #COVID19. New policy goes into effect…", "RT @NVTreasurer: 🎨CONTEST ALERT🎨\n\nWe will deposit prize money into the college savings account of our lucky winners! Find out how you can e…", "Already setting himself up to cry “fraud” when he loses to @CatherineForNV next November! 🙄🤦🏻‍♂️ https://t.co/nk4ukkzbuN", "RT @ASlavitt: BREAKING: After reviewing 340,000 pages and record amount of data, the FDA has given full approval to the Pfizer vaccine.", "If you were waiting on FDA approval to get vaccinated, the wait is over! Pfizer now has full approval, go get vaccinated!! https://t.co/jI2tKpnptG", "@amandaaalso He &amp; Max want their Aunt Amanda &amp; cousin Swayze to come visit them! 😉😅", "RT @SenJackyRosen: I had a great time at the White Pine Horse Races meeting with Mayor Robertson, the leadership of KGHM Robinson, and the…", "RT @BattleBornProg: “If I don't get elected because I support masks and vaccines, then so be it ... For me, it's really about protecting pe…", "You would think after more than a year and a half I’d be used to the DMs I get several times a week asking me if my last name is REALLY Corona or if I’m trying to pull some kind of gag, there’s nothing funny about COVID19. Get vaccinated so that we can get back to the beer jokes! https://t.co/zAEq5PESgR", "RT @Strandjunker: Don’t know who needs to hear this, but the new ruler of Afghanistan was in prison until Trump released him and 5,000 elit…", "Good morning! 🐶😍 https://t.co/dv3RkeQAT2", "RT @ceciaalvaradoNV: I pray for more leaders like  @BrittMiller4AD5. You listen and take action. We 💗appreciate you. https://t.co/AvWVBt7XUZ", "RT @elizaorlins: Remember the “this is your brain, this is your brain on drugs” commercial?\n\n@DrugPolicyOrg’s updated one which shows how t…", "RT @PLANevada: Immigrants are:\n🤝Our friends\n👨‍👩‍👦 Our families\n🏡Our neighbors\n💼Our coworkers\n❤️Our community\n#WeAreHome", "RT @KateMarshallNV: Books! Books! Books! For kids in Ely.  Thank you ⁦@ThePEFtoday⁩ and ⁦@TheOnlyShadrach⁩ #readingisgood https://t.co/AvMW…", "RT @OhTayCanYouSee: Just began to process the news that actual human trials for an HIV vaccine started yesterday and honestly I am a bit em…", "RT @NVconservation: 🚨JOB ALERT: We’re hiring for a national monument campaign manager who wants to help drive the campaign forward to estab…", "RT @jacobsolisnv: As a coda today’s Board of Health vote, @GovSisolak announces he’s signed the emergency regulation mandating COVID vaccin…", "RT @BenWinslow: BREAKING NEWS: @BYU announces it will require masks in classrooms. #utpol #Utah #COVID19", "RT @jacobsolisnv: NEW: The state Board of Health votes unanimously to approve a COVID-19 vaccine mandate for @NSHE college and university s…", "RT @SawyerHackett: Sec. @JulianCastro lays out the hypocrisy of Gov. Abbott in 90 seconds.\n\n“Of course he’s not worried about the coronavir…", "RT @SteveSebelius: You know who didn’t make “offensive comments” on a podcast? @levarburton! No need to restart the host search @Jeopardy!…", "RT @RalstonReports: Washoe County Chair @BobLuceyNV:\n\n“Go get vaccinated, and here's why. But not, ‘mask-up.’”\n\nReno @MayorSchieve:\n\n“If I…", "RT @RubenGallego: Mo, let me tell you from experience. Car bombs don’t discriminate between Democrats and Republicans. Any type of encourag…", "RT @CullenMiguel: “It’s impossible to convince her to put a file in the drawer and give up because, to her, she knows that behind every pro…", "Just took Koopa with me to pick up Maxine from my mom’s house, Maxine is a little mad that I had the audacity to bring home another dog, they got along great when we met him last week so I’m sure she’ll come around! 😅 https://t.co/FtLdUnnhVQ https://t.co/HvyvI3i0E9", "RT @bjoewolf: While we’re collectively on the topic of explosive devices and domestic terrorism, we still have not arrested the person resp…", "RT @Nevada_ONA: Today, ONA and @GovSisolak issued the following statement reiterating the State’s commitment to welcoming refugees and Spec…", "The Trustee who represented West Wendover &amp; Wells has resigned so that position is available for appointment. I strongly encourage anyone from West Wendover who thinks they might be interested in serving on the school board to apply! https://t.co/gzbrx51bn6", "@tophatmichaels Soon!", "RT @JulianCastro: The people have spoken!", "RT @NVconservation: Joining the discussion with #MayorsforClimateAction, West Wendover Mayor @DanielCoronaNV stressed the need for bipartis…", "Koopa finally gets to come home!!! He was in the shelter for two months so he was super excited when I picked him up this afternoon! 😍🐶#AdoptDontShop https://t.co/WVPu94sKkr", "Congratulations on this new role in the Biden-Harris administration, @LGKateMarshall!! While I’m sad that Nevada is losing the best Lieutenant Governor in the country, I’m excited to see all that you will undoubtedly accomplish in this new role!! #NevadaFamily #HomeMeansNevada 💙 https://t.co/gIzvZPmgn4", "RT @JulianCastro: A Nevada court just ruled Sec. 1326 of the Immigration and Nationality Act—which makes unauthorized reentry at the border…", "RT @danielrothberg: Federal District Court Judge Miranda Du has ruled that a longstanding section of law, making it a felony to reenter the…", "RT @RepAndyVargas: Shoutout to the school committees and superintendents taking the hits for public health and the well being of our most i…", "RT @POTUS: We will not sit by as Governors try to block or intimidate educators protecting kids against COVID-19.\n \nThis isn’t about politi…", "RT @ElkoDaily: ELKO – Three more school board members resigned Wednesday night, nearly a week after two trustees left the board. https://t.…", "RT @NanaTeacher22: Very proud of the youth in our community who helped paint this mural on our Rec. Center.  Also very thankful to the Wend…", "This as school is about to start in two weeks &amp; the district does not have a superintendent &amp; the interim superintendent stepped down from that role last week. I hope the district can’t get back on track so that our kids can have a productive &amp; successful school year! https://t.co/Ovc5MFFGVg", "Three more elko county school board members have resigned according to Battle Born Media Networks. That makes five school board members who have now resigned within the last few weeks, the board now consists of only two members. https://t.co/xRxbJbJyGy", "Congratulations to the Wendover Youth Prevention Coalition on their successful mural unveiling this afternoon! These kids did an awesome job on their mural, love that it represents that although we might be two cities in two different states we truly are one community!!! https://t.co/pur2FAWe7j", "RT @AndrewSierraNV: Really cool webinar being held atm! It’s great to hear from Mayor @DanielCoronaNV and other mayors across the country a…", "RT @NVconservation: ICYMI: West Wendover Mayor @DanielCoronaNV called on Congress to pass a strong reconciliation package that helps positi…", "RT @NVconservation: Mayor of West Wendover, @DanielCoronaNV insightfully pointed out, \"In some ways climate change has an outsized impact o…", "RT @equalityAlec: BREAKING NEWS: A federal judge in Nevada has just struck down as unconstitutional the main federal law used to prosecute…", "RT @AaronDFordNV: AG Ford warns against fake vaxx IDs https://t.co/IPx8LIhMzx", "RT @GovSisolak: Thank you, @NevadaAG, for the important reminder.", "RT @LauraKMM: Help @FederalReserve quantify the effects of the #COVID19 pandemic on nonprofits and the communities they serve by taking thi…", "Happy to see this! Anyone who works directly with at risk populations, especially in senior services &amp; nursing homes needs to be vaccinated to protect those we serve!!! Biden to require nursing homes get staff vaccinated or lose federal funds\nhttps://t.co/FMFtTtW6jI", "It’s cold out today (nearly 30° temp difference from yesterday) so bundle up, make sure your pets are brought inside tonight &amp; cover your gardens today to protect them from tonight’s potential frost!!! 🥶 https://t.co/mGgkrOWvNr", "RT @RileySnyder: Nevada is a big state. https://t.co/duKNoi48wT", "RT @MicheleSteele: One thing that is amazing about this is that being Raiders fans who really don't want to give up on their tickets might…", "RT @GovSisolak: Rural Nevadans! This update is for you! \n\nThe Rural Business Assistance Program (RuBA) is now accepting applications for qu…", "RT @NanaTeacher22: Thank you!!!!!!!!!!!!👇💯👏👏👏", "A thread worth reading!! #VaccinesWork https://t.co/eKJs47kRvG", "RT @ASlavitt: Between Pfizer, Moderna, AZ, J&amp;J, Sputnik, Sinopharm (&amp; others) billions of doses are being manufactured. Done right and coor…", "RT @ASlavitt: Lab reports show an approximately 10 fold increase in antibody levels from a third shot. That COULD indicate that the third s…", "RT @ASlavitt: President Biden after listening to his scientists is making the decision to stay ahead of the virus, prevent cases from turni…", "Join us this afternoon for this timely discussion on our changing climate &amp; the desperate need to rebuild America’s infrastructure! https://t.co/OTFghJ6yHF", "@tophatmichaels @GovSisolak @CDCgov Unfortunately cases in Elko have nearly doubled in the same amount of time, not surprising as most aren’t masking there.", "RT @NVconservation: Join @DanielCoronaNV &amp; #MayorsforClimateAction from across the west Aug 18 at 3 PM PT as they discuss how federal suppo…", "RT @laurenwongnv: Grateful to share my first published piece on a topic I feel compelled to write about: https://t.co/kn10Q7u9J7   #WordsMa…", "RT @NanaTeacher22: If you live in Nevada, donate, canvas, knock on doors &amp; vote for @SenCortezMasto if you don't live in Nevada donate to h…", "RT @GovSisolak: Today, @DhhsNevada &amp; the State Board of Pharmacy announced a pilot program to support patient access &amp; increase the number…", "After today’s COVID update, West Wendover has seen a 60% decline in cases since @GovSisolak, following @CDCgov guidelines, reinstated the mask mandate. I’ll say it again, MASKS WORK! https://t.co/uVq61nx9LK", "RT @MeghinDelaney: The kids are alright.", "RT @GovSisolak: Lauren - Kathy and I want to thank you for your kind and thoughtful Op-Ed. In Nevada, we know diversity is our strength. Th…", "RT @mickakers: Raiders owner Mark Davis on the vaccination requirement for @Raiders games at @AllegiantStadm. #vegas #raiders #stadium http…", "Proof that masks work #MaskUpNevada https://t.co/gH51rMgfqU", "RT @CatherineForNV: I love Nevada. It’s my home where I was born and raised. And I’ll do whatever it takes to protect our state, create job…", "RT @BattleBornProg: Both @SenJackyRosen and @SenCortezMasto were instrumental in the passage of the recent #InfrastructureBill that will br…", "Senator @CatherineForNV has been a steadfast advocate for Nevada &amp; true friend to West Wendover in the US Senate, helping the city secure more than a million dollars in federal funding for our downtown development. I’m ready to do whatever I can to help her get re-elected!! https://t.co/Ct9f2e6UX0", "RT @YvannaCancela: No thanks, Adam. \nIf you agree, go support @CatherineForNV. \nhttps://t.co/Ra3QAJVrSH https://t.co/CNaF2KOhP8", "According to @dailykos census spreadsheet West Wendover grew 2% in the last decade while Elko County grew 10% &amp; Nevada grew 15%. Our neighbors to the east, Wendover UT saw their population decline 20% for a net loss of 3% in our community (I would assume undercount is to blame). https://t.co/HSrfLBxNnf", "RT @KJP46: \"How many more American lives is it worth? How many more endless rows of headstones in Arlington National Cemetery? I am clear o…", "RT @RichardEngel: Evac planes coming in and taking off rapidly from Kabul airport after delay. Quick turnaround on ground.", "RT @POTUS: We went to Afghanistan almost 20 years ago with clear goals: get those who attacked us on September 11, 2001—and make sure al Qa…", "RT @cspan: President Biden: \"Today the terrorist threat has metastasized well beyond #Afghanistan.\"\n\nFull video here: https://t.co/fusCYZsm…", "RT @NorahODonnell: Pres. Biden says national interest in Afghanistan remains today what it has always been: \"Preventing a terrorist attack…", "RT @NorahODonnell: \"The Taliban was at its strongest militarily since 2001. The choice I had to make as your president was either to follow…", "RT @NorahODonnell: \"Our true strategic competitors, China and Russia would love nothing more to have America funnel more troops and resourc…", "West Wendover has long been a welcoming place where folks immigrating to the US have planted roots in their pursuit of the American Dream. We would warmly welcome refugees from Afghanistan with open arms, just as we have for decades to folks from around the world.", "@lpackard @HealthCareVoter Congratulations!! 🎉🎊"], "description": "Senior Center Director•Mayor of West Wendover, NV•2020 NVLCM Public Official Of The Year he/him/el Thoughts are my own.", "location": "West Wendover, NV", "lang": null, "friends_count": 1209, "entities": {"description": {"urls": []}}}