{"id": 2803109615, "screen_name": " FlareCorona", "name": "Flare『炎髪』", "statuses_count": 9462, "followers_count": 2230, "tweets": ["(I went to sleep and came back to this. Wtf happened—) https://t.co/zhNyYGKL9e", "(Anyway hi— I may appear here more often, maybe-)", "(Hiro: Almost doesn’t kill people in Fairy Tail.\n\nPeople: ThErE’s No DeAtH, iT’s BaD!\n\nHiro: Starts killing people in Edens Zero.\n\nSame people: ToO mAnY dEaThS, iT’s BaD!\n\nPeople just want to complain lmao)", "Anything for Lucy-san! https://t.co/Li8IWulMwf", "❝Good evening..~❞", "❝It sure is quiet around here.. I wonder what happened while I was away..❞", "(Okay it’s been a long time— The account was locked for what, six months?? And I was already kinda inactive before— Sooo I will revamp this acc, as in make a “new” layout and also make a pinned, and then I need to find new people to follow.)", "❝H-Huh.... Hello there..? I.. I’m back..❞", "(Maybe I will make a comeback here. Idk.)", "@SexyMerc (@UteTiburon and also my Nelliel just because- @UtaeGamuza)", "@SexyMerc (Just saying-)", "@SexyMerc (I got Halibel-)", "@GambollingFlame (It’s up to you- I keep that account exclusively to writer things.)", "@GambollingFlame (No- Like- You don’t need to follow my writer- My lists in that account has all my BNHA and OP accounts as you asked-)", "@GambollingFlame (It’s better if you go on @IAmlnevitable and check the lists— There’s so many—)", "@GambollingFlame (I’m active in other verses tho. I’m mostly in BNHA and One Piece lately.)", "(So, I think it was already obvious but, I’m pretty much retiring from FT verse I guess. Already flipped half of my accounts. There’s only 18 left, but they are all inactive pretty much.)", "Corona?? https://t.co/Gx5ZAacJCZ", "(There it is— Izzy RPing with herself—)", "@sanguisin (That’s violent.)", "RT @BokenTekinaWani: Y'all, let's do this. 100 or nothing. https://t.co/j7TbDQCkb1", "@RuinousPrincess ❝!!!!!!!!!!!!!!!!!❞", "@ReformedTigress ❝Where have you been though..? It’s been... A very long while..❞", "@ReformedTigress ❝Minerva-sama it’s so good to see you!! I really missed you..!❞", "@ReformedTigress ❝!!!!!!!!!!!!!!!!!!!!❞", "No, she is small, you can’t change that. https://t.co/JyBdNP5O7l", "Why is she so small https://t.co/iZ6QPiCJqL", "@TheDeviIOfRhine Too much power for an angry kid-", "@TheDeviIOfRhine Oh no—", "@Viseleaux (I expected him to talk about the person, not about her hair, but okay—)", "@Aquashiki The hug just continues since she can’t hear the girl.", "@Aquashiki @GambollingFlame She will take that as an yes.\n\nJust... Boob hugs the girl tightly.", "@Aquashiki @GambollingFlame Does she need some cuddles too??", "@GambollingFlame She will die with a nosebleed if that happen.", "@Viseleaux A BUNCH OF FOUS", "@Viseleaux \n\n#FGO4周年\n#FGO4周年\n#FGO4周年\n#FGO4周年\n#FGO4周年\n#FGO4周年\n#FGO4周年\n#FGO4周年\n#FGO4周年", "@MirajenSaturaus (I’m just losing muse.. And I don’t find RPs so easily in the verse like I used to.)", "@GambollingFlame (I’m never flipping Flare, don’t you worry about that-)", "(I’m slowly leaving FT verse and I dunno what to think about it.. I already flipped my Lucy, and I’m thinking in flipping my Meredy and my Kagura.)", "@MirajenSaturaus Waves bye bye.", "@TemperedQun (Mind your own business—)", "@GambollingFlame e-hug*", "@GambollingFlame Can Flare have Mai’s e-huh??", "@AiiIuros (FOR ME IT IS BECAUSE YOU ARE AMAZING AND YOU ARE THE LAW SO SHHH)", "@AiiIuros (Your bio could be just “Bastet”, it would still be amazing)", "@PotentFighter Only 5 so far tho.", "Everyone is being invited to something and she has no idea what it is.", "@KajiNoOwari EXACTLY WHAT YOU HEARD.", "She knows he doesn’t understand af all. https://t.co/fV1d8AXcQg", "@ThiccThunder (What?)", "NO. https://t.co/kVEWzAaHkQ", "No. Not at all. Not even a little. https://t.co/NwgY10spOF", "@NeppestMom Same. Very same. I don’t even have anymore tears left", "@NeppestMom Unfortunately it’s being done to all of us.", "@NeppestMom He can rest now.", "@AngryInRed (Hey you! Yes you!)", "Pfffffft https://t.co/YztiOpymEJ", "Too bad*", "Too base Flare has three halves https://t.co/GwsifhJ3QK", "What is she getting? \n\nFlare is confused. https://t.co/HJV8WaGks0", "Everyone knows that this is against the rules- https://t.co/u2noVPNJZK", "@oraiosdemoness Raizen, or Gokou", "carrd I mean—", "(I will make a cardd for my Flare. Pick all the info that there’s on wiki and add the CD I made in my Flare, like that everything will be in a single place. Yush!)", "@ZennoNoJoou « this is only one part of this airship and I already have no words to describe it..! I think it would be better if you decided where to go. M-Maybe.. Show your favorite rooms?❞", "@ZennoNoJoou « her eyes were burning with curiosity about what all of that technology could do. \n\nOnce her mind returned to reality she noticed that Gilgamesh was already taking the lead to guide her, so she quickly caught up with her.\n\n❝I-I.. I honestly don’t know Gil-san..! Apparently »", "@ZennoNoJoou « But her surprise only got more evident once the gates opened and revealed that hall. All that was sure something out of her reality considering she spent most of her life in a village with giants that didn’t have that much knowledge about technology. At this point »", "@ZennoNoJoou « that she just had. But soon she saw that giant golden door. It for sure was the biggest door she has ever seen. It looked like the entrance of heaven. \n\n❝I-It’s.. So big and shiny...❞\n\nShe was so amazed that she had no idea of how to react to that. She was speechless. »", "@ZennoNoJoou She didn’t even had time to answer before the teleportation started. Flare was very familiarized with magic, but was the first time she was being teleported.\n\nIn the next second she was already inside of the airship, feeling a little dizzy because of that new experience »", "@SultryDemoness Nah", "@SultryDemoness I don’t deserve", "@Altila It’s a bad civilization", "@ZennoNoJoou (They instead will post NSFW using Bunny suits.)", "@ThySoulplay (It’s not the first time this happen and I’m sure it will not be the last. But all the other times they actually changed when I asked. This one is clearly doing on purpose to hit me, but it will not work lol)", "WATASHI GA KITA!! https://t.co/IFXp7tqpIi", "@PotentFighter (And she probably wouldn’t even change it lol it’s clearly on purpose)", "@PotentFighter (I know right?? lol)", "(Welp, once again this happened. But yeah, I tried asking politely and this is what she said. Welp.\n\nBut yeah this account is using my AVI and Header. And just to show how she acts, there’s the talk too.) https://t.co/fpkyA9OnLz", "Who you https://t.co/CnCeB5IkFS", "@GambollingFlame (Mai is more into wild things— 👀)", "@YagdoRigora ❝H-Happy Birthday Minerva-sama!!~❞", "(I think I will make a thread of headcanons for Flare. Not sure. Maybe. Who knows.)", "RT @PoyoPowah: ❝Poyo!❞\n\n【★】Hoshi no Kaabii │ Kirby of the Stars \n\n【★】Anime and Games based\n\n【★】MVRP\n\n【★】Don't underestimate the pink ball!…", "@YagdoRigora (Yes. Shhhhhh)", "@CapedManOfFear (How do I turn this on?)", "@PrideOfHakoniwa @KurokamiHeiress So.. If she place the ahoge on her head, she will become Medaka??", "@ragnavir Who is lion??", "@ZennoNoJoou « common day. So after thinking for a fraction of seconds, she held the hand that Gil offered her.\n\n❝S-Sure Gil-san..! If it will not be of any trouble, I would love to expplore your airship..!❞", "@ZennoNoJoou She was glad that she could help her friend, but that last answer sure got her by surprise. \n\n❝Y-You mean.. Take me to over there?❞\n\nShe stopped for a moment, averting her gaze from the woman and looking toward the airship. It sure could be a good adventure for such a »", "@ZennoNoJoou « you sure will find a bunch of rare and expensive things! But if you’re really looking for the most rare treasures of Earthland, you should go to the Pergrande Kingdom! It’s Northeast from here. Probably a couple days of travel, but I’m sure it will be worthy~❞", "@ZennoNoJoou ❝I-I mean.. Even being so far, it still looks so big! I can’t even imagine how it can be inside of it!❞\n\nHer eyes were locked by how amazing that was. But then the lock was broken and Flare turned her eyes toward Gilgamesh.\n\n❝Hmm.. Unique things? Here in the capital »", "@GambollingFlame Too much bounce.", "@GambollingFlame (No, start right now)", "@GambollingFlame (You’re missing the good thing. Watch Adventures 1, 02 and Tri)", "@GambollingFlame (Ohh I see! Well, I’m more into One Piece and Digimon now-)", "@GambollingFlame (You Have Account in the verse??)", "@GambollingFlame (I’m not cute stop-\n\nAnd I kinda gave up on the idea. It was just the hype of the moment-)", "@ragnavir (What is a thesaurus? Never heard of that dino)", "@YagdoRigora (I didn’t ❤️)", "@ragnavir (That’s me everyday-)", "@ragnavir (Good friend. Nice friend. A hoe. But a friend.)", "@ragnavir (Jay is a hoe and I can confirm that)", "@ragnavir @wiizaan (I uh followed a thing)", "@ZennoNoJoou « Not only from the airship, but also from seeing an old acquaintance after so long. Flare then simply connected the dots.\n\n❝Huh.. That.. Giant ship over there.. It’s yours isn’t it..? I can only imagine someone like you having such thing..!❞", "@ZennoNoJoou « Even with such a surprising sight just over her head, another surprising sigh was in front of her.\n\n❝I-I’ve been well Gil-san..! What about you? What bring you to Fiore again? I.. Didn’t imagine I would see you around here one more time..!❞\n\nThe surprise sure was great. »", "@ZennoNoJoou That was a rare sigh for her. The only flying ship she had ever seen in her life was Christina, the name affectionately given to the airship of Blue Pegasus. Even like that the ship wasn’t gigantic like that one, and it sure wasn’t shiny like this one as well. »", "How come a dragon is afraid of a lil mouse- https://t.co/ztWxSwxVZO", "« they didn’t see each other. Probably Gil wouldn’t recognize her.\n\n❝Y-You’re Gil-san!! It’s been so long..! It’s nice to see you again..!!❞", "« wonder why that was there, she continued walking, eventually bumping on a blonde woman by accident.\n\n❝F-Forgive me..! I-I wasn’t paying atten—❞\n\nOnce looking better, she recognized that face. It was Gilgamesh. Someone that Flare met a couple years ago and since then »", "« a couple dresses that called her attention. \n\nThe sun was shining bright that day, excelt that... A large shadow was covering one part of the city.\n\nOnce looking up Flare saw a giant airship, apparently “docked” in the sky over the capital. Even looking up to admire and »", "@ZennoNoJoou It was a common day in the capital of Fiore, Crocus. Several people in the streets, talking, laughing, yelling, like any other day. And within the crowd was Flare, the redhead from Sabertooth. She was getting out of a clothing store, having just bought »", "(Shelbey’s voice is so nice to hear I swear)", "@ragnavir (Don’t worry, I love you enough for the both of us ❤️)", "@Ragnavir But but but.... I already do.....", "❝I’m sorry but.. Do I know you..?❞ https://t.co/ESorBVOIu4", "❝No I’m not.❞ https://t.co/wIvOqtr0SS", "REDHEADS. THEIR HAIR ARE SIMILAR. WAS ABANDONED IN A RANDOM VILLAGE JUST LIKE ERZA.\n\nSHE NEEDED TO MAKE SURE!\n\n❝I-I’m sorry miss..❞ https://t.co/dw9cKSuyHk", "@DragonicDespair ❝Are you my mother too?❞", "@RollPretzel (Shhhh no one saw-)", "@RollPretzel (I messed that up— Didn’t notice the pic I sent was the small version of it— DUMB ME)", "@ZasshokuRyu (Benihiko it is.)", "@CunningBlood (You’re welcome-)", "@CunningBlood (WELL OKAY THEN—)", "@CunningBlood (IT WAS JUST A FOLLOW CALM DOWN—)", "@CunningBlood (Followed!)", "@Timonguin (Hello bored, I’m sleepy)", "Everyone should listen to Medaka. \n\nMedaka knows what she is saying.\n\nMedaka’s words are the law. https://t.co/0pNHt24JJl", "@OfficialToppo (Nope)", "@OfficialToppo (Cooler is cooler than the others—)", "@ruinousprincess ❝I am... Didn’t manage to sleep..❞", "@Vegito (I am.)", "@AsuhiroJazu ❝O-Oh..! Forgive me then..! How.. How should I address you?❞", "@AsuhiroJazu ❝The way you speak.. It’s like your parents are some kind of.. Royalty? Are they?❞", "@AsuhiroJazu ❝I’m glad you managed to~ Looks like the guards loud talking didn’t bother you this time!~❞", "❝Why is Gajeel-san in Minerva-sama’s room..?❞", "Guess you meant Boobastic https://t.co/AgV6dwtTqQ", "@ZennoNoJoou Flare cares about Gil-san a lot.\n\nNod nod.", "@ZennoNoJoou 💜", "@AsuhiroJazu ❝How come Sleep is hard?❞", "@Hanzomaki ❝I.. Can come another time. I don’t want to bother you on... Whatever you’re doing.. S-See you later..!❞", "❝Asuka-san... What are you... Doing...❞ https://t.co/lkIkSkvr1X", "@ruinousprincess ❝Don’t disappear without warning Rias-san..! I-I.. I got really worried about you..!❞", "@ruinousprincess ❝Where have you been all this time?❞", "@AsuhiroJazu ❝Then.. Sleep..?❞", "@ruinousprincess And so she embraces the other redhead tightly.\n\n❝I missed you so much Rias-san..!!❞", "@ruinousprincess ❝RIAS-SAN!!!❞", "@LoveFillGoddess (WOW THATS THE BEST YOU CAN COME UP WITH?!)", "@LoveFillGoddess (YEAH, HIS BED)", "@iFelinoz (LMFAOOO)", "@LoveFillGoddess (YEAH YOU ONLY NEEDED A GROPE!)", "@LoveFillGoddess (OH IM SORRY? DID YOU HAVE AN ENTIRE ARC FOR YOU??? OH RIGHT NO! YOU HAD TO SHARE IT WITH SOME WEIRDOS AND LOST TO A FROZEN GROPE)", "@LoveFillGoddess (WHO ARE YOU AGAIN??)", "(Devilman Crybaby anime of the year? What even is this shit-)", "@LoveFillGoddess (ONE OF THE UNDERLINGS OF THIS LIGHTNING DRAGON TURNED YOU INTO STONE)", "@LoveFillGoddess (NOW EXCUSE ME! I HAVE NO TIME TO WASTE WITH A PUDDLE OF MUD)", "(I’m being too dumb here today I swear-)", "@LoveFillGoddess (I DONT NEED TO BE SNAPPY TO PROVE THAT IM SUPERIOR)", "(Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua Aqua) https://t.co/L87IVYp3qW", "@LoveFillGoddess (I CAN UNDO THEM WITH MY MAGIC, BUT WHAT ABOUT YOUR FACE THAT CANT BE UNDONE?!)", "@LoveFillGoddess (I DONT EVEN NEED TO TRY TO WASH THE GROUND WITH YOUR FACE)", "@LoveFillGoddess (SAID THE BLUE WITCH)", "@LoveFillGoddess (I WILL EVAPORATE YOU)", "She can disturb if she want, Abby belongs to her after all. https://t.co/Wy68aGkwF5", "(Best character improvement in One Piece?? Luffy?? Nah.. Zoro?? Nah.. Usopp?? Pffft.. Best character improvement was Alvida— I mean come on—)", "(Lol Who even is him?? Must be terrible lol smhsmh Keep that away from me—) https://t.co/yGEfb1sg3D", "@YagdoRigora ❝People should care about more important things... Like.. Desserts..❞", "@GambollingFlame ❝H-Huh.. Yes.. Like.. Don’t.. Lick their ice cream okay..?❞", "@GambollingFlame ❝.... Things...❞", "@GambollingFlame ❝Just... Don’t do that with minors Mai-san..❞", "(I’m sorry-) https://t.co/x1kDJlaT39", "(Didn’t her just like.... Die-) https://t.co/uzYOiPGIY7", "@KenshiNoZoro (Nah. You stoooopid.)", "@KenshiNoZoro @Sosakusha (Not the Momo you talking about probably, but you didn’t specify so-)", "@KenshiNoZoro (@Sosakusha Damn-)", "Wouldn’t mind sleeping with Minerva-sama at all. Cuddling with her would be heaven.", "(Agreed) https://t.co/Y4fP2cjkro", "@AiiIuros (The cat is in heat)", "@KenshiNoZoro (And also how is your character twin brother of Erza and be years younger than her considering he wasn’t in Tenrou events?? And also is member of Spriggan and Sabertooth at the same time. And learned a magic with Acnologia that not even Acnologia himself knows—)", "@AiiIuros 👀", "(Follow her! Don’t leave her hanging!) https://t.co/LueIJTkOsq", "@AiiIuros (I do- And I always will)", "@AiiIuros https://t.co/mfKfZG7obZ", "Is happy to see @AiiIuros back. \n\nShe is the law after all.", "(Nine months?? More like... 400 years.) https://t.co/ILuIUR2vur", "@LadyHolyKnight @LordKatakuri (Because their mountain IS a statue of Obsidian)", "(If you’re evil and you’re on the rise)", "@DarkestSaiyan (Ohhh I see! It’s because until now I only saw DB characters locked up-)", "@LegacyOfSolomon (This prison will blow up-)", "(Why everyone in DB verse is in jail—)", "@KosumosuOjou ❝H-Huh.. I-I’m Flare.. And I didn’t mean short in a bad way..! It’s just.. You’re cute, and your hair really fits you..!❞\n\nShe didn’t mean to insult the girl at all. In fact everything she said was compliments. And of course the hair was taking her attention more than anything.", "❝You’re so short and cute..~ And your hair is so beautiful..~❞ https://t.co/H7Eu9hpoGB", "@SwirlyBrow (Hello my name is Time, and I’m telling)", "@SwirlyBrow (Not after Wano tho—)", "@Vegito @SaiyajinBeast (Frieza will just get revived again... And again.... and again....... AND AGAIN)", "@Osoroshiin (I BLAME YOU)", "@Osoroshiin (WHAT DID YOU MADE ME READ WTF)", "@Osoroshiin (I just searched about it and WTF)", "@Osoroshiin (FLARE WITH GLASSES??)", "@Osoroshiin (I will still spank you, just saying)", "@Osoroshiin (Who that)", "@Timonguin (Wtf- What can even happen in 2 minutes?? The opening-)", "@Timonguin (My calculations doesn’t compute- Considering 20 minutes of a common anime episode, then you’re saying that 2 seasons have 3 episodes in total-)", "@Timonguin (I would need to watch the thing first— What anime is this?)", "@Osoroshiin (Everyone eles were killed by zombies)", "(I have an empty account— Gimme character suggestions)", "@Mugiwara_Sencho (That Steven is you?)", "@Mugiwara_Sencho (Used to. I’m thinking if I will bring her back or not)", "@UnversedGod ❝H-Huh..? Yes I’m Flare.. I.. I didn’t know people talked about me..❞", "@UnversedGod ❝W-Well.. My hair is very important to me so.. I take very good care of it..~❞", "@UnversedGod There’s no measure. She can make her hair stay any length.", "@GambollingFlame (I love Lapis as well, but honestly Peridot gets my first place.)", "@KosumosuOjou (Well, my part I did, that was expose her. But yeah it would be appreciated!)", "@RuushiHatofilia @SensualSwords @SeitekiKori (It’s my account. So just to answer, I reseted some of my accounts some months ago, just didn’t restart my Seilah yet.)", "(All this SU content on my TL is making me want to bring back my Peridot-)", "@KosumosuOjou (You know the worst? I tried talking with her politely, and asked why she stole, and she came with the excuse that she didn’t know? Like come on.)", "(Welp, tried talking but she didn’t do anything so, exposing time I guess? This Seilah stole my Seilah’s bio, header and name. So yeah, just letting people know about the copy cat) https://t.co/Ad8y6NBdc9", "@ZeroNoHaken https://t.co/eQgXHtdxvj", "@AisuMeikuKyanon ❝Gray-san.. You’re an hypocrite..❞", "❝@RubberySencho can win that one easily!❞\n\n#LuffyVsNaruto", "@SolitaryIdeals Wow rude— 👎👎👎", "@Vegito (Same. He is WAY better than that fail)", "..... Would like that...... https://t.co/8JzdVKHGwX", "When @iLyonVastia is the guardian of the END Book https://t.co/DQtvtNpF9r", "❝Language..!❞ https://t.co/DsqRUdCP4G", "❝Lyon-san, language!❞ https://t.co/Nd8yubXjhX", "Flare bear. Flear https://t.co/nUw3oNBBwh", "@AstralWielder https://t.co/NTRIy0Dzmn", "@UnversedGod (The.... Sky.)", "@iLyonVastia https://t.co/phRSQVVoQp", "@SenchoKid (I can consider making a Bonney- But I cant promise activeness- If that’s even a word-)", "@GambollingFlame Wasn’t expecting a hug, but just embraces her as well!\n\n❝H-Hello Mai-san..!❞", "Just... Waves at @GambollingFlame!", "@HakaiBeerus (Thats kinda literally true-)", "Gives @ZaDoragonKogo a tight hug followed by a deep kiss.\n\n❝Happy New Year Abby-san..!~❞", "@Timonguin (NO)", "@Timonguin (There’s a bunch of brats there watching peppa pig)", "@Timonguin (I can’t I’m in a party)", "@Timonguin (Time is slow here)", "@Timonguin (40 minutes here yet)", "@Timonguin (🎉)", "@Timonguin (Nah, just messing with you lil guin)", "@Timonguin (You have here)", "❝H-Happy new year everyone..!!❞ https://t.co/FmbrprX2vZ", "@HeroicKakarot (Okay listen here!! YOU HAVE TOO MANY FOLLOWERS I WILL SUE YOU!)", "Headpats @Nitocricious because everyone is doing so.", "@HakaiBeerus ❝W-What did you mean then Beerus-sama..?❞", "@AspectOfIce ❝Gray-san, you better look for your friends.. They might be in Bangkok right now searching for you..❞", "@RaijinSIayer ❝H-Huh.. I.. Thank you I guess..?❞", "@RaijinSIayer ❝Eh? What were you talking about me? Did I do anything wrong?? I-I’m sorry..!❞", "https://t.co/DrQbBcFx3E", "@RaijinSIayer ❝Guess someone is talking about me.❞", "Sneezes", "https://t.co/79MkepzvgC", "@RaijinSIayer ❝Hai Orga-san! See you!❞", "@RaijinSIayer ❝I’m pretty sure Sting-san is already there doing that.. I-I mean, talking to her..! Not kissing her ass..!❞", "@RaijinSIayer ❝Since she is being rude to everyone, Sting-san locked her there until she put herself together.. She is.. Kind of grounded..❞", "@HakaiBeerus ❝It wasn’t that expensive though.. I made it myself and the ingredients are not expensive.❞", "THROWS SOME CHOCOLATE CAKE INTO HIS MOUTH! https://t.co/Sqj1uPiZFd", "@RaijinSIayer ❝Well.. Why don’t you ask him for a match then?❞", "@RaijinSIayer ❝And since Laxus-san defeated Jura-san.. Then technically Jura-san only saved you from taking a bigger beating..❞", "@ShinzoYoroi (Just give him fish. Rotten fish.)", "❝What about the fight against Laxus-san and Jura-san..? You didn’t win that..❞ https://t.co/aWqQxamywn", "❝All of us got squashed by Fairy Tail at some point Orga-san..❞ https://t.co/tMzuvzKX01", "❝H-Huh.. Because he is my friend.. I know he is rude but.. That’s just him.❞ https://t.co/col6oVDusl", "@AiiIuros (I will miss seeing you around Star ;~; But have a good luck on life! I know you will rock the world!)", "@iLyonVastia Rude..!", "@EirianHero (Damn you’re old as fuck)", "@AFutureHacker MORE CONFUSION IN FLARE’S HEAD!!!\n\nHER MIND IS EXPLODING", "@AFutureHacker HOW IS THAT POSSIBLE?!", "@AFutureHacker COLD OR HOT?!", "@AFutureHacker Also doesn’t understand if the girl is feeling cold or feeling hot, because she is with a jacket and that’s it.", "@AFutureHacker Flare needs time to process what she just saw.", "@AFutureHacker Confused Flare is confused. Too much to assimilate.", "@Dakuzan Replies to him.", "@AFutureHacker How does her body work??? Can’t compute.", "@AFutureHacker Too much stretch.", "@AFutureHacker Is now confused.", "(Yes, that’s right. Parents gives the wrong answers.) https://t.co/2lQi2malsS", "@Timonguin (You’re welcome)", "@iLyonVastia (WHO IS CAROLINE)", "@iLyonVastia (But theres no door)", "@iLyonVastia (Nah I’m fine)", "@iLyonVastia (What is cannabis)", "@Timonguin What about Oz Vessalius from Pandora Hearts? https://t.co/2UDMKiGkNP", "@iLyonVastia (Yes. It’s the only point you need)", "@iLyonVastia (Because you’re Jay)", "@Timonguin (Any preference?? Like.. Any characteristics that you want it to have?)", "@VirtuousBelle (There’s Google Photos too)", "@VirtuousBelle (Dropbox?)", "@YagdoRigora (I’m lazy)", "@YagdoRigora (I’m well know for kicking who I like.)", "@YagdoRigora (I WILL KICK YOU)", "@YagdoRigora (DEJA FUCKING VU)", "@YagdoRigora (Dont ask.\n\nI’m tired)", "@YagdoRigora https://t.co/aAfgJJ4kFa", "@ShinzoYoroi (Nah.)", "@ShinzoYoroi (Nah, um garb)", "@ShinzoYoroi (I’m that Eileen btw- But I guess you already noticed)", "@ShinzoYoroi (And even more now that I stayed almost a year without rping. I’m rusty.)", "@ShinzoYoroi (I always go home early in tournaments)", "@ShinzoYoroi (I know the feeling daughter)", "@ShinzoYoroi (Pat pats)", "@SenchoKid ❝Baby.. 5❞", "@SenchoKid ❝But.. You’re Eustass.. Kid..❞", "@hausuwaifu (And I call that mercy.)", "@Mugiwara_Sencho ❝I-I’ve been good.. What about you Luffy-san..?~❞", "@Mugiwara_Sencho ❝H-Hai..?❞", "@ZennoNoJoou ❝But.. Only the color changed..❞", "❝You make a portal with your territory magic in your stomach so everything you eat is teleported somewhere else, and so you don’t get full, managing to keep going until everyone else gives up.. B-But I didn’t tell anyone..!❞ https://t.co/rpeYvSEvxK", "❝S-Sure Minerva-sama..! And don’t worry, your secret of the Food Festival is secure with me..!❞ https://t.co/F0ao7YYdhw", "❝W-Well.. I’m really enjoying..! I pretty much know everyone already, and I really improved myself here..~❞ https://t.co/xP2RRqulnD", "❝J-Just dont mind me Minerva-sama..!❞ https://t.co/aLsIUv0SpL", "@MaskOfRegret (Damn)", "❝N-Not at all..! I-I..! I’m just surprised..! H-Huh.. T-That’s all..!❞ https://t.co/z8uFCe12MZ", "@MaskOfRegret (Dom Flare)", "❝M-Minerva-sama is around...❞", "@MaskOfRegret (Mi why you no like me)", "@MaskOfRegret (Oh shit— I meant I cry-)", "@MaskOfRegret (I don’t know what Ivey mean)", "@MaskOfRegret (Love me)", "@MaskOfRegret (Ivey)", "@MaskOfRegret (WHY YOU DO THIS)", "@VividAblaze Zips her mouth.", "❝I’m not the same fragile with low self esteem girl that joined Sabertooth some time ago Sting-san~ I know how to defend myself now~❞ https://t.co/gNsYfENtdr", "Actually knows how Minerva wins every “Tiger! Tiger! Tiger! Food Festival”, but will never reveal the secret.", "Her hair was faster than a bullet and strong enough to break concrete, so pulling him fast enough before her falling on the water was easy. \n\nAnd so she did that, and used him as a step to jump off the pool.\n\n❝I’m sure enjoying the view Sting-san!~❞ https://t.co/QSsRZgSkur", "Sticks a note to his office’s door:\n\n“Could you please stop being lazy and trying to train to beat Minerva-sama in the Food Festival (Because you will never beat her), and actually do your paperwork?\n\n— Flare” https://t.co/j0usA1nBCa", "❝You should...!❞", "❝Thank you...❞", "(Oh shit-) https://t.co/oOAI9h8RIB", "❝Orga-san, stop bullying Lucy-san..❞", "❝Blondie.. He is all muscles and no brain.. You shouldn’t mind what he say..❞", "❝W-Well.. He called me redhead, and this doesn’t sound like an insult to me.. Same goes for “blonde”..❞", "❝B-But.. Blondie isn’t an insult..❞", "❝But... You’re blonde Blondie..❞", "@MaskOfRegret (DONT CONFUSE ME MI)", "@MaskOfRegret (Now I’m confused-)", "@MaskOfRegret (Against bringing her back or against keeping her sealed tho-)", "@VividAblaze Flare disapproves.", "@ShinzoYoroi ❝E-Erza-san.. You shouldn’t drink anymore..❞", "@FugutaitenHiku .......\n\nGives her one more.", "Will give @NephilimSystema a grooming kit for her wings!", "Will give @TerminusOrtem a chocolate box as well, because she doesn’t know what he likes.", "Will give @Barmeido a new dress! She can choose!", "Will give @LegacyOfSolomon an watermelon! Because she knows he loves them!", "Will give @FistOfLightning an Eel-", "Will give @AstralWielder a new Silver Celestial Key! She doesn’t know which one it is because she doesn’t know much about the magic, but it’s one more for her collection!", "Will give @KajiNoOwari a giant piece of meat from a giant boar from her village.", "Doesn’t know @SirMasahito but... Will give him a chocolate box. Everyone loves chocolate after all.", "Will give @SeikanNoYaiba a strawberry Cheesecake.", "https://t.co/rD2mu4xyF1", "@BruteKing ❝I.. Guess someone is calling me.. Excuse me..❞", "@BruteKing ❝H-Huh... Thank you I guess..?❞", "Just gives presents to all her friends!", "@SenchoKid ❝Eustass.... Baby.❞", "❝It’s kinda cold.. Guess I will change my clothes for now..!~❞ https://t.co/bBHGgF4A2g", "❝Merry Christmas everyone..!!❞", "@Ragnavir (Sheabs)", "@YagdoRigora !!!!!!!! https://t.co/h30XN8oiIQ", "@YagdoRigora THERE’S—— https://t.co/1O4rcrfLhl", "@Ragnavir (Gimme taco. I never had one)", "@iLyonVastia https://t.co/sJEWkZtseg", "Not that he has one to talk about it- https://t.co/PJ9g1WXgyW", "Has no mom at all. https://t.co/u8WJwWv945", "@KenshiNoZoro Wonders if pointing to the wrong direction will make him go to the right direction....", "@DrunkenBacchus The blame is all on his writer.\n\nShows photo. https://t.co/AO3qgMxpfp", "Steps on @DrunkenBacchus", "❝I will not repeat myself. Do I look like a recorder to you? I think not. So bye bye.❞ https://t.co/EZZpxKaX9W", "❝Im sorry, could you repeat?? Your ego is so loud that I couldn’t hear you at all.❞ https://t.co/pXiOzs3I8K", "Sees this #MVOrgy everywhere...\n\n❝I.. I guess it would have been better if Acnologia destroyed everything...❞", "@CunningBlood ❝H-Huh.. Now I’m confused.. I thought his name was Eustass Kid.. And not Kid Eustass..❞", "@CunningBlood ❝Nano Kid sounds better.❞", "@iLyonVastia (POLICE ON YOUR DOOR ALREADY)", "@iLyonVastia (BIG REPORT THEN)", "@iLyonVastia (Woah you called me ugly. Reported)", "@iLyonVastia (That makes four)", "@iLyonVastia That’s three times rude", "@iLyonVastia (THATS ALSO RUDE)", "@iLyonVastia (RUDE)", "@iLyonVastia (But Marcus-)", "@iLyonVastia (It’s been almost a year that I’m eating)", "@GambollingFlame Suddenly Flare is no longer using her costume.\n\n❝H-Huh.. That was my Halloween Alter-ego talking.. D-Don’t mind it..!❞", "@SwitchHime https://t.co/1Ys5PHCufm", "❝Got tired of that outfit.. Phew.. It’s too itchy and hot.. No way I will stay using it the entire month..!❞", "@GambollingFlame ❝The costume fits you well since Cow Lady has plenty of milk! Nyahahahaha!❞", "@YoseiMajin (@DimariaYesta it is- I will try to do my comeback on RP today)", "@YoseiMajin (I do better as Dimaria)", "@YoseiMajin (I have Dimaria, Brandish and Eileen. Make your choice-)", "@iLyonVastia ❝Sayonyahra!❞", "@iLyonVastia ❝Nyahahahaha White Quartz head is getting deaf!❞", "@iLyonVastia ❝Flarokaka doesn’t nyow.❞", "@Ragnavir Well, soul only one, and it was his daughter’s soul.", "https://t.co/klfIUis0wB", "❝Flarokaka is back for nyaow!❞", "@KaminariSeigi ❝E-Eh..? Fire cracker..? And papa..? I’m.. So confused..❞", "@iLyonVastia CALLS THE COPS", "@iLyonVastia Smacks him again but this time in a undodgeable way.", "@iLyonVastia Descriptively smacks him into the oblivion.", "@iLyonVastia Descriptively cries!", "@iLyonVastia EVEN MORE RUDE", "@iLyonVastia RUDE", "❝S-So...❞ https://t.co/A2EfXCCI5V", "(Looks like that Sorano that stole my things deactivated. Good)", "(Just to let people know, my Sorano is @SoraNoTennin. This other Sorano (@TheAngelSorano) isn’t mine. She stole my layout, name detail and bio. So yeah, just letting you all know about this thief lol)", "@Hanzomaki Cries no jutsu", "@SwitchHime ❝Rias-san, your swimsuit was destroyed.. Again..❞", "@Viseleaux ❝W-Well.. I did my best..~ Hmm... Can I get a churros please..?❞", "@Viseleaux ❝!!!!!!!!!!!!!❞", "(6?!?!?!?! THAT THING WAS BIASED I DEMAND A RECOUNT——)", "Guess she will be sleeping at the yacht today. \n\n#MVYachtBash", "@SenchoKid ❝Just keep those hands away..! Humpf..!❞", "@TheFlameLives (He dying?)", "@SenchoKid ❝Sure you don’t..!❞", "@SenchoKid ❝Y-You heard me..!❞", "❝Kid-san is a pervert..❞", "(First that the link can’t be broken like that. And second that Chelia has nothing to do with dragons 😂) https://t.co/2P1epDkxSS", "❝Medaka-san changed so many times that I got dizzy..❞", "@FieryTitania @FieryKyandi (WTF MY CAT IS DOING THERE)", "@FieryTitania (Always blame Dan. Even if it’s not his fault, it is his fault.)", "@FieryTitania (I blame Dan)", "Wonders how Medaka changes swimsuit so fast.\n\n#MVYachtBash", "@FieryTitania (Vicky’s biggest enemy-)", "Now she knows she will lose. https://t.co/RwKqxOUrCD", "@CharmingFuchsia (No idea— but if you want to join, just need to put the hashtag I putted! MVSC)", "@CharmingFuchsia (Oh people are making a MV event in a yacht, and there will be contests, and the first one is swimsuit contest, so I’m putting my Flare on it—)", "@Viseleaux Done-", "Will be participating too-\n\n#MVSC", "@Viseleaux (It can be for the swimsuit one-)", "@Viseleaux !!!!!!!!!!", "@AmberFists Doesn’t know the girl, but waves anyway.", "@Viseleaux Apologies for being late.", "Is late. Like.... Veeeeery late. But finally arrived.\n\n#MVYachtBash https://t.co/k07MGMSZ6S", "@SwitchHime Is a servant now-", "Is surprised that Steven actually hates someone.", "@SwitchHime Knows she can always count with Rias. Is already licking her ice cream.", "@SwitchHime Wants chocolate.", "(Man, that Donald ONLY appeared to cause drama holy shit)", "@iFelinoz (Why you didn’t put emojis on all the people behind—)\n\n(AND CONGRATS!!!)", "(Guess Ichigo didn’t feel so good) https://t.co/LuqOUpx6qT", "@SutorausuMJen (I swear I read Mjiarnae)", "❝Good evening..! Huh.. I apologize for my absence..!❞", "@Modoreddo ❝Your hair is beautiful miss.❞", "@urbandictionary Flare Corona", "@SwitchHime Would love to wake up to that every day.", "@KenshiNoZoro @Mugiwara_Sencho ❝If I call you.. Will you manage to find the way though?❞", "@iLyonVastia ❝My hair is faster than a bullet and stronger than iron. I can break your ice before you even think about making it. And if you think that making that bunch of scissors will make me step back, you’re sure underestimating me. I’m not afraid of you, and I never will be.❞", "@iLyonVastia ❝It was an example. I don’t need my fingers to do that!❞", "@iLyonVastia ❝Doesn’t matter how much you cut my hair, I can always make it grow back in a snap of fingers~❞", "@iLyonVastia ❝You will begin to lose your hair so eventually you will be just like him!~❞", "@iLyonVastia ❝Mister Freeze.❞", "@FutsuNaShujinko (You impersonate penguins. Reported)", "@FutsuNaShujinko (I am)", "@FutsuNaShujinko (Lies and lies)", "@FutsuNaShujinko (You are a parody account)", "@RubberySencho ❝Happy Birthday Luffy-san!!❞\n\nGives a giant meat to him. Even though she knows she already gave him a meat tree before-", "@SwitchHime Pretty much- https://t.co/R9SK25hBup", "@ZennoNoJoou (Guess his lance isn’t big enough to impress her.)", "@SwitchHime Passes out? Passes out.", "@SwitchHime Flare used Wrap!\n\nThe wild Rias is hurt by Wrap!", "@iLyonVastia ❝Humpf.. You are too mean..❞", "@iLyonVastia ❝What attitude are you talking about?!❞", "@iLyonVastia ❝I was going to get a present for you..!❞", "@iLyonVastia ❝Why you’re always so mean to me?!❞", "@iLyonVastia ❝My name is Flare..!❞", "@Viseleaux (THATS BAD CIVILIZATION)", "@iLyonVastia ❝......❞ \n\nTurns around.\n\nLeaves.", "@FutsuNaShujinko (PUT ME IN)", "@FutsuNaShujinko (IT COULD BE GROUP CALL OKAY)", "@FutsuNaShujinko (GC as in group chat?)", "@Hanzomaki She will not. All the fat that she eats goes straight to her boobs and ass.", "@Hanzomaki And of course she accepts them all.", "@KurokamiHeiress Passes out.", "@RuinousPrincess ❝Rias-san.. I can’t sleep..❞", "@RuinousPrincess (You still the best Rias ❤️❤️❤️)", "@BeautyOfFiore GLOMPS", "@VirtuousBelle ❝H-Huh.. Excuse me miss.. Why.. Why are you so sad..?❞", "@RuinousPrincess Huuuuuuuugs to take away the boredom.", "@RuinousPrincess Early nosebleed.", "@KurokamiHeiress « flying by a giant snowball before falling on the ground with the snowball still over her.\n\nK.O.", "@KurokamiHeiress Oh no, it was just like the swimming pool basketball. Flare’s hair could surpass the speed of sound, but the speed of light wasn’t something that she could accomplish yet, so she had no time to make a shield with her hair.\n\nThe result?? Flare being sent »", "@LordKatakuri And with more blood coming out. https://t.co/s7g5lZEYK5", "@KurokamiHeiress But!! She is now with several strands of her, each of them with a snowball. \n\n❝KAMISHIGURE: SNOWBALL MACHINE GUN!!❞\n\nAnd then all the balls were thrown at her.", "Just.... Throws a snowball at @KurokamiHeiress.", "@Ryokushun @AmphibiousMage Hello friendo https://t.co/1we2P1qqnv", "@RuinousPrincess Wants to sleep on that comfy lap.", "Just... Hugs @RuinousPrincess tightly.", "@RuinousPrincess Lazily lifts hand.\n\nTotally didn’t just wake up.", "@RuinousPrincess Hug her all day", "@RuinousPrincess Suddenly Flare is hit by the urge of becoming a ship girl", "@RuinousPrincess  https://t.co/ACEFZAZNkX", "@RuinousPrincess Gives a chocolate box to her in anticipation because she knows she will not be around in the day.", "@EirianHero And that’s when the magic turns against the magician-", "@EirianHero But... She is acid inside.", "Wonders why @EirianHero looks like bubblegum.", "@RuinousPrincess Dies.", "❝H-Huh.. What did that girl do..? Everyone is attacking her..❞", "@RuinousPrincess Blushing Flare is blushing.", "@RuinousPrincess ❝What about girls..?❞", "@iLyonVastia ❝I-I said sorry because I couldn’t protect it..! Gray-san went there and threw it on the ground..!❞", "@iLyonVastia ❝I-It wasn’t me..! It was.. Gray-san..!❞", "@iLyonVastia ❝B-But it wasn’t on purpose..! That’s unfair..!❞", "@iLyonVastia ❝I-It wasn’t I swear..!❞", "@iLyonVastia ❝I-I’m sorry..! It was an accident..!!❞", "@iLyonVastia ❝O-Oops.... Sorry...❞ https://t.co/ZyutPP7mjM", "@RuinousPrincess Now the roles would be inverted. She placed Rias’s head on her lap so she could sleep.", "@RRCyborg21 Gives all her chocolate bars to the weird girl.", "@RRCyborg21 Has more if she want.", "Gives a chocolate bar to @RRCyborg21", "@RuinousPrincess Best older sister she could ask for.", "Kinds*", "(Two kinda of people) https://t.co/ZjXLxNhSVB", "@RuinousPrincess And then..... She lays on her lap and falls asleep.", "@RuinousPrincess  https://t.co/timD7xXrlu", "(FutanaRias)", "@RuinousPrincess Hypnotized Flare is hypnotized.", "❝No, you’re a Neanderthal. I really dumb one..❞ https://t.co/mzfDcAfQiE", "@ErzaSukaretto ❝W-Well.. We are not that close.. We talked once or twice b-but.. That was it..❞", "❝No wonder you look like a monkey! You’re a Neanderthal..!❞ https://t.co/gMLBDRQQ7j", "❝Y-You... You are brainless..!❞ https://t.co/ji48Bl9EZR", "@ErzaSukaretto ❝H-Huh..? Erza-san..? What are you doing in my house..?❞", "❝N-No..! How rude of you..! She is a dear friend of mine..!❞ https://t.co/AlbUAvAdfX", "@RuinousPrincess Best place to sleep, Rias’s lap. With a smile on her face she quickly falls asleep.", "❝He is wrong! Don’t listen to him! Always trust in Rias-san!❞ https://t.co/FqlV6dxkTB", "❝Rias-san is amazing..!❞", "@SenchoKid Just falls on the ground and.... Starts crying.", "@ZaeemulShams @FutsuNaShujinko (I answer that: Antarctica)", "@JusenkyoCursed ❝N-Not at all..! There’s several kinds of magic. The one I learned was Hair Magic. I can control my hair at will, change it’s length, it’s strength and also make it burn..~❞", "@JusenkyoCursed ❝H-Huh... Well.. More or less.. I’m a mage, and I know a little of combat..❞", "@JusenkyoCursed ❝It’s nice to meet you Ranma-san..!❞", "@JusenkyoCursed ❝H-Huh.. I-I’m Flare..!❞", "@JusenkyoCursed Can do that too-", "@RainbowGluttony (Indeed-)", "@RainbowGluttony (And an Arrington just drew her and I’m like crying ;~;) https://t.co/owsM64GFPM", "@RainbowGluttony (Launch ;~;)", "@InterpolLegend (I’m sorry but... You will live in 2019 now— Because I will follow you—) https://t.co/KW8ezyUKPB", "❝H-Happy New Year everyone..!❞", "@Hanzomaki ❝H-Huh.. I guess you need bigger clothes Asuka-san..❞", "She will not be defeated in the mistletoe game!\n\n#HakoniwaChristmas https://t.co/z4Wtq6fXQg", "Dodges with quickness!\n\n#HakoniwaChristmas https://t.co/T7rICog0Od", "Will avoid mistletoes.\n\n#HakoniwaChristmas", "❝H-Huh.. I.. I guess I’m ready for #HakoniwaChristmas.. H-Hello everyone..!❞ https://t.co/lpZjaJwM1s", "@VirtuousBelle (I have an account. @RyuNoRengoku. She has a very maternal side. Pew pew)", "@VirtuousBelle (Yours???)", "@Viseleaux AHHHHHHHHHHHH", "@AiiIuros  https://t.co/QuKpDrPuTB", "@CrawIingChaos  https://t.co/mvRxnzi1h1", "@GodlyVictor  https://t.co/2Dd3fUPff8", "@soundophile (Miro Glassfield", "https://t.co/Vcu3HBLtbp", "@RuinousPrincess For sure an hypnotic scene.", "@VIRIDIPULCHRITU (Wat-)", "@VIRIDIPULCHRITU (Then include Flare in Medusa—)", "@VIRIDIPULCHRITU (Need to be from Fate??)", "@RainbowGluttony (I didn’t watch yet XD I’m still watching the classic Dragon Ball)", "@RainbowGluttony (I didn’t watch everything yet so, I didnt see this yet-)", "@RainbowGluttony (That’s what I meant with “it’s Goku”. He will never be weak even after a fight. He will just keep going, and going, and going.... And going. But people don’t realize that.)", "@RainbowGluttony (It’s a death match, do you think they will give a break to someone strong?? They will just think “Oh look, he just finished a battle, he is weak right now”, and they will go on him. But then, it’s Goku)", "@Dakuzan @Sovrahzun @Dulsos (Omae wa mou shindeiru)", "@Sovrahzun @Dulsos (Zu'u dreh ni ulaak)", "@Sovrahzun @Dulsos (Bonu jul voth vankar do mindosil)", "@HakaiBeerus @RubberySencho ❝Huhh... Didn’t you just destroy the same planet that have all the food you love..?❞", "@Dulsos (Zu’u Mindoraan Hi)", "@RuinousPrincess  https://t.co/Wt438dllop", "https://t.co/rT8yTwrcRt", "Scary https://t.co/fZbWdntNiG", "PirateKing\n\nTwo words but together they are one- https://t.co/CMdXbz1fZd", "Isn’t a fate character. Can’t join #Fatesgiving", "@CynicismOfLife (THESE NUTS AINT WORTH IT)", "❝I-I do use bra... Sometimes..❞ https://t.co/zcFpBMaIzt", "@Viseleaux Did anyone say Flare? https://t.co/S82rF6IZRh", "@CunningBlood ❝P-People should take more care about their hair... A-And thank you miss..!❞", "@CunningBlood ❝E-Everywhere..! J-Just why everyone is losing hair?!❞", "❝Why there's so many bald people around here..?❞", "That's why Flare's dress is open. https://t.co/lax7TeyrJ9", "@Viseleaux  https://t.co/Gfo6SU6XBA", "Yes, Flare is 904% cute.\n#CutenessPercent\nhttps://t.co/x2lOmOrm6Z", "Flare is 666% sin.\nhttps://t.co/YT6wRnA9y0 https://t.co/RXBbkeJyNG", "❝Flaro not weirdo! Lyonyah is the weirdo!❞ https://t.co/SS42hjDUjj", "❝Flaro doesn't know what you talking about!❞ https://t.co/33a4Ta8ZHJ", "❝Lyonyah is the gay one!❞ https://t.co/C2KXPttGFC", "❝Nyah..!❞ https://t.co/ZXsIWWyKQc", "@AlluringTitania ❝It seems fun! Flaro wannyah try!❞", "@AlluringTitania ❝What is this hello win Armor Lady talking about Nyah?❞", "@AlluringTitania ❝Flaro doesn't know what Armor Lady talking about!❞", "@AlluringTitania ❝Flaro not weird! Armor lady weird!❞", "Is actually very embarrassed about talking like that. But she must stay in character.\n\n❝N-Nyah..❞", "❝Flaro is bored! Flaro wants food Nyah!❞", "Do you remember when you joined Twitter? I do! #MyTwitterAnniversary https://t.co/M0dsi9UFcR", "@RuinousPrincess ❝Boobie ladie attracts a buuuuunch of weirdos!!❞", "No, I'm left handed https://t.co/mYQ5kT5y6L", "He doesn't deserve happiness at all. He is a cancer that was destroyed. https://t.co/gTYwZXpA0v", "Yeah yeah, congrats on destroying everything and living in a boring world all by yourself ;) https://t.co/YydYO19QMb", "Lol no https://t.co/EOVs54RjfI", "@HanzoLegacy ❝Stinky lady! Nyahahaha!❞", "❝Flarokaka is ready for spooky month Nyah!!❞", "@AversionsTalent (They gonna find your hentais)", "@MegaLucarioX @haxsanity @Kodadile OMG *^*\n\nHere!! 2766 - 8755 - 6834", "❝Gajeel-san, stop doing this..❞", "@BeautyOfFiore ❝Where have you been?! I-It's been almost an year..!❞", "@BeautyOfFiore ❝JENNY-SAN!!!!❞", "@RuinousPrincess Nosebleeds. Passes out.", "@RuinousPrincess ❝We know you have a big bust Rias-san. I love it.❞", "@PowerfulStrauss ❝I guess that's an yes..❞", "@ExoticRindou ❝H-Hai..! And.. My name is Flare..~ Flare Corona..~ I-Its nice to meet you Rindou-senpai..~❞", "@ExoticRindou ❝F-Forgive me..! I-I Just.. Didn't know your name so.. I didn't know how to call you Rindou-senpai-san.. A-And I will make a chocolate one!❞", "@PowerfulStrauss ❝Mira-san, are tou drunk?❞", "@ExoticRindou ❝T-Then I will make..! What kind of cake do you want miss?❞", "@ExoticRindou ❝I.. Can make cake.❞", "@ExoticRindou ❝....❞\n\nFinds this totally cute.. Needs to hug it.", "Agrees https://t.co/Bqcy2oOX1h", "@GriefAmongStars « was looking toward them while she was yelling.", "@GriefAmongStars « than find someone that would waste money with your trash..!❞\n\nEven being hard to her to do such thing, she did pretty well. Everyone »", "@GriefAmongStars « This Dragon Lacrima you have is a joke!! You are just a thief by asking so much in a magical item!! It will be easier to find a dragon »", "@GriefAmongStars « This is too expensive even for a dragon lacrima..! No one will ever buy it!! Humpf!! I doubt it's even a legit one! Must be false! »", "@GriefAmongStars « for her. But it was for a good reason. She took a deep breath and then started.\n\n❝O-One hundred million Jewels?! Are you kidding me?! »", "@GriefAmongStars It would be weird for her as well since she is a calm and shy person. Attract everyone's attention by yelling would sure be difficult »", "❝What wedding is this..?❞", "@ReformedTigress ❝Happy birthday Minerva-sama!!❞\n\nAppears holding a cake that she made using the cooking skill she learned from Minerva.", "@iLyonVastia RUDE AND EVIL", "@iLyonVastia Now we can talk", "@iLyonVastia Come talk with me when you have your own city. https://t.co/DzUSV94aEK", "Will make sure to make an amazing cake using what she learned from Minerva. https://t.co/VlXgOq4zCz", "@NekomaHime (Stay safe!)", "(Tonthe)", "@ManlyHeroism ❝It will reveal her true self. Her body is still matter, but invisible, so paint would work on it.❞", "@ManlyHeroism ❝Throw paint on all her body.❞", "@HeartOfFilia ❝They are not the only ones in here, so don't worry. There's a certain someone here that if bothered will turn them into frogs.❞", "Just... Goes back to drinking her juice. https://t.co/AGK9vGwF1e", "@HeartOfFilia ❝Also.. Natsu-san ate everything in the fridge.❞", "@HeartOfFilia ❝Mira-san gave me a key. She said I could come whenever I wanted so.. Here I am..!❞", "@GriefAmongStars « selling a legit dragon lacrima?! H-How much does it cost?! I'm really interested..!❞", "@GriefAmongStars « she looked everything in the shop before paying attention to his question.\n\n❝Huh? A dragon lacrima? Are you saying that you are »", "@GriefAmongStars « to look through the shops that had there. After some time she finally spotted the fake shop and made her way toward it. Once there »", "@GriefAmongStars After going different ways Flare went to do somethings, like if she were having a common day. She went to eat something and then began »", "@HeartOfFilia She calmly looks toward Lucy and waves with a hand while holding the cup of juice with the other, drinking it with a straw.", "@HeartOfFilia Casually is in her apartment too. Drinking juice while watching TV.", "❝I'm telling you, it will not.❞ https://t.co/WDy8GWli24", "❝It will not work.❞ https://t.co/glrQ3TMfDD", "Just throws strawberry ice cream on his face. https://t.co/W9lzWPch9a", "❝Wrong. I reapear as a kid for a couple days before getting back to my normal age.❞ https://t.co/tFKhymp9Hc", "❝That purple cat isn't good at math..❞", "@HakaiBeerus (You dumb dumb)", "@JoouAkeno (On lil Mira? 👀)", "@JoouAkeno (I'm not-)", "@JoouAkeno (But Miiiiii)", "@JoouAkeno (Miiiiii)", "❝Y-You actually look cute miss..~❞ https://t.co/TWFsVXltKD", "@FutsuNaShujinko WAT", "❝H-Huh.. Miss.. Cry isn't a good thing..❞ https://t.co/rfs1JrTptR", "(That guy using Gomu Gomu no Gigant Pistol) https://t.co/OR4KC99SdP", "@FutsuNaShujinko SCREAMS\n\nEVIL PENGUIN", "@Vegito THE FUCK WAS THAT?!", "@SoulMadeOfIron « to Levy's solid script.", "@SoulMadeOfIron ❝Gajeel-san, I guess it's better you hide, otherwise you will hear a lot of words.. Or maybe.. Feel a lot of words..❞\n\nClearly a reference »", "@SenchoKid (IT IS! SHE SAID IT HERSELF!)", "@SenchoKid (Told you--)", "@BlurOfLegend (She would never want this lil thing)", "@BlurOfLegend (This Flare booty right here boi)", "@BlurOfLegend (Just being honest smhsmhsmh)", "@BlurOfLegend (I'm sorry you can't handle that) https://t.co/gM2U2OE93b", "@GriefAmongStars « you without any track. Good luck..!❞ \n\nAnd so with him leaving the place she did the same, making her way toward the central market.", "@GriefAmongStars « just set up the fake store and start selling it like if you were a real seller. I will eventually appear, don't worry, I can find »", "@GriefAmongStars ❝There's no reason to put a light trail really. If I go straight to your fake store then it will also be suspect. Don't put anything, »", "@GriefAmongStars « to appear. That's when we finally capture them.❞", "@GriefAmongStars « there waiting for the night. Once you close the door I will give a light signal so you can know where I am. And then we wait for them »", "@GriefAmongStars « attention. I'm sure they will be around listening. After that I will leave and go to a good place to stay watching the place, and stay »", "@GriefAmongStars « stop by your shop and stay interested in the price. Once you say it I will complain loudly about it, and even yell at you, to call »", "@GriefAmongStars « go and make the fake shop and start trying to sell it at a very high price. While that I will go within the crowd and eventually I will »", "@GriefAmongStars « this dark guild already knows me.. My guild already tried to find them before, so if I stay with you there they will suspect.. So you »", "@GriefAmongStars « to make new ones..! But now, going to business.. We should now go different ways.. I can't go sell the fake lacrima with you because »", "@GriefAmongStars ❝I-I still have difficult making friends.. Even though I already have a considerable number of them..~ B-But yes..! It's always good »", "@SoulMadeOfIron (DONT YOU LEAVE!)", "❝Who is RP..? And how did he die..?❞", "(SOON WE WILL EAT TOGETHER) https://t.co/4YaPnPO3KG", "(I will kick you-) https://t.co/s7XHlzb2r6", "(54 away from the @3kTable 😭)", "@iLyonVastia ❝That's how I am.. I-I'm shy by nature..❞", "@iLyonVastia ❝W-Well.. I.. I guess so.. M-Maybe..❞", "@HanzoLegacy ❝I hope you have an amazing day!❞", "@HanzoLegacy ❝Happy birthday Asuka-san!!!!!❞", "@ChildNatsu You stay up for me too", "@CoverMyFaceBean (Not from FT only. There was from other verses too)", "(Unfollowed around 50 inactive accounts- Most doesn't tweet since march-)", "(Did an unfollow spree. Unfollowed inactive accounts. If by any chance I unfollowed you or any of your accounts by accident, warn me!)", "@iLyonVastia ❝If you say so.. Then.. I guess we can try to be friends?❞", "@iLyonVastia ❝Don't come with that! You always have a cold expression on! That's why I feel so intimidated around you..❞", "@iLyonVastia ❝Well.. That's a start! And a smile looks way better on your face than that cold expression you always have on it.❞", "@Queen_Alberona @HackingAmiga (Ehhh.. I'm sorry, I honestly don't remember.)", "@iLyonVastia ❝No I don't want an autograph.. I just want you to be nice, at least once in a while.❞", "@iLyonVastia ❝But everybody is a term used when referring to every person in the world.. That includes Juvia-san.❞", "@iLyonVastia ❝You're not mean to Juvia-san..❞", "@iLyonVastia ❝You're always mean to me..❞", "@iLyonVastia ❝Why do you love to bully me that much?❞", "@TreacherySon (First one looks better)", "@iLyonVastia ❝You love to disappoint me..❞", "@iLyonVastia ❝I.. Didn't expect you to return..❞", "@iLyonVastia  https://t.co/BufimKXzsh", "(You're welcome then-- XD) https://t.co/TdSMEV8Vo9", "(I couldn't resist--) https://t.co/kjtGeHnXRH", "❝Sorry... I.. Farted by accident..❞ https://t.co/b88yEH7b5V", "@GriefAmongStars « after defeating that Dark Guild and retrieving the object was a way to make that happen.", "@GriefAmongStars « to ask people to be her friends. She agreed with what he said, because she knew it was true. So spend some time together »", "@GriefAmongStars « friends..?❞\n\nFor a long time Flare was a lonely person. Only now she was making friends, but it was still a little hard for her »", "@GriefAmongStars ❝I guess you're right.. Well.. Once we finish this \"mission\", we could spend some time together.. S-So.. Like that we could become »", "❝But you're clearly drunk..❞ https://t.co/LLsx5sKdIp", "❝Luffy-san.. You shouldn't drink that much..❞ https://t.co/T2GDHLJA68", "@TennoJoka (You're welcome &lt;3)", "@TennoJoka (You're an asshole like him so---", "@TennoJoka (I don't know-)", "@TennoJoka (Shhhh I didn't check the list before smh)", "@TennoJoka (OHHH NVM ITS JAY HI)", "@TennoJoka (YUP!! But just one question. Do we know each other??)", "@TennoJoka (The small filler. Luffy just defeated the trail man)", "@TennoJoka (I have some, but I'm not really active on them. I will get active once I finish catching up with OP. I just finished Dressrosa)", "@TennoJoka (That makes sense-)", "@TennoJoka (But-- Didn't Luffy defeat Doflamingo-- Wouldn't that put Luffy in a higher position than him? 👀👀)", "@GriefAmongStars « she wanted so much to stop the thieves that she didn't hesitate that much on trusting that guy, even more because he tried to help her.", "@GriefAmongStars « some trust issues yet because of her past at Raven Tail. So she always hesitated before trusting someone. In this specific situation »", "@GriefAmongStars « I accepted to freely to help you. But.. Can I really trust you? I'm sorry for asking that, but I need to be sure about it.❞\n\nFlare had »", "@GriefAmongStars « hope it works. I'm tired of seeing people sad because they were stolen by these thieves.. That's something I really hate.. That's why »", "@GriefAmongStars ❝H-Huh.. That's.. Basically what I said Thoran-san.. Except the part of following them.. I guess that works pretty well. I honestly »", "@TreacherySon ❝Usted está equivocado! Ellos son.. De lo mesmo tamaño..❞", "@TreacherySon (Yup! I'm aware! Just a little lazy to add the Spanish keyboard to add that ones--)", "(Man it's been so long since I last talked in Spanish. I learned it when I was a kid and never used it again. I don't remember it so much)", "(Yeah I'm aware that in Spanish we use the ? Or ! Upside down at the start but yeah-)", "@TreacherySon ❝Usted es grosero..! Y no! Ellos no son..!❞", "@TreacherySon ❝Mi nombre es Corona. Y mis tetas no son enormes..!❞", "@TreacherySon ❝Corona?? Estoy aquí..!❞", "WILL MANAGE TO ESCAPE FROM HIM https://t.co/dbKiIziUW2", "@iJanenba ❝Just.. Because..❞", "@iJanenba ❝Huh... Because...❞", "@HackingAmiga @Queen_Alberona (Well, okay then.)", "STILL RUNS AWAY https://t.co/tYCMJbHaTu", "@DeathlyBeing ❝Thank you.. Even after calling me an animal..❞", "@HackingAmiga @Queen_Alberona (I'm sorry I don't remember :/)", "@HackingAmiga @Queen_Alberona (What Mira?)", "RUNS AWAY https://t.co/F81l0E1hZv", "@DeathlyBeing ❝No..! It's just clothes..! It's not to get a partner..!❞", "@DeathlyBeing ❝E-Eh..?! There's no such thing as mating season for humans..! That's an animal thing..!❞", "HER HAIR ISN'T FOOD https://t.co/7EESmyNYq4", "@DeathlyBeing ❝H-Huh.. It's just.. An outfit.. Huh.. Yes..❞", "#SeductiveSunday stealing Brandish's look. https://t.co/3vm69w5lZT", "I'm on it 👀 https://t.co/h4zfbMpUDY", "(Does my RTs count or--) https://t.co/OcHdPJWhKL", "I'm sorry I had to- https://t.co/msSNHyCjZK", "@Archaerockogist ❝Excuse me.. What kind of lotion you used to change color??❞", "(Well, welcome back!! It's nice to see you again!) https://t.co/zRACaoQj1l", "(That-- That was an unfair play!!) https://t.co/esPkC9D0B1", "(I'm getting more into One Piece. I hope I manage to find my place in the verse. Shit about to get lit. Luffy VS Doflamingo)", "(I'm sorry @DraculeDawn, but you lost the crown of heavy sleeper already--) https://t.co/hs7FH5StdG", "(Roy's crew is so fun I swear)", "(That wasn't a nap-- It was a goddamn hibernation--) https://t.co/1cZM95vESo", "(Roy everyone is seeing that-)", "@GriefAmongStars « show up, we capture them.❞", "@GriefAmongStars « shop and going home, leaving the false lacrima inside of the fake shop. While that I will be hidden waiting them appear, and once they »", "@GriefAmongStars « want to buy and you still will attract the thieves. Once night comes they will for sure be watching you. You pretend you're closing your »", "@GriefAmongStars « What if you pretend that you are selling the lacrima? And announce to everyone, but for a very salt price. Like that no one will »", "@GriefAmongStars « help so she was focused on that.\n\n❝I'm afraid my guild can't help.. Most of my guildmates are out doing missions.. But.. I had an idea. »", "@GriefAmongStars « at her chest at all. She was used with that. Her expression got serious again, returning to the matter of the thieves. She wanted to »", "@GriefAmongStars ❝E-Eh.. It's.. Not a problem at all..❞\n\nShe didn't mind that he noticed the crest on her chest, and wouldn't mind if he were staring »", "@KurokamiHeiress ❝H-Huh.. Why are you so small Medaka-san..?❞", "@KurokamiHeiress Catches the Minidaka.", "@SomniumVocatus (I want chocolate please)", "@SomniumVocatus Gives to her. https://t.co/rlKZWmGo0U", "❝I'm not psychotic..! And what does this even have to do with the talk..?!❞ https://t.co/pDipsTjggl", "❝I-I'm not..! I'm sorry miss, but you can't force me to do that..!❞ https://t.co/LkhVovbw8M", "❝Food? H-Huh.. I'm not a maid miss..❞ https://t.co/R2vVfGfvSO", "❝S-So.. How can I help you miss..?❞ https://t.co/r2USUKhXL1", "❝I'm not depressed.. That's how I talk because I'm shy..❞ https://t.co/s5kbi1uaRE", "❝I will.. Stop bothering you now miss..❞ https://t.co/GvyT3ZI69f", "❝Well.. That's a good reason I guess..❞ https://t.co/EqAATsHm79", "❝H-Huh.. You can but.. There isn't a specific reason..?❞ https://t.co/L3klr7IaR9", "❝Why are you hidden like that..?❞ https://t.co/NqSPH7xOLN", "@LustfulMotions ❝Huh.. You okay there miss..?❞", "@KurokamiHeiress (Dunno-)", "@KurokamiHeiress (MI STOP)", "@KurokamiHeiress I'm an adult!", "@KurokamiHeiress . . . . . . .", "@KurokamiHeiress Hair di--", "@KurokamiHeiress It means ai some point she will.", "@KurokamiHeiress Is afraid of the yet.", "@KurokamiHeiress Did she learn Flare's magic too or--", "@KurokamiHeiress She copied Flare's hair!", "@GriefAmongStars « need to wait the night come. It's when they act. Where should we leave the \"lacrimas\"?❞", "@GriefAmongStars « A smile formed on her lips and she clasped her hands together in excitement.\n\n❝This sure will be a perfect bait for them. Now we just »", "@GriefAmongStars « dragon slaying lacrima. She was really impressed with it.\n\n❝T-That's impressive..! It looks and feels real..! Good job Thoran-san..!❞ »", "@GriefAmongStars Her eyes focused on his magic. The illusion quickly forming and soon having the same shape, size and even the magical sensation of a real »", "@GodlyVictor « alcohol. Just like she said, her tolerance to it was really low.\n\n❝S-So.. What should we do now Achilles-san..?~❞", "@GodlyVictor She followed him to the couch taking a seat next to him. She took a few more sips and soon a blush appeared on her cheeks because of the »", "@RulingTheHarbor (NAH)", "@RulingTheHarbor (NO POUTING)", "@RulingTheHarbor (BOOBS**)", "@RulingTheHarbor (Big Meaty Boobs*)", "@KurokamiHeiress Settled then-", "@KurokamiHeiress Will be the First Lady then.", "@KurokamiHeiress Can't be someone that agrees, cuddles and fu-- with her???", "@KurokamiHeiress Cries.", "@Mugiwara_Sencho ❝What.. What are you talking about Luffy-san..? Calmed down since what..?❞", "@Mugiwara_Sencho ❝W-What..? Red-headed menace..? I-I have no idea of what you're talking about Luffy-san..❞", "@HeartOfFilia Well, she couldn't blame Blondie. She also had tears in her eyes. Nothing bad at all.\n\n❝How are you doing Blondie??❞", "@GriefAmongStars « water dragon lacrima, it will flow with blue energy, and things go on. They are pretty easy to imagine, but hard to find.❞", "@GriefAmongStars « a small glass sphere with energy flowing inside of it.. Like, if it's a fire dragon lacrima, it will flow with red energy, if it's a »", "@GriefAmongStars « quantity of magic, just by staying near one you can feel the magic from it.. But, in case this isn't a trouble for you, just imagine »", "@GriefAmongStars ❝Well.. Maybe that can work.. If you manage to put enough magic energy in the illusion that is, because dragon lacrimas have a great »", "@GodlyVictor « This is the best wine I ever tasted..! It's really good Achilles-san..!❞", "@GodlyVictor « tolerance to alcohol, but she knew what was good and what wasn't, and that wine sure was something of good taste.\n\n❝W-Wow..! This.. »", "@GodlyVictor Gently she picked the glass that he offered and took a sip of it. A smile formed on her lips once feeling the taste. Maybe she had low »", "@HeartOfFilia ❝It's been so long Blondie..! I missed you..!❞\n\nShe said while keeping the tight embrace.\n\n❝Where have you been??❞", "@HeartOfFilia And suddenly she was already next to the girl and then..... CATCH!!!! \n\nShe jumped on the celestial mage, hugging her tightly.\n\n❝BLONDIE!!❞", "@HeartOfFilia ❝BLOOOOONDIIIIEE!❞ \n\nJust yells from far away. Getting closer, and closer.. and closer......", "❝Nice to see you again Nami-san..!❞ https://t.co/pDA0XG8Qpd", "❝Huh... From what I know.. He is the captain, and Zoro-san is the co-captain..❞ https://t.co/SASBZaLFo8", "❝I thought the Captain was Luffy-san..❞ https://t.co/qfMiVg7r0l", "@GodlyVictor « I guess that a single glass will not hurt, right..?~❞", "@GodlyVictor « just a small quantity of alcohol would let her head swirling, but he was being so nice that she didn't want to let him sad.\n\n❝B-But.. »", "@GodlyVictor ❝H-Huh.. I.. I'm not sure.. My tolerance to alcohol is very low.. I get drunk easily..❞ \n\nShe hesitated at first because she knew that »", "@KuinTitania ❝But.. Was that really necessary..?❞", "@KuinTitania ❝Erza-san.. You're so violent..❞", "@GriefAmongStars « but you need to think a little more in the plan to find them..❞", "@GriefAmongStars « I have no idea where to find one of them.. And well, that works for any magical item of great value. I can help you chase them »", "@GriefAmongStars « are the dragon lacrimas.. Lacrimas that possesses the dragon slaying magic.. But they are very rare, so it's not that easy to find.. »", "@GriefAmongStars ❝Well, I can surely help but... How would you even get something so desired like that? I mean.. The magic item that most people seek »", "❝DNA tests doesn't lie!❞ https://t.co/dLpC9W783e", "@Viseleaux ❝Now the DNA test confirms... Xavier-san /IS/ Steven-san's son!! And together with it we discover that.. Achilles-san also is!!❞", "@GodlyVictor « big..! That's expensive even for me..!❞", "@GodlyVictor « was good looking and clearly expensive, so she was amazed with all that.\n\n❝This place is very beautiful..! You live here alone? It's so »", "@GodlyVictor « since in her village that stories were unknown to the giants. But to his second question, she indeed liked the place. Everything »", "@GodlyVictor ❝You have a legend..?❞\n\nYes, she had no idea of what he was talking about at all. In fact she was pretty ignorant about a bunch of things »", "@GodlyVictor « see the place, but it was difficult to do so while being carried like that.\n\n❝C-Could you put me on the ground now please..?❞", "@GodlyVictor ❝We.. Already arrived? Didn't you say it was far from where we were..? And what place is this..?❞\n\nShe tried to look around to »", "❝Humpf.. I guess I have no choice then..❞\n\nShe said before crossing her arms and pout while being carried away. https://t.co/Rfcfg12Qdx", "❝But.. Do I really need to be carried..? I mean.. I have legs..❞ https://t.co/r6W9phSfOP", "❝E-Eh.. Ehhh??! B-But..! I-I'm not any kind of trophy..! I'm a person..!❞ https://t.co/9cTy0eLPjr", "(NOTHING) https://t.co/XcUfVPrkOH", "(NEKO) https://t.co/e5BY5fnsNX", "(I'm with 16 ongoing RPs. I had 7 last week-- what did I do-- And I keep accepting more, and the surprise is, I'm managing to keep up!)", "@RuinousPrincess (I would but you never continue I cry--)", "❝H-Huh.. What.. What are you doing Achilles-san..? Where will you take me..?❞ https://t.co/nwpxKuUsD9", "❝I really don't know how I got in that situation.. But.. How can I repay you..?❞ https://t.co/xVhDYqeMbS", "❝Huh.. Thank you for that..❞\n\nAnd so she uses her magic to coverlet body with her hair, making it stay like a dress. https://t.co/qoDzdXt6XO", "❝I said.. I'm not sure.❞ https://t.co/JQ1PILQ21a", "❝Hmmm... Hmm hmmm hmm.❞ https://t.co/YneVEBozt9", "#SeductiveSunday https://t.co/3wm40QS7BU", "@GriefAmongStars « of other fishes.. So.. What is your plan..? How would you make them steal exactly what we want them to steal..?❞", "@GriefAmongStars « we want..? Because.. Like I told you, everything here is magic based so.. It's like trying to get a shark with a fish, in a sea full »", "@GriefAmongStars « to do that as well..? I-I mean, of course I would like to help but.. How can you be so sure that they will want to steal the object »", "@GriefAmongStars ❝Huh... W-We..?❞\n\nUntil now she wasn't aware that she would need to help him, so she was surprised once he said \"we\".\n\n❝I.. I'm supposed »", "@GriefAmongStars « ghosts.. So like I said.. During night just stay alert for explosions or anything like that.❞", "@GriefAmongStars « thing you can do is stay alert to anything during night. They cause a lot of ruckus.. But no one sees them, that's why they are called »", "@GriefAmongStars « disappear. People are calling them Ghost Thieves. And also, they only attack during night so.. If you want to find them, the best »", "@GriefAmongStars « parallel worlds. And for your question, no one knows where they are. They simply appear out of nowhere.. Steal what they want.. And then »", "@GriefAmongStars « everything that he said, and then she continued.\n\n❝About the another world thing, it's not necessary to explain. I'm aware that there's »", "@GriefAmongStars « if this laser you're talking about isn't powered by magic.. Then it sure is advanced..❞\n\nShe stopped talking for a moment to process »", "@GriefAmongStars ❝Technological Weapon huh..? Yes indeed.. Every equipment here, from lamps to massive destruction weapons are all powered by magic. So »", "@GriefAmongStars « you're not from around here... What kind of weapon they stole that it's necessary someone from outside to get it back..?❞", "@GriefAmongStars « mentioned.. There's a dark guild getting notoriety lately.. They have been stealing magical items from every kind.. But you said »", "@GriefAmongStars « number of dark guilds decreased a lot after the death of the dark mage, but even like that there's some of them.. And now that you »", "@GriefAmongStars ❝My name is Flare, it's nice to meet you Thoran-san~❞ \n\nA smile formed on her lips before she continued to talk.\n\n❝And well, the »", "@SenchoBonney (BETTER?!)", "@SenchoBonney (AHHHHHHHH)", "@SenchoBonney (WAKE UP BONNEY)", "@PhantomYokai Is confused!!", "❝Oh no.. Another lost son for Steven-San..?❞", "@PhantomYokai RUNS", "@PhantomYokai Wat--", "@PhantomYokai (I didn't unfollow tho smh dunno what happened)", "@PhantomYokai Wat-", "@GriefAmongStars « group burned and passed out.\n\n❝Thank you for trying to help, but they were no trouble..~❞", "@GriefAmongStars « minute she got out from the smoke cloud, going toward the guy that wanted to help. Behind her there were the group of guys on the »", "@GriefAmongStars « the hair strand that was wrapped around the guys exploded. A cloud of smoke stayed in the place for around a minute, and within this »", "@GriefAmongStars « fire and she deattached it from the rest of her hair.\n\n❝Kamishigure: Bakuhatsu Hebi!!❞\n\n『Hair Shower: Explosive Snake』\n\nOnce saying that »", "@GriefAmongStars « got the form of a snake and started wrapping around the guys one by one until all of them were wrapped. Finally the hair strand got on »", "@GriefAmongStars « and would start the attack, but before they could do anything Flare loosened her hair and controled a single hairlock. The hairlock »", "@GriefAmongStars « stop, but then she talked with him.\n\n❝Don't worry! They will not do anything with me.❞ \n\nOnce she said that the guys started cursing her »", "@GriefAmongStars « even giving attention to them. She just stopped walking and let them talk. She saw that other guy getting closer and telling them to »", "@GriefAmongStars « her names and saying what they would do with her and her body. Clearly that would lead to a rape. That if she wasn't a mage. She wasn't »", "@GriefAmongStars Flare was just making her daily duties, and while doing that a group of guys started surrounding her on the street. They were calling »", "❝So.. Xavier-san isn't son of Chukan-san.. So Steven-san had other girl??❞", "IT DOES https://t.co/FESnGmbGQi", "❝So Steven-san is Xavier-san's father... That makes a lot of sense..!❞", "@KamiNoChobatsu (What a good civilization-)", "@SirMeliodas (Here says you still follow me so--)", "@Viseleaux (DON'T BLAME ME)", "@Viseleaux @Nozanpurinsesu @Okaiyen (For a moment I thought it was a pic of Chukan pregnant. Then I saw it was just a giant dot)", "@OruFoWan (I don't know-ebi)", "@OruFoWan  https://t.co/ROXg9GE64j", "@RuinousPrincess ❝Indeed! I don't know if this is good or bad though.❞", "@RuinousPrincess ❝I-I've been good..! Nothing much changed really since last time we saw each other so.. I can say I'm still the same..~❞", "@RuinousPrincess ❝Where have you been Rias-san? It's been so long already..❞", "@RuinousPrincess ❝Rias-san, I missed you..!❞", "@RuinousPrincess Feels protected and safe.", "Just... Hugs @RuinousPrincess.", "@ShadouSureiya ❝So.. That explains why you always go to the pool when the girls are bathing there..!❞", "@ShadouSureiya ❝You were complaining that you missed such event.❞", "@ShadouSureiya ❝You want to see the girls using swimsuits.❞", "@PhotonHun (More or less, like, I know what the words means and all, but for conversation I'm not really good)", "@PhotonHun (ALLÍ MIL COSAS VOY A VER)", "@ShadouSureiya ❝Don't be a pervert Rogue-san.❞", "@ShinkaiAkane (I WILL)", "@ShinkaiAkane (YA)", "@ShinkaiAkane (SHHHHHH)", "@ShinkaiAkane (NEKO NEKO)", "@SomniumVocatus (Agrees.)", "Third in Achilles judgement as well.\n\nShe is happy.", "Third place in Medaka's judgement.\n\nGood enough for her first try!", "The Four Hoursemen of the Apocalypse https://t.co/8wjaqI9OII", "(13 tweets-- I lost a million times) https://t.co/AJCOeBWWBH", "(I already lost) https://t.co/Db1HMcKZYB", "@KurokamiHeiress (Here!)\n\nhttps://t.co/sbtipTaeMl", "« With the swimsuit that she would use chosen, she just posed for the contest.\n\n❝I-I.. I guess it's like that..?❞\n\n#MVYachtParty https://t.co/eNtsdMNXeZ", "Now it's official, she was subscribed in the swimsuit contest. Of course she was embarrassed because she wasn't used with such thing. »", "@KurokamiHeiress (There's any tag for the contest?)", "@KurokamiHeiress (But wait, I do that now or?)", "@KurokamiHeiress (I guess I can do that)", "@KurokamiHeiress (So basically tweet a photo of her using swimsuit-)", "@KurokamiHeiress (Define be sexy)", "@Viseleaux ❝H-Hai Steven-san..!❞", "@ShinkaiAkane (Notices Neko)", "@KurokamiHeiress (If you tell me how it works, yes)", "@KurokamiHeiress (MIIIII)", "Her confident side ended up winning. Decided to join the swimsuit contest.\n\n#MVYachtParty https://t.co/dCNbXfp7sd", "@VirtuousBelle ❝M-Miss.. Put on some clothes..❞\n\n#MVYachtParty", "« insecure side is winning.\n\n#MVYachtParty", "The confident side of her head is fighting the insecure side of her head, deciding if she should join the swimsuit event or not.\n\nThe »", "@Viseleaux ❝M-Maybe next time..? I'm not sure.. B-But thank you Steven-san..!❞", "Aka particular submarine- Because she is rich- just doesn't tell anyone- https://t.co/yul0HHQCZS", "She have her methods- https://t.co/HvZrTbNGqw", "@Viseleaux « is too low, so I prefer to stay away from it.❞", "@Viseleaux ❝H-Hello Steven-san..! W-Well.. I'm not confident enough for a swimsuit contest.. And don't worry about the drinks.. My alcohol tolerance »", "She knows- https://t.co/TZM2Lean2a", "......... No.. https://t.co/1i6qwEPlCv", "Doesn't know why she is being set up. https://t.co/0GMLO72mQU", "❝W-What is happening right now..! I.. Just arrived.. So I'm unaware of the wvents..❞\n\n#MVYachtParty", "Is probably very late to it. She didn't manage to wake up. But... Appears.\n\n#MVYachtParty", "(I don't even look at how many followers I have anymore-- I remember that I had reached 2900?? Lost 10 follows then lol)", "@PsychoInRed ❝H-Huh.. I guess so..? I-I'm sorry but.. Do I know you..?❞", "❝Everyone is invited..! It will be fun..!!❞ https://t.co/usS9zEll4i", "@AnjeraBaruzakku (Not so shocking-)", "@AiiIuros Nosebleed? Nosebleed.", "@ZennoNoJoou Cries", "@RubberySencho Feels praised because he remembered her name again. https://t.co/8NzQG6wh6h", "@RubberySencho ❝Welcome back Luffy-san..!❞", "❝I will just go to sleep then..❞", "@SlayerOfLaw ❝I.. I'm confused..❞", "@SlayerOfLaw ❝But.. It is what is happening..❞", "@SlayerOfLaw ❝Apparently you and Gajeel-san are fighting..❞", "@daemoniium ❝Give water instead, to refress everyone's mind.❞", "@daemoniium ❝Mira-san, I'm pretty sure that beer will only make things worse..❞", "Just blushes because of the ideas she had in her mind. https://t.co/AzL0MSdzvY", "Is confused about everything.", "@HolySting @InazumaNoKami ❝I-I.. I'm sorry for being scared..❞", "@InazumaNoKami @HolySting ❝H-Huh... O-Okay then..❞\n\nAnd so she got out from behind the table. https://t.co/pyhwrJFaKO", "@InazumaNoKami @HolySting ❝You will not hurt me at all..?❞", "@InazumaNoKami @HolySting ❝B-But.. But you're scary... A-And there's no such rule.. You all hide from Minerva-sama..❞", "@HolySting @InazumaNoKami Is just trembling behind the table.", "@HolySting @InazumaNoKami SCREAMS!!\n\nHIDES BEHIND A TABLE.", "❝Size isn't the problem.. I mean, my Village is full of giants. He just.. Is scary..❞ https://t.co/9kAY8TOcSM", "❝B-But.. He is very scary..❞ https://t.co/MO5yN3PsRV", "❝Orga-san is around.. I.. Huh.. I will hide a little..❞", "Would ask to join Minerva, but it wouldn't be a good idea because of her alcohol tolerance.", "@ReformedTigress (But but but)", "@ReformedTigress (You can insult me-)", "❝Sting-san is broken..?❞", "❝Natsu-san is a pervert..❞ https://t.co/w90lhQqXYW", "❝Sting-San is... Hmm... Bird's Nest Hair!❞", "@HolySting ❝B-But it's true..!❞", "@HolySting ❝She will see that you're back sooner or later.. And once that happen.. Well...❞", "@HolySting ❝Just you wait Minerva-sama...❞", "@HolySting ❝But it was too much time..! D-Don't do that again Sting-san..!❞", "@HolySting ❝But you didn't warn anyone..!❞", "@HolySting ❝It's been a while..!!! Where have you been?!❞", "@HolySting ❝STING-SAAAAAN!!!❞\n\nAnd suddenly she embraced him tightly.", "RT @MegaLucarioX: MARSHADOW EVENT\n\nRT For A Chance To Win A Untouched Marshadow Event From Japan Alongside Other Events\n\nMultiple Winners\n#…", "@Sovrahzun (Do you know who have that? Miles Morales)", "❝Let Minerva-sama drink whatever she wants... Erik-san drinks poison and no one complains..❞", "#CuteSunday https://t.co/wPemJmKsYX", "@daemoniium (FLUFFY FLUFF)", "@daemoniium (BUT VAL)", "@daemoniium (I'm innocent-)", "(100 away from 3000. Wow *^*)", "@ShiroiKibou ❝Well, I don't. Because they are having fun, and I know they will come back soon..!❞", "@ShiroiKibou ❝Of course you will Sting-san..! Why wouldn't you?! They are strong..! They will come back..!❞", "@ShiroiKibou ❝Sting-san..? What's the matter..? What is happening..? Please tell me..❞", "@ShiroiKibou ❝You've been too tired lately Sting-san.. Are you okay..?❞", "@ShiroiKibou ❝H-Huh.. Sure Sting-san..~ S-Since it's not a 100 years job..❞!", "@ShiroiKibou ❝H-Huh?! M-Me?! N-No Sting-san..!! I-I'm not capable of such thing..!❞", "@ShiroiKibou ❝I'm just telling you to be careful, because they are very hard..❞", "@ShiroiKibou ❝Well.. They are pretty hard Sting-san.. That's why no one picked them for over 100 years..❞", "@ShiroiKibou ❝Me and Yukino-san talk though! We even make other things together, like eat, or buy things.❞", "@ShiroiKibou ❝Rogue-san isn't around? Or maybe Yukino-san?❞", "@ShiroiKibou ❝Because Blondie went with him, and she warned me through the iLacrima.❞", "@ShiroiKibou ❝Didn't Natsu-san go in a 100 years job..?❞", "@SwordStainedRed ❝Erza-san.. Why did you steal my clothes?❞ https://t.co/4Jkn1NHY2D", "@ShiroiKibou ❝The request board have some yet. But it's the end of the day so, probably there's only boring ones..❞", "@ShiroiKibou ❝W-Well.. That would be nice Sting-san.. If it will not be any trouble.❞", "@ShiroiKibou ❝Rogue-san barely talks with me to be honest..❞", "@ShiroiKibou ❝Well.. She helped me a lot when I joined the guild.. And she is pretty much my best friend inside Sabertooth.❞", "@ShiroiKibou ❝Huh.. Because.. She is Minerva-sama? I don't need another reason.❞", "@ShiroiKibou ❝Good luck then Sting-san..! Even though I'm pretty sure she will always win.❞", "@ShiroiKibou Knows her secret. But will not reveal that she cheats.\n\n❝I have no idea at all..❞", "@ShiroiKibou « your size.❞", "@ShiroiKibou ❝Well.. Not more than her Sting-san! She wins that without worrying about getting full, while you eat at the point of staying three times »", "@ShiroiKibou ❝Well.. That's because you compete with Minerva-sama in something that she will always win Sting-san!❞", "❝Some things never changes~❞ https://t.co/z0OklOTE0h", "❝Even I know who is Simon..❞", "❝Minerva-sama won again the food competition. Not a surprise. I only join it because I get to eat more of her food!❞", "❝Now me and Blondie can stay together...!❞\n\n#OOC #ButNotSoOOC", "@RuinousPrincess ❝Good afternoon Rias-san~❞", "@LustfulStrauss (👀)", "@LustfulStrauss (That's fine, just keep her--)", "@SexyMerc Screams", "@LustfulStrauss (Pleeeease)", "@LustfulStrauss (Keep Mira!!!)", "@LustfulStrauss (Miiii)", "@RaijinshuRyu (Just pulls him along with her hair instead.)", "@RaijinshuRyu (Saved him with quickness)", "@HairKorona The hug sure was unexpected, but even like that she returned it to her twin, embracing her tightly.\n\n❝S-Sure thing..!❞", "@HairKorona ❝I am you, you are me. I would hate to see you sad, so cheer up..!❞", "@HairKorona ❝I know it's hard.. After all these years doing what Ivan asked, believing that it was the right thing.. But don't worry, you'll get there~❞", "@HairKorona ❝Why don't you just ask for a fight then..? I'm sure they will accept it if you ask kindly..!~ They never refuse a fight after all.❞", "@HairKorona ❝That's not fun you know..? What if they take it serious and start hating you? You don't want that do you?❞", "❝I'm not crazy..❞", "@HairKorona ❝Why are you insulting Fairy Tail and even searching fight with them? After everything they did to us?❞", "@HairKorona ❝Now what do you think you're doing?❞", "Looks at @HairKorona from afar.\n\nJust shakes her head in disappointment.", "@DeusEspada Cries", "@SenchoBonney ❝So.. What will we do now?? Anything in mind? I'm up to anything!❞", "@KnightOfFairies « can I help you Erza-san..?❞", "@KnightOfFairies « games or even in the fight against Acnologia made her fearful of the other redhead. Even like that she answered and didn't run.\n\n❝H-How »", "@KnightOfFairies « you..!❞\n\nShe didn't have time to actually approach and befriend with Erza before, and everything that she saw Erza doing, be it in the »", "@KnightOfFairies « that familiar voice. She just turned around and finally saw who was calling her.\n\n❝E-Erza-san..?! H-Hello there..! It's nice to see »", "@KnightOfFairies She was having a common day. At that moment she was just visiting Magnolia, but wasn't expecting to meet Erza at all. \n\nSuddenly she heard »", "@FutsuNaShujinko Flies away.", "(I'm sorry--) https://t.co/PeAacXbaN7", "@FutsuNaShujinko Is turned into a cat instead. https://t.co/l4LTz7g2EK", "(You got it right? Riiiight??? Excuse imma kms) https://t.co/DSqtdqn9oC", "(That parasite joke wasn't even funny wtf am I doing 😂)", "@IngeniumHero ❝Huh... Are you a kind of parasite or something like that..?❞", "@RuinousPrincess ❝Good morning Rias-san..!❞", "@ObsidianHeavens She was fine with anything, and since it was suggestion from the younger girl, she just left her choose.\n\n❝This one looks good enough..!❞", "@ObsidianHeavens ❝I guess it's the best choice.. Hmm.. Help me please, which one you find good?❞\n\nShe said while looking through them.", "@FutsuNaShujinko Once again walks away.", "@FutsuNaShujinko Doesn't see anything special in a stone.", "@ObsidianHeavens ❝Huh.. But I have no idea what to choose..❞", "@ObsidianHeavens ❝W-Well.. Okay then.. If you insist that much..❞", "@ObsidianHeavens ❝That I will need to refuse. I can pay for them! You will not waste any money with me..!❞", "@ObsidianHeavens ❝What do you mean with cover for me?❞", "@FutsuNaShujinko Just.... Walks away.. Slowly..", "She had no way to stop her now, neither could she escape. https://t.co/362av6cMuY", "❝B-But Chelia-saaaaan..!❞ https://t.co/bcLF2dldkf", "@FutsuNaShujinko Doesn't know what's happening.", "❝T-There's no need for that Chelia-san..! None of my clothes require them..!❞ https://t.co/13kucZTn0f", "❝I... Don't really.. Have any..❞ https://t.co/h6yz6m0dqV", "@ScouterKakarot (Naaaah)", "❝But Chelia-san, it's hot today..!❞ https://t.co/s6mDp2iRlp", "@Dakuzan Throws him away with her hair!", "@Dakuzan Just laughs st the scene", "@Dakuzan Doesn't know what to do.", "@Dakuzan ❝Huh.. Bless you..?❞", "#SeductiveSunday https://t.co/BKnYBPsZeT", "❝I really recommend staying away from it.. The stories from people the days after I drank alcohol wasn't very good..❞ https://t.co/6GXtDohNlf", "❝Well, I don't understand the attraction at all. Just one cup of anything alcoholic and I already get weird..❞ https://t.co/sC2lG1S14t", "❝So.. In a way you're judging who is thinking about drinking so early..~❞ https://t.co/Fv67Kp0P6J", "❝Then you're saying that you're shaking your head for no reason at all?❞ https://t.co/yfMbkuRb4Y", "❝Don't lie to yourself Chelia-san.❞ https://t.co/x294V2Hc8V", "❝Chelia-san is judging.❞", "❝D-Don't kill me..! I'm sorry..! I will not say more anything I swear..!❞ https://t.co/51tl1shCjO", "❝Erza-san will get drunk? Excuse me for a moment. I need to get out from the continent.❞", "@ReformedTigress « don't regret leaving my village, considering what you said..~❞", "@ReformedTigress ❝H-Hai.. You're right Minerva-sama.. I-I mean.. I'm very happy with you all here..~ I do regret hurting people.. B-But.. I guess I »", "@ReformedTigress « each other. Just that words from Minerva were enough to get the message she wanted to pass.", "@ReformedTigress ❝I-I.. I don't think so... I guess I wouldn't even have met you all..❞\n\nShe then looked down and pressed her index fingers against » https://t.co/TbJy6S2rBB", "@ReformedTigress « first place..❞", "@ReformedTigress ❝The things you talk about him.. Apparently he was worse than Ivan.. I wish Ihad never met him.. I should've never left my village in the »", "@ReformedTigress « now, it's unnecessary. Just.. Count with me for whatever, I can't do much, but I will do my best..!❞", "@ReformedTigress « as our leader. I mean.. He deserves it. And I understand your point.. I'm glad I didn't meet this Jiemma.. But lets not talk about him »", "@ReformedTigress ❝You can count with me on that too, even though I don't really have any power in here.. B-But I do want people to recognize Sting-san »", "« him because they are afraid of you. A lot of members doesn't take him serious at all, unfortunately..❞ https://t.co/fCU86VriRA", "❝I didn't say disrespect Minerva-sama. I respect everyone in the guild, but I don't know.. Sometimes I think that some people only respect » https://t.co/fCU86VriRA", "❝That may be true, but everyone treat you with way more respect than how they treat Sting-san, and that's actually funny.❞ https://t.co/036zvYbMqa", "❝So you just leave Sting-san with it, even though you're still the one to rule..~❞ https://t.co/ViWjvxkTU9", "❝Minerva-sama should be the Guild Master.❞", "@SolitaryDeity (👀👀👀)", "Late = 27 seconds later.\n\nSorry couldn't resist. https://t.co/ALyXJg04NK", "@SolitaryDeity (You know what's weird?? Rp as a character that you hate. I wonder who do that--)", "@TheRainWomanx  https://t.co/xzsDC0N51Y", "@TheRainWomanx (Dafuk is a Truvia)", "Just sips on her juice. https://t.co/jegdb9osQD", "At least he was there. She simply appeared. Out of nowhere. Is happy that she could help a little anyway. https://t.co/SbOF6EK51F", "❝Minerva-sama, Just don't break her arm please.❞ https://t.co/OpHgRGRFie", "❝Hello everyone!! It's a good day!! Lets all be happy and contemplate the bright sun!!❞", "@SenchoBonney ❝That's what we will see Bonney-saaaaaan!~❞", "@KajiNoOwari ❝I'm not the one that will take your life if you do anything to Sabertooth. Minerva-sama will.❞", "@ReformedTigress Territory portal inside her stomach, making all the food go to somewhere else, giving always space for more and more food--", "She knows Minerva's secret to always win the Eating contest. But will not tell anyone. You're safe Minerva.", "@Fullbuster Just keeps doing whatever she was doing, completely ignoring his insignificant existence.", "@KajiNoOwari ❝Huh.. Who said anything about killing?❞", "@KajiNoOwari ❝I'm just warning you.. Try anything and you will pay with your life...❞", "@KajiNoOwari ❝My hair will eat you before you try anything..❞", "@KajiNoOwari ❝I want to see you try...❞ https://t.co/LfwkbqAfA5", "❝Well, that's nice to know..! I hope everything is going well for you~❞ https://t.co/FyxTQtosJB", "❝And what about Juno?❞ https://t.co/7wNjwcT3NG", "❝Minerva-sama, who is your tiger?❞", "Wonders who is Minerva-sama's tiger.", "@FistOfLightning ❝I-I.. Huh.. Thank you..?❞", "#SeductiveSunday https://t.co/NyZOxbGcTt", "❝Huh.. Okay.. I will just.. Stay on my corner now..❞", "❝Minerva-samawill stay like Bacchus-san. But.. Minerva-sama have extreme swing moods when she is drunk.❞", "@DrunkenBacchus ❝I get seduced all the time.. Even though she doesn't really do anything to do that on purpose toward me. It still happens.❞", "@DrunkenBacchus ❝She seduces anyone to be honest.❞", "❝I will not tell anyone about your drunk secret Minerva-sama.❞ https://t.co/4pawHuLIKs", "Casually wasn't in said event. So she was in the guild. And saw everything. Everything. https://t.co/sYneMBJcFX", "Pat pats @RubberySencho to make him feel better since he will stay on the Discipline Corner for half a day.", "@RuinousPrincess Shots are good", "@RuinousPrincess DOESNT SAY ANYTHING!!! JUST HUGS THE SHOT OUTTA HER", "@RuinousPrincess HUUUUUUUUUUUUGS TIGHTLY!!!!!!!!!!!", "@SenchoBonney (Poor Bonney ;~;)", "@SenchoBonney (I think that her head tried to get out from the box to get more candies)", "@SenchoBonney (It makes sense since she loves candies--)", "@HakaiBeerus ❝Alien hairless cats have ass..?❞", "@SenchoBonney (GIMME)", "Didn't know that @ReformedTigress had a food company. https://t.co/dWx8a6lvXL", "@ReformedTigress (I'm planning in making a new OC so.. I guess I could make her join it, if it wouldn't be a bother that is.)", "Wants to be part of Team @ReformedTigress. But Hiro forgot that she exists. Cries forever.", "❝Good evening everyone..~❞", "@ReformedTigress (I can't do anything. I only do what Izzy-sama ask-)", "@ReformedTigress (You're not making a good job on keeping it for yourself--)", "@ReformedTigress (Maybe because the most probably canon ship is Jerza and you prefer Minerza so- Love rival- You hate concurrence-)", "Doesn't have a father to say \"Happy Father's Day\" to.\n\nCries.", "@DivineDoragon ❝I don't want to stay alone, and even like that I can't find someone..❞", "@HolderOfThe13th ❝I'm just being honest! Don't let anyone say otherwise!❞", "❝Even a cooking competition people will turn into fight..?❞", "@HolderOfThe13th ❝You're not chubby..! Your body is so amazing! He might just be jealous because he doesn't have such a body!❞", "@ReformedTigress Would totally marry.", "❝... I... Why is Yukino-san.. \"Totally pregnant\"..?❞", "@BootyDefender HUGS SHELBEY TIGHTLY", "@KurokamiHeiress ❝O-Okay then..! It will be fun!❞\n\n#GourmetHunt", "@KurokamiHeiress ❝Huh.. So.. I just go around having a taste of every plate?❞\n\n#GourmetHunt", "❝Can I have some food..?❞\n\n#GourmetHunt", "@KurokamiHeiress « bag since Medaka got the bigger one. She took a deep breath before looking up at the place.\n\n❝It's pretty big..!❞", "@KurokamiHeiress « She waved her hands, dismissing the second part of her suggestion. After that she got out from the car as well, picking her smaller »", "@KurokamiHeiress ❝W-Well.. You can help me practice.. But I can't accept your money Medaka-san..! I will just save some money..! D-Dont worry about it..!❞\n\n»", "@KurokamiHeiress « you for inviting me..!❞", "@KurokamiHeiress « I wouldn't be able to drive even if I had my license. B-But anyway..! Yes, I'm really excited for this weekend Medaka-san! Thank »", "@KurokamiHeiress ❝I wish I could get my license as well but.. I'm scared of making the driving test.. Besides that I don't have a car so.. »", "@KurokamiHeiress « and then expressed her surprise.\n\n❝Medaka-san! I didn't know you could drive..!❞", "@KurokamiHeiress « for the weekend.\n\nSoon she saw a car getting closer and then the surprise. It was Medaka! Without wasting time she got in the car »", "@KurokamiHeiress She was already outside waiting for Medaka to appear. She had a big bag on her back and a smaller one on her hand, ready to go »", "@DivineDoragon ❝At least they managed to find someone.❞", "@SenchoBonney ❝Well, it's very cute! And I will make you get used to it!~❞", "Sees @RubberySencho.\n\nJust hugs tightly.", "@LynOfThePlains (Yaaaa)", "@LynOfThePlains (Tuuuuuuuuuuuuu)", "@LynOfThePlains (Wait, who is the writer? I'm confused)", "@LynOfThePlains (Pfffft)", "@LynOfThePlains (Will not even make one, imagine 13)", "@SenchoBonney ❝But you're blushing!~ And stuttering as well!~ That's so cute!❞", "❝Me and @ReformedTigress-sama..~❞ https://t.co/rOpdpDwAuh", "@SenchoBonney ❝It's the first time I see you blushing Bonney-san~ I guess everything has a first time!~❞", "@PapettoMeiji (THATS FINE BY ME)", "@KurokamiHeiress « pack her stuff. She was really excited for this weekend.", "@KurokamiHeiress ❝Okay then Medaka-san! So I see you in an hour! I will be waiting for you!❞\n\nAnd with that said she ran toward her house so she could »", "@PapettoMeiji (NOT MY FSYLT)", "@PapettoMeiji (I DONT KNOW WHAT TO DO)", "@PapettoMeiji (WHAT CAN I DO THO)", "@PapettoMeiji (YOURE SO OBVIOUS)", "@PapettoMeiji (YES NEKO?!)", "@DivineDoragon ❝I wish they be happy..~❞", "❝Mana-san and Rogue-san are dating?❞", "@AtorasuZencho (Reasons)", "@AtorasuZencho (Why you lying)", "@DivineDoragon ❝What's happening Sting-san?❞", "@AtorasuZencho (You no like me tho)", "@KajiNoOwari (Shhhhhh)", "@AtorasuZencho (Waves)", "@KajiNoOwari (I don't.)", "@Ryokushun ❝You are Kiwi because your hair and face looks like kiwi.❞", "@Ryokushun ❝Eh? Why Strawberry though?❞", "@HolderOfThe13th (I already noticed that! You and Izzy are the champions on that! I cry!)", "@HolderOfThe13th (You all leave everytime and I stay alone ;~;)", "@HolderOfThe13th (It's been a while ;~;)", "@HolderOfThe13th (Hihihihihi)", "@Ryokushun ❝Kiwi-san!❞", "@KurokamiHeiress (KUKUKUKUHAHAHAHAHATEEHEE)", "@KurokamiHeiress (I just can't remember which chapter I saw Flare laughing like that. But yeah, she laughs \"hahaha\" and \"teehee\" as well)", "@KurokamiHeiress (Flare laughs like that too-)", "@DurableCrusader (You should flip Darkness to Rias---)", "@iLyonVastia https://t.co/FmBxfqtqLY", "RT @Astralizaton: Let's rock https://t.co/wyxwqdLwJr", "@Ryokushun ❝I do train as well!❞", "@Ryokushun ❝You Just sleep all day anyway.❞", "@Ryokushun ❝No, we never fought. But she can defeat anyone.❞", "@KurokamiHeiress ❝Okay then! You will go to my house or we choose a meeting place?❞", "@Ryokushun ❝Doesn't matter, Minerva-sama is still stronger.❞", "@Ryokushun ❝Because Minerva-sama is stronger!❞", "@Ryokushun ❝No you couldn't! And yes I did, Kiwi.❞", "@Ryokushun ❝Kiwi, you wouldn't put down Minerva-sama.❞", "@KurokamiHeiress ❝Okay then..! Then.. I will go home and pack everything I will need! I'm excited for it Medaka-san..!❞", "Wants to be Queen of the pool as well.\n\n#HakoniwaPool", "@KurokamiHeiress « have them?❞", "@KurokamiHeiress ❝That seems like a great idea..! One with ice cream and cake?? I would love to relax, but I want ice cream and cake. Can we go to one that »", "@KurokamiHeiress ❝I'm not really sure. Do you have any idea? You can choose really..!❞", "Just stays floating on the pool, relaxing there.\n\n#HakoniwaPool", "Just.... Joins\n\n#HakoniwaPool https://t.co/YvANwW25MG", "@KurokamiHeiress ❝Would you mind.. Spending the day with me Medaka-san..? I'm needing the company of a friend.❞", "@KurokamiHeiress ❝Well.. I wasn't feeling so good so.. I went back to my Village to stay some time there.❞", "@AmphibiousMage ❝I like my hair the way it is. Besides that I don't need haircuts! I can let my hair the way I want!❞", "@AmphibiousMage ❝Of course my hair is real! Why wouldn't it be?? Red hair is more common than blue hair!❞", "@AmphibiousMage ❝I don't even know what you're saying now..❞", "@AmphibiousMage ❝Don't come with that!❞", "@AmphibiousMage ❝Isn't it obvious?!❞", "@AmphibiousMage ❝Yes I am..! And no you can't..!❞", "@AmphibiousMage ❝Well, I'm a girl.. You're not..❞", "@AmphibiousMage ❝... Why you have boobs..?❞", "@DivineDoragon « her hands, feeling shame of herself.", "@DivineDoragon « for not realizing that I was the evil one all that time..!❞\n\nTears started flowing from her eyes. She instantly covered her face with »", "@DivineDoragon « good things? Hurting people.. Threatening... Even killing... How could I think that I was doing the right thing..?! I'm so stupid »", "@DivineDoragon « things, even after the Grand Magic Games.. And now I look back at everything and I think \"How could I think that Raven Tail was doing »", "@DivineDoragon « all this time.. Lately I've been thinking about my time in Raven Tail.. All the time I thought Fairy Tail was evil.. And I did horrible »", "@DivineDoragon ❝It's not that easy Sting-san.. I don't know.. I feel like I've not done anything right in my life.. Like if I were a bad person »", "@DivineDoragon ❝I don't know Sting-san.. I'm not confident enough..❞", "@ReformedTigress ❝I really would like to. You see... I see these classes as a way to approach you, so.. It's not only learn to cook to me..❞", "@ReformedTigress ❝Not at all Minerva-sama. Just curious about something. We.. Will still continue our cooking classes..?❞", "@DivineDoragon ❝I say it as conclusion from my previous relationships..❞", "@AtorasuZencho (That's because I'm not really active lately.)", "@ReformedTigress ❝Well.. I just wanted to talk with you. It's been so long since we last talked..❞", "@ReformedTigress ❝H-Hello Minervs-sama..~ Huh.. Can we.. Can we talk..?❞", "@AtorasuZencho (I cri)", "@DivineDoragon ❝Well.. I'm the one saying, because it's true..❞", "@AtorasuZencho Lifts hand.", "@KurokamiHeiress ❝I-It's okay..~ I forgive you this time..~ But anyway, it's nice to see you again Medaka-san..!❞", "@SenchoBonney ❝Well, then people don't know how to appreciate something beautiful.❞", "@DivineDoragon ❝I'm not fitting for anyone.. I scare people.. I bore them.. I'm just a failure..❞", "@DivineDoragon ❝Even like that.. The way I am makes people stay away.. I'm always alone here in the guild..❞", "« on corners to avoid everyone.. I don't deserve to stay in Sabertooth.. I'm only causing a bad impression to whoever comes here..❞ https://t.co/NUO8LdXWyF", "❝No.. I just.. Feel like this isn't my place.. Everyone here is happy.. Talkative.. While me..? I'm always sad and silent.. Staying » https://t.co/NUO8LdXWyF", "❝I don't include myself on that.. I.. Don't even feel like I should be here anymore..❞ https://t.co/co0LteehC2", "❝I will just stay in my room..❞", "❝But you all are so happy.. I don't want to end up messing everything up..❞ https://t.co/eGpvvlBqZU", "❝I-I prefer not to bother you all Sting-san..❞ https://t.co/7tgRHn3fZz", "❝I-It's good to see Sabertooth so alive..~ Even though I always stay in my corner..❞", "@GlacialEmperor ❝Not even a little.❞", "@GlacialEmperor ❝Not that relevant.❞", "@GlacialEmperor ❝Well I just did! Ugly, ugly, ugly, ugly!!❞", "@GlacialEmperor ❝And stop that! It's ugly and.. And.. Uh.. And ugly..!❞\n\nAnd just leaves without explaining shit.", "@GlacialEmperor ❝I will just go away! Bye..!❞", "@GlacialEmperor ❝I'm only saying the truth..!❞", "@SenchoBonney (GOOD LUCK!)", "@GlacialEmperor ❝Because you only think with your lower head..!❞", "@NitenSaber (YES! HANDS OFF)", "@NitenSaber @Boobturia (MINE)", "@GlacialEmperor ❝Well.... Then make an ice woman..! Humpf..!❞", "@NitenSaber @Boobturia (KIRA YES)", "@NitenSaber @Boobturia (👀👀👀)", "@NitenSaber @Boobturia (Done--)", "@NitenSaber (I will just follow on them all because I'm not really active in any lately)", "@NitenSaber (Me---)", "@DunScaith (I'm way ahead of you-- Already followed--)", "(Eating.. Eating.. Eating.. Ea-- Not eating, but thinking about food--) https://t.co/QIbHE7lxcg", "@GlacialEmperor ❝Go respect your ice..!❞\n\nIsn't good with insults.", "@GlacialEmperor ❝Weirdo..❞", "@Viseleaux (There's only art of her eating--)", "@GluttonToriko (This one) https://t.co/Yp6UVHpeQt", "@YudokuMajin ❝Orange juice please Mira-san..!❞", "@AisuGeneral I'm just saying", "@YudokuMajin Loves food. Appreciates food.", "@AisuGeneral Then it's AisuJeneraru", "#SeductiveSunday https://t.co/Unbnyev55j", "Is secretly the owner of Corona Extra.", "@KurokamiHeiress « You scared me..!❞", "@KurokamiHeiress The hug sure was sudden, making Flare give a small jump since she got startled by it.\n\n❝M-Medaka-san..! D-Don't appear like that..! »", "@SenchoBonney ❝Kukuku..~ Don't worry Bonney-san~ You can handle your own hair, and it is beautiful~ That's good enough~❞", "@ReformedTigress (I always thought it would be cool for her to actually use her demon powers since she still have part of it. You should!)", "@RuinousPrincess @ZennoNoJoou Sorry", "@RuinousPrincess ❝H-Huh.. Who did that Rias-san..?❞", "@AnimorphGoddess « see Blondie, and also Natsu-san the most.❞", "@AnimorphGoddess ❝I-I'm doing okay..! I come visit from time to time.. But you're never around so.. I don't really have the chance to talk with you. I only »", "@AnimorphGoddess « that day in the bathroom with everyone else but.. I-It's still nice to see you..!❞", "@AnimorphGoddess ❝Fairy Tail being Fairy Tail I guess, ne..?~ But anyway, it's nice to see you Lisanna-san..!~ We.. Never really talked besides »", "@AnimorphGoddess ❝What is happening around here..?❞", "@SassAnarchy Well yes, her Brola one. This one is her other account.", "@iSassyHeroine (What is happening?) https://t.co/aYxQ4Z2Dup", "@ReformedTigress ❝That's great to know..! The guild stays a little too quiet with your absence..❞", "@ReformedTigress ❝So.. You're back for good now..? Or you still have business to deal with..?❞", "@ReformedTigress « remember anything as a kid. B-But anyway..! Where have you been..? I missed you..❞", "@ReformedTigress « allow me to die, so I revive as a kid and once my magic is all recharged I grow up again. You know.. Like a phoenix. But I don't »", "@ReformedTigress ❝W-Well.. Since last time I saw you.. Uhhh.. A lot of things happened. I even died.. But apparently the blessed flame of Atlas doesn't »", "@ReformedTigress ❝Minerva-sama..! You're around..!❞", "@RavagingDragon @RuinousPrincess ❝These... Are really scales or.. You made them to cover the pillows with your own scales..?❞", "@BurandoSeirei ❝Blondie..!❞", "@TheKokuryu What? I can't hear you from earth!", "@RuinousPrincess ❝Rias-san..! Good morning!❞", "@AnkokuNoFurido @TheKokuryu High fives!!", "@TheKokuryu You will have a lot of /time/ to stay mad.", "@AnimalSoru Hugs are best thing.", "@AnkokuNoFurido @FreedJustineIRL (No)", "@AnimalSoru Hugs just cause.", "@SakanaSureiya (Wat-)", "@EnragedZamasu  https://t.co/W3EsxkTHtl", "@Fullbuster ❝I guess they are okay. It's been a while since I last visited them.❞", "@EnragedZamasu ❝H-Huh... I.. Need to go somewhere else.. Excuse me..❞", "@Fullbuster ❝Hello there Gray-san..~❞", "❝Good evening everyone..~❞", "(Did an unfollow spree. If by any chance I unfollowed you by accident, warn me!)", "(I don't even know her lol) https://t.co/o2nwrZYTuG", "@RuinousPrincess Cuddles to sleep.", "@CunningCut (Don't judge me--)", "(I'm in bed tho--) https://t.co/mmUyx3ErRU", "@CunningCut (I swear I read that UN wrong-)", "@WielderOfStars ❝But you said it Blondie..!❞", "@WielderOfStars ❝Happy Mother's Day then..!❞", "@WielderOfStars ❝Above it..? Below the stoma-- O-Ohhhhh..!❞", "@WielderOfStars ❝Why would Natsu-san be in your feet?❞", "@WielderOfStars ❝Where it is pointing to then?❞", "@WielderOfStars ❝It is pointing at your belly Blondie!❞", "@HanzoLegacy ❝I'm outside the house though.. Just.. Looking through the window..❞", "@HanzoLegacy ❝H-Huh.. Just wandering.. Searching something to do.❞", "@WielderOfStars ❝But it's what the shirt says..!❞", "@WielderOfStars ❝He was.. in your belly..? Then you are his mother..?❞", "@HanzoLegacy ❝Huh.. That's not a reason to be naked..❞", "@HanzoLegacy ❝Asuka-san.. You.. You're naked again..❞", "Nope. https://t.co/FasulwO4GD", "Is crying only internally. He has no way to know that. https://t.co/rrALCMSShp", "Doesn't know what to say about that. https://t.co/7MY92oV8Wv", "But still looks like a lil kid. https://t.co/fREGtVrdEs", "Was abandoned by her biological parents. Has no idea who they are too. https://t.co/52vhNwC0s5", "But she so little. https://t.co/Ikyq5eYYzc", "❝You don't have any as well.❞ https://t.co/tfHy5vQZ3W", "@SoulMadeOfIron Doesn't understand why a fish.", "Has no mother. Cries.", "Is actually laughing internally at @SoulMadeOfIron.", "@SenchoBonney « a chuckle escaped her lips, clearly finding that situation funny.", "@SenchoBonney She then pulled it back using her hair manipulation, and soon her hair was back at her common hairstyle.\n\n❝There you go~❞\n\nAnd then »", "@ReformedTigress ❝Minerva-sama..! I missed you..!❞ \n\nAnd just hugs her by instinct.", "@SenchoBonney Covers her with hair and puts her to sleep.", "@KurokamiHeiress ❝Because.. Dead people can't talk Medaka-san..❞", "❝T-Thank you Atlas-sama..~❞ https://t.co/tx8ZGYbYwX", "❝I-It's scary out there.. I will stay here..❞ https://t.co/hzL4jhGXWa", "Hides behind @AtorasuGadian.", "❝Just kidding..~ Women smells better than men..~❞", "Sniff sniff https://t.co/Fiq7vit5XK", "@iLyonVastia ❝Men..? What..?❞", "@iLyonVastia ❝You pervert..❞", "❝Why there's a bunch of Ichiya-san everywhere..?❞", "❝Indeed..❞ https://t.co/D9AqW9crKR", "@iLyonVastia ❝You were foggy..❞", "@iLyonVastia ❝Why do you have an image of said bikini saved in your iLacrima..?❞", "https://t.co/8OePE7ucPj", "Flare, what do you do in your free time??\n\n❝I-I....❞ https://t.co/PbWcO3RRsB", "@JoteiNoSenjo Foursome-", "❝I'm so tired yet.. Yesterday was very.. Eventful..~❞", "@AtorasuZencho @HeartOfFilia  https://t.co/UyS2n6Wlu8", "@WarlordOfSuna (Can't wait to actually get in the arc. I'm still in Punk Hazard.)", "@WarlordOfSuna (That last sentence he said in the last chapter tho- It made me love him)", "(This TL is so full of love and affection. I'm so happy :')", "@WarlordOfSuna (If you don't mind me saying, there's also @SenchoBonney)", "(3 away from 2800--)", "@KamiOMoyasuHi (Here fixed--) https://t.co/9546zJxgTp", "(Apparently she is a grill) https://t.co/NR1kZRL3Zo", "Leaves some cake for @AtorasuZencho since she didn't appear.", "WE LOVE YOU ROY! https://t.co/yd9bXPMh1o", "Make it Blackiemo--- jkjk https://t.co/pERq7FS5k0", "❝Today started slow but then everything happened So fast..~ I'm so happy..~ But also so exhausted..❞", "(And like I said in my writer account, tomorrow I will do a solo on here. A mission for sure. But now I will make a solo on Nova)", "And is happy that for the first time Luffy remembered who Flare is.", "@RuinousPrincess 『The big thanks!』\n\nRead: https://t.co/zWWoTTMBiH\n\n#FlaresBDay", "❝Everyone can eat cake, just don't kill each other because of it..!❞\n\n#FlaresBDay", "« birthday as well--)\n\n#FlaresBDay", "(#FunFact: I chose this day for her birthday because it's the day of the Sun. Buuut today I discovered that it's also Hiro Mashima's »", "❝Mr. Death is in my birthday... I.. I don't know if I should be afraid or not..❞ \n\n#FlaresBDay", "All the sugar she eats go straight to her boobs so yeah, no diabe-- only big boo---\n\n#FlaresBDay https://t.co/EhyZbq6Xcv", "But cake- https://t.co/8iuAMI1sjY", "Now she has a Chibi Nobu. Let the Nobu hell start-\n\n#FlaresBDay", "Will have cake for eternity. Who cares about an year supply of nuggets if you have a life supply of cake??\n \n#FlaresBDay", "❝Please don't make any fight or war like you all always do please..! J-Just have fun..! Except if this fun involves someone getting hurt..!❞", "And yes, her face was as red as her hair.\n\n#FlaresBDay", "❝T-There's people that I don't even know b-but I don't mind..! Since they are having fun..!❞ \n\n#FlaresBDay", "❝S-So much people..! So much interactions..! I-I..! I..!❞\n\nNervous Flare is nervous!\n\n#FlaresBDay", "❝Cake..! Thank you very much..!! Huh.. I'm still getting used to everything but.. I hope you're having fun..!❞\n\n#FlaresBDay https://t.co/ImUNW7ldel", "❝I heard cake? There's more cake for me??❞\n\n#FlaresBDay", "@RuinousPrincess « slowly lifted to embrace her fellow redhead.\n\n❝T-Thank you..~ I.. I'm really thankful..~❞ \n\n#FlaresBDay", "@RuinousPrincess She really had no words to describe how she was feeling about all that. A smile formed on her lips and tears on her eyes. Her arms »", "« And I hope you all enjoy the party..!❞ \n\n#FlaresBDay", "❝W-Well.. That was a surprise to me..! I-I really have no words to describe how happy I am..! I'm very thankful to everyone..! »", "(If I say thank you to everyone, will it be too repetitive? Or should I just make a general thank once it finishes?? I'm so confused!)", "❝T-There's a giant robot too?!❞\n\n#FlaresBDay", "« was her first time celebrating her birthday, so she wasn't used to any of that.\n\n#FlaresBDay https://t.co/PxPaAR2CLz", "Instantly she gets startled by the loud sound, almost falling on the ground.\n\n❝A-Ahhh!! W-What..?! What is all that Rias-san..?!❞\n\nThat » https://t.co/PxPaAR2CLz", "❝W-What is happening..? What is all that..?❞\n\n#FlaresBDay", "(I'm in cine now, I will get to reply to everyone in around an hour! I'm sorry ;~; And thank you everyone!)", "@ShadouSureiya (I don't think so. Why?)", "@ShadouSureiya (But you're saying yougurt that hurts people--)", "❝Year of birth..? I.. Don't think I get it..❞ https://t.co/QeAGuWwCRj", "@ShadouSureiya (What is that? A yogurt that hurts you?)", "@ShadouSureiya (You are a Rogurs.)", "(I heard Rogurs where tell me)", "@DreamsOfYuri (Oh well..)", "@DreamsOfYuri (Nah, for me death makes more sense.)", "@DreamsOfYuri (I will bring her back. And who goes on vacation when the school starts????)", "@Ephemexa ❝Well.. You're in Magnolia Town, in Fiore of you also don't know that.❞", "@DreamsOfYuri (And technically Carol since they are roommates-)", "@HanzoLegacy ❝A cake..? Huh.. I heard that in birthdays there's cake. But when did you make it?❞", "@Ephemexa ❝I see.. I'm Flare..~ It's nice to meet you..!❞", "@DemonFrieza ❝Thank you giant gecku..!❞", "@HanzoLegacy ❝O-Oh..! Right..! W-Well.. Yes it is today but.. I have no idea of what to do..❞", "@Ephemexa ❝A-And sorry for that but.. Who are you..?❞", "Is the first birthday she will celebrate. Doesn't know how to react.\n\nNervous Flare noises.", "@Ephemexa ❝T-Thank you I guess..!❞", "@HanzoLegacy ❝H-Huh..? What do you mean Asuka-san..?❞", "❝But everyone is out in missions.. There's no one here, besides you.❞ https://t.co/OEPEQTvA9V", "❝I see.. Like everyone else.. I guess I will make a mission myself...❞ https://t.co/NB7KV2O84O", "❝Well.. She isn't around so.. How can I say good morning to her?❞ https://t.co/TAWO2OEuby", "❝Huh.. Nothing much I guess..? I woke up some time ago so.. I'm still getting into things.❞ https://t.co/VP8uUsQb0X", "Waves back. With her hair. https://t.co/jJwXKqJRee", "❝Good morning everyone..~❞", "@SenchoBonney ❝I-I'm sorry..! I didn't mean to hurt you..! F-Forgive me..!❞", "@WielderOfStars ❝I.. Was going to see you.. I don't really have any excuse..❞", "❝Well.. I don't think today will be any different..❞", "❝H-Huh.. Good evening I guess..❞", "@WielderOfStars ❝To... Your... Guild.. Huh.. Yes..❞\n\nShe didn't think that Lucy would ask that, and she wasn't good with lies at all.", "@WielderOfStars ❝I'm doing good as well Blondie..~ I was.. Just passing by..~❞", "@WielderOfStars ❝I-It's been a while... How are you Blondie..?~❞", "@WielderOfStars ❝Blondie...~❞ https://t.co/1E4MWy1lY7", "@SenchoBonney « was indeed heavy.", "@SenchoBonney ❝Why don't you feel it??❞\n\nRight after saying that she made her hair move and stay over the other girl, soon falling on her. And yes, it »", "#FTRP 👆", "@KurokamiHeiress @HanzoLegacy ❝I will not lick her.. I can't do that Medaka-san.❞", "@KurokamiHeiress @HanzoLegacy lick*", "@KurokamiHeiress @HanzoLegacy ❝B-But.. I can't just kick her..❞", "@HanzoLegacy Cries because of the wasted chocolate.", "@DemonFrieza (Damn. I guess he got lost in the way.)", "@DemonFrieza (Hey, did my starter arrived through my pigeon??)", "Oh no. Gil-san is back with the gilgajokes. https://t.co/UutlSf0ICh", "@RuinousPrincess Still loves Rias-san.", "@ShijieXian « accept that I reached my limit.. Go back to my village and live my life there.. Without magic at all..❞", "@ShijieXian « work..!❞\n\nA sigh escaped her lips. Now her hope was completely gone.\n\n❝I guess I putted my hopes up too much.. I will just »", "@ShijieXian « making she lose her hopes.\n\n❝Research..? Study..? Read..? I am searching someone to train me because these things didn't »", "@ShijieXian « training, it will not happen...❞ \n\nAt this point she was already giving up. Nothing was really helping. That words were just »", "@ShijieXian « And mythology? I don't really like that... These \"gods\" are just a bunch of assholes... If I need to think about them while »", "@ShijieXian « love my magic.. I will not leave it behind.. It was a gift to me... I will not just stop using it to learn something else.. »", "@ShijieXian « only giving instructions to things that Flare was already doing. If that would be the training, that would be useless.\n\n❝I »", "@ShijieXian « she had to say, and little by little she was feeling even more down. All that she was saying wasn't helping at all. She was »", "@ShijieXian « unable to help anyone.. Being the useless person that she always believed to be.\n\nShe just continued to listen everything »", "@ShijieXian « knew she couldn't do that at all as well. She tried to get stronger and improve, but she only continued losing and losing, »", "@ShijieXian She knew that she wasn't special at all. In fact she believed to be even under common people. About reaching her goal? She »", "@SenchoBonney ❝Well.. My hair is this big since I was little so.. It's been some years already.❞", "@FlaxenChaos (So.. I kinda just got you.) https://t.co/KexprvCBqr", "Already accepted that will not be trained at all.", "Finds @KojoMegami's hair very beautiful.", "@SenchoBonney ❝I just keep it tied..~ And it's not heavy once you get use to it.❞", "Wonders who is Celia.", "@SenchoBonney ❝Actually I can control the size of my hair. But I prefer it long..~❞", "@SenchoBonney Since she isn't doing anything at all, Flare stays confused.", "@SenchoBonney Lifts hair.", "@CopyCatsPride ❝And what do you want me to do Luke-san..? I tried to get stronger.. But I'm still way behind you all..❞", "@CopyCatsPride ❝I'm not talking only about this.. I'm talking about everything else as well.. I always stay behind because I'm weak.. I'm a burden..❞", "@CopyCatsPride ❝Well.. I'm used with that to be honest.. I don't want to bother anyone..❞", "❝H-Huh..? I don't know what Platypus is but.. There's nothing much I can do... I'm not strong.. So I would only bother everyone..❞ https://t.co/FKxFs2XMTQ", "Just... Stays on a corner, watching the #GendersAtWar.", "@ThatVampQueen ❝V-Vampire..? Please don't suck my blood.. I-It doesn't taste well..❞", "❝I... Will just stay on my corner as always.. Watching..❞", "❝#GendersAtWar..? Even that will be a reason to make a war now..?❞", "@LitNatsu_ @GodIyGoku (I don't think so) https://t.co/FzQVnR5jwy", "@RuinousPrincess Actually cold.", "@RuinousPrincess Poses https://t.co/d1R96tcmX1", "@CrawIingChaos (Same)", "@ThatVampQueen ❝Huh..? Who are you miss? And.. How can I help you?❞", "@Viseleaux Still can hear the things. Help more.", "@Viseleaux Wants to rip off her eyes. Steven help.", "@iSassyHeroine ❝.....❞\n\nJust goes back to sleep.", "❝So.. It was all a nightmare.. Right..? A bad dream..?❞", "Gives energy to @BurakkuGoku. Gives the energy of a flame dragon.", "Will just... Go to sleep until all that finish. And will be sure to cover her ears.", "@SassAnarchy (He could've at least saved the photo instead of take a pic of his pc-)", "@OriginalGogeta (prove it)", "@OriginalGogeta (Suuuure)", "@OriginalGogeta (I don't have money &gt;.&gt;)", "@OriginalGogeta (What??)", "@OriginalGogeta (Wat)", "Rude https://t.co/kdveL9J3bw", "Nope, no lemon. https://t.co/NXRZN0nAKL", "Flare and Loli Flare https://t.co/Givmlinaoc", "(I'm supposed to judge this. I. WHATS HAPPENING.)", "@WillOfFlames (And actually put them inside of her instead of their dicks--)", "❝H-Huh.. Why not a cooking tournament..? O-Or.. A quiz..?❞", "❝I'm innocent..❞", "@Vegito (Happy Birthday)", "(It's because you said it's hentai, but it's not hentai actually since it doesn't have sex) https://t.co/SaDkms1xhv", "(Actually FT is ecchi-) https://t.co/LCgn32ctf3", "@iLyonVastia ❝Actually.. No. That's why I'm surprised. It's the first time I see this other side of you.❞", "@DividingAzure (HIDES AS WELL)", "@DividingAzure (SO ANGRY! YOU SHOULD RUN!)", "@DividingAzure (You should get worried, he will get angry at you 👀)", "@Astralizaton (But--) https://t.co/keUg8ChvIQ", "@Astralizaton (Frontline--)", "Casually.... Just hangs around. https://t.co/6MeoldBUL1", "@iLyonVastia ❝W-Well.. That's the only side you actually show.❞", "RT @carterjwm: HELP ME PLEASE. A MAN NEEDS HIS NUGGS https://t.co/4SrfHmEMo3", "❝At least we dress something.❞ https://t.co/YQPU5MoMrD", "@KenshiNoZoro  https://t.co/EiyCj1nVS7", "@AnimalSoru (Lake then-)", "Wonders what is this #BBVII that is happening.", "(A little improved version of the bunny Flare- Still need to leard no add shadows tho-) https://t.co/rzr7UB46lk", "@AnimalSoru (Make a Yukino-)", "@HanzoLegacy ❝I'm weak.. Be it magic or not.. I'm weak..❞", "@HanzoLegacy ❝I'm not strong at all.. I'm actually pretty weak..❞", "@HanzoLegacy ❝Why suddenly you find me scary..?❞", "@HanzoLegacy ❝I-I'm not scary..!❞", "@HanzoLegacy ❝W-What..?❞", "(I don't even know what is happening)", "@UncannyEmma (Technically it's ❄️❄️)", "@RubberySencho (You just hate me, that's why you followed &lt;3)", "@PhotonHun (Damn..)", "@PhotonHun (Is this an actual thing or?)", "@DunScaith (Scathach Lily)", "@RuinousPrincess Already loved fairies before. Now loves them even more.", "@SenchoBonney (Apparently it's your birthday so..... HAPPY BIRTHDAY!!! AND I HOPE YOU GET LOTS OF PIZZAS!!)", "@GluttonToriko (When Toriko learns Gomu Gomu no Gatling Gun)", "@iLyonVastia ❝No.. You're being nice! That's what is different!~❞", "When Rias doesn't even care about your present. https://t.co/ujSVhZSFR8", "(Yes I'm using Valentine's Day card because that's the only I have with her holding a present--) https://t.co/7s1n38WyKh", "@RuinousPrincess ❝R-Rias-san..! Happy birthday..! I-I.. I got a present for you..~ It's nothing much but.. I-I hope you like it..~❞ https://t.co/ZmKk6vCKXX", "#SeductiveSunday https://t.co/He6qcyNsjx", "@AtorasuZencho (but twin)", "@AtorasuZencho (SLEEEEEEEEO)", "@iLyonVastia ❝o-Okay then.. I.. I guess I was just overreacting.. But you do seems different.❞", "❝Yes.. That's what I will do..❞", "❝I.. I guess I will just go home..❞", "(Rest in pieces--) https://t.co/0XmEZv3ggS", "@TheAIIGifted It's not a reference.. I'm literally saying that it is like his power.. Ffs..", "@HolySting ❝Rogue-san? W-Well.. Not at all. I haven't been in the guild today so.. I'm not really sure where he is.. I'm sorry..❞", "@HolySting ❝Huh? Yes Sting-san?❞", "@iLyonVastia ❝Huh.. If.. If you say so then I guess it's all good between us?❞", "@iLyonVastia ❝Ehhh no, not at all. Just... Keeping my distance since you doesn't like me.❞", "@iLyonVastia ❝Huh.. Hello Lyon-san. It's.. Nice to see you're around again.❞", "Would totally go through death just to hug her. https://t.co/xDyFkoWTQ7", "Thinks that he should be a female forever. https://t.co/LvPhJ5aZ6Z", "@AChickWithADick (We just plotting the RP that we are having on TL)", "(When the Carol Apocalypse starts and there's already victims.) https://t.co/XK1LM0xVWN", "@SaijoNoHaisha (I just don't know what to do there at all)", "(Dunno, guess that make a self OC wasn't a good idea.)", "@KurokamiHeiress Doesn't agree with that!\n\nJust accepts the hug.", "@KurokamiHeiress Still doesn't find her ugly like that jokers.", "Sees that @iLyonVastia is back. Waves hi. But very far from him.", "@KurokamiHeiress Still doesn't find her weird like that card jokers", "@KurokamiHeiress @BornAsLoser @IncompleteLoser @RearuIta @MedakasDouble @MissRuler @VoidOfAnger @TheSkillMaker Doesn't find Medaka-san to be a joke.", "@RuinousPrincess ❝Good morning Rias-san..!❞", "Missed @RubberySencho, even thought she knows he doesn't remember her. Like always.", "(Thank you! *^*) https://t.co/PpXsW3s305", "(2 away from 2700--)", "@AtorasuZencho « help me? I need your help as well.❞", "@AtorasuZencho « mind as well.. So I can stay focused in my goals, and not step back, doesn't matter what happen. But I can't do that alone.. So will you »", "@AtorasuZencho « If I'm not strong, then what I need to do is train! Train to get stronger! But not only my magic, or my physical.. I need to train my »", "@AtorasuZencho « That I should stop holding back.. That I should stop doubting of myself.. I know I'm not strong, but I can't let that hold me back.. »", "@AtorasuZencho ❝Everything that happened.. All these events were good in a way.. They taught me something.. That I should stop hiding behind the others.. »", "@ShijieXian @AtorasuZencho « and protect the others from whatever threat that could come their way.", "@ShijieXian @AtorasuZencho « to hold anyone back anymore!❞\n\nShe sure was different. She now had determination within her. She had a burning desire to be stronger »", "@ShijieXian @AtorasuZencho ❝I am sure weak, but I want to be stronger.. So please train me..! I don't want to be a burden to everyone else anymore! I don't want »", "『Back in action』\n\nRead: https://t.co/VMnDBOaNAl", "(Went to unpin it and deleted by accident smh)", "『The Rebirth Of The Flame』\n\nRead: https://t.co/cvMLmOGnNL", "(???) https://t.co/ifIbOWHkcs", "(I will get rid of some accounts..)", "@HeavenIyJellal (it's funny because it was kinda in a ship. It was a ship situation in a ship.)", "@SenchoBonney ❝H-Huh..? What do you mean miss..? I have always been a kid..❞\n\nShe reached for the pizza, already starting to eat it.", "Me because of Timo and Timo https://t.co/xfAqXuErl3", "BECAUSE BEST MEREDY EVER https://t.co/fS2KREbdQc", "(Timo isn't Timo... My entire life is a lie.. Kill me now)", "(Because you're not a penguin) https://t.co/a5FndD7358", "@Viseleaux (Same)", "(huuuuugs) https://t.co/UJGXVLTVBj", "(I like this answer) https://t.co/JhaVjkz48V", "WHY https://t.co/okP0L2pZqB", "(Doing this too cause yes) https://t.co/yMmQannXOc", "@AtorasuZencho Hugs her leg.", "(Because Shelbey) https://t.co/v7Dtsda3zJ", "@KurokamiHeiress Doesn't know how this will work. Is just hiding behind a chair now.", "@KurokamiHeiress Is too shy to make friends. Will pretty much just hide from everyone.", "@KurokamiHeiress Doesn't know what is that. But if mommy is saying then she will do it.", "@KurokamiHeiress Flare Kurokami will be.", "@KurokamiHeiress Is now adopted daughter of Medaka until she get big again.", "@SenchoBonney ❝T-Thank you miss..!❞\n\nIn fact she couldn't remember who Bonney were, since she could only remember her younger days for now.", "@SenchoBonney ❝H-Huh.. C-Can I have some of that miss..?❞\n\nShe said pointing at the pizza in her hands. Her stomach rumbling from hunger.", "@SenchoBonney ❝F-Forgive me miss.. I-I.. I just.. Huh.. I just..❞\n\nShe got startled by that, and now she couldn't even say what she wanted.", "(Might leave Flare young for more a couple days)", "@SenchoBonney Pulls her shorts to call her attention.", "@DreamsOfYuri Innocent Lil Flare is innocent.", "@HanzoLegacy ❝But.. I don't like bacon..❞", "@HanzoLegacy ❝Pizza...!❞", "(I'M SORRY I COULDN'T RESIST) https://t.co/JyKZq4fkyG", "@ViennasWielder Slowly pokes her hair.", "@LightningsHonor (Yeah ;~;)", "@LightningsHonor (I feel you. I will need to replace my laptop.)", "@ViennasWielder Is amazed by the girl's hair. Just stays staring at it.", "@LightningsHonor (Apparently the Rasengan was too strong for it.)", "@9BallSeraph Is still confused since she doesn't know the girl. But the embrace feels good so she doesn't complain.", "@9BallSeraph Is confused with the sudden hug.", "@MergedZamasu Has the lil kid protection. Can't be killed--", "@RuinousPrincess « her actual age, remembering everything in the same rhythm.", "@RuinousPrincess « made her stay young again, and with that her memories also disappeared. But little by little she is returning to »", "@RuinousPrincess ❝I-I'm sorry if we knew each other.. Medaka-san said that I was big.. B-But I don't remember that..❞\n\nIn fact her rebirth »", "@RuinousPrincess ❝M-Miss, your hair is.. V-Very beautiful..! B-But how do you know my name..?❞", "@RuinousPrincess Pulls her clothes to call her attention.", "@MergedZamasu ❝B-But.. But I don't sin.. I don't even know what that means..❞", "@MergedZamasu ❝W-What disease..? A-And why did you kick me..?❞", "@MergedZamasu Just cries because of how mean he is.", "@MergedZamasu ❝H-Huh... Why are you green..?❞", "Feels like @Boobturia would be a good mother.", "@VenomSureiya Furuichi Fries", "@WielderOfLae Wonders why they always get naked.", "@HungryMidora But is just a little girl. People don't see her because smol.", "Doesn't know what is happening at all. Just stays on a corner, afraid of actually getting food for her and people complain.\n\n#Bishokukai", "@RuinousPrincess Too heavy actually. Is being smashed by the boobs.", "@RuinousPrincess Wants a boobhat from Rias.", "@DairokuTenAkuma (Where's Cosmog--)", "@OharaNicoRobin (I mean-- She is getting scenes in the manga again, so my muse for her will pretty much return)", "@KoronaFlare (Good thing I didn't get rid of the UN 😏 @AnnaHatofiria)", "(Bringing back my Anna for obvious reasons---)", "@Astralizaton ❝W-What do you mean..? I-I'm not something to use..!❞", "@Astralizaton ❝Take care of me..? B-But why..? Y-You don't even know me.. And I have people taking care of me..❞", "@BootyDefender SCREAMS", "@Astralizaton ❝I-I don't know.. I-I.. I'm just making sure..❞", "@BootyDefender (WE REALLY SHOULD RP MORE! EVEN MORE WITH THEM BEING KIDS)", "@Astralizaton ❝H-Huh.. I.. I'm Flare.. W-Why do you ask..? A-And who are you..? Y-You will not hurt me.. R-Right..?❞", "RT @BootyDefender: 「Ꮪ」Seems fun. https://t.co/675b8jjsP3", "@KurokamiHeiress She did felt secure with the girl there with her, even thought she was just a kid as well.\n\n❝H-Huh.. What have there..?❞", "@KurokamiHeiress ❝H-Hai..!❞\n\nShe said all shy while looking toward the house that was open for them to play.", "@KurokamiHeiress ❝O-Okay then.. If.. If you say so.. Then I guess it's okay..~❞", "@KurokamiHeiress ❝A-Are you sure..? I-It will not hurt me..?❞", "@KurokamiHeiress ❝B-But.. Eternal Flame doesn't make boom...❞", "@KurokamiHeiress ❝B-But the big light thing is scary..!❞", "@Viseleaux Gets startled by the flare gun. Runs away.", "(You random lil Shelbey) https://t.co/BI2zMGNG8X", "(Smh- I'm asking because my Flare turned a kid because of her rebirth. It wasn't just a random thing) https://t.co/tn3AcsNt1T", "(Who did??) https://t.co/sVo55gB7qY", "(Did I start this child thing or--)", "@SenchoKid (Put Eustass Kid (Kid) instead--)", "Is happy that she got two instead of one! Eats them with all her happiness. https://t.co/0SybveVe9z", "Apparently she is getting the Steven Disease. But enjoys the pets anyway. https://t.co/WleUMkZb86", "Wants a cookie as well. https://t.co/vetQNMGDz0", "@TheSakuraSaber Is still worried anyway. Is just a lil kid. She doesn't understand.", "Is worried about @TheSakuraSaber b cause of how much blood she coughed already.", "@U10Saiyan Lifts hand slowly.", "@EteriasuNatsu ❝I-I am.. But I don't know you... Neither any Lucy...❞", "@EteriasuNatsu ❝Huh..? Who is Lucy..?❞", "@Astralizaton Is confused because she doesn't know who is he. But still enjoys the headpat.", "Little Flare is gonna cry https://t.co/bD8NjvWymo", "@AlluringScarlet Just shrugs and goes find something else to do.", "@AlluringScarlet Little Flare is even more confused now.", "@AlluringScarlet Little Flare is confused.", "@KurokamiHeiress ❝I-I want my family.. I'm scared.. W-Why there's dead people in that room..? Why I was there miss..?❞", "@KurokamiHeiress « forming on her eyes together with a frown.", "@KurokamiHeiress ❝B-But the giants.. They will worry about me.. I-I want to go home..❞\n\nAnd finally tears started »", "(OMG ITS ALICE *^*)", "(Wow bye) https://t.co/NVS3asbRUT", "@KurokamiHeiress ❝Where am I..? W-Where are the giants..? I-I want to go home miss...❞\n\nFor now her only memories were from her child years.", "(That weak soldiers that are always the same and dies with a Punch-- Every army or group have them-- Shhhh, bad penguin--) https://t.co/XorXj7rjbc", "@KurokamiHeiress « her memory was lost and would be restored with time. But for now she couldn't remember anything.", "@KurokamiHeiress ❝W-Who are you..? What are you talking about miss..? A-And why are we in this place..?❞\n\nJust like her magic and size »", "When cold water falls on you. https://t.co/ubnynOw1rq", "When Rias get a futa https://t.co/V2oh4WQsIv", "(There's always minor characters that dies and no one gives a fuck--) https://t.co/o0B0LB0vwL", "@KurokamiHeiress « scene, what made her bury her face on Medaka's neck so she wouldn't see that.", "@KurokamiHeiress Doesn't know what is happening yet. But looking around she sees the bodies of fallen members. That sure was a scary »", "When you see Flare https://t.co/dBqTTXh7P3", "I got a job as Power Ranger https://t.co/lQ4DwdsxND", "I'm taking this cat and leaving. Excuse me. https://t.co/Fo6qwxagzv", "When @TemporalBullets is a Temporal Bull. https://t.co/f3NMmCfgvb", "@RuinousPrincess Is dead but her nose still bleeds.", "(Not even gonna ask what is happening today. I'm fine here. Dead. Yep.)", "@GluttonToriko Only half of you apparently.", "Caption this- https://t.co/VUZfVnsDwH", "@SomniumVocatus Is afraid of Zophia now.", "@Boobturia (bOOster)", "@RushiKikku (But the boobs look nice too--)", "@RushiKikku (I love this pic, and it's not because of the boobs)", "(Not this again-- Oh lord--) https://t.co/NDYpBsSkcI", "@Boobturia (Pfffffft you don't have proofs of that)", "@Boobturia (Boobturia for sure)", "@Boobturia (Boobturia is confused)", "@SoulMadeOfIron « ripped off.\n\nHer body then fell on the ground again... Over a puddle of blood.. And now lifeless..", "@SoulMadeOfIron « her face disfigured. And to finish everything her neck was lifted, only to have her jugular and everything sticked to it »", "@SoulMadeOfIron « completely. She was still breathing weakly, but that would change soon. The hits continued one after another, leaving »", "@SoulMadeOfIron « couldn't feel pain anymore..\n\nThe final blow was the slam against the ground. With that hard hit her conscience faded »", "@SoulMadeOfIron « looked to the side, only to see her left arm ripped off. Her eyes closed even more. Her senses were going away. She »", "@SoulMadeOfIron « her vision were blurry. Suddenly the left side of her body fell. She couldn't feel her arm anymore. Her eyes slowly »", "@SoulMadeOfIron « pain. The yells couldn't even escape anymore. Her conscience were slowly fading already.\n\nShe still could hear him but »", "@SoulMadeOfIron « back...\n\nCRACK!\n\nBoth of them were broken by the dragon slayer. Her eyes widened, no longer managing to handle all that »", "@SoulMadeOfIron « end of the torture. Later her arms were pulled behind her back, and before she could try to pull the »", "@SoulMadeOfIron « move anymore. The only thing she could do was yell, as a useless call for help. \n\nUnfortunately for her that wasn't the »", "@SoulMadeOfIron « with tears on her eyes. \n\nAfter that she felt her body being pushed down by his foot. She didn't even had strength to »", "@SoulMadeOfIron Just a few seconds later and she felt the same unbearable pain on her other knee, what made her yells even more, already »", "@SoulMadeOfIron « handle, making her continue her screams.", "@SoulMadeOfIron « getting out from the shadows. Only fear was in her widened eyes. She was trying to endure the pain, but it was too much »", "@SoulMadeOfIron « Only to feel the tip of what pierced through her leg. Now unable to run she heard the voice. And soon she saw him »", "@SoulMadeOfIron « knee, what made her fall on the ground.\n\n❝A-AHHHHHHH!!! M-MY KNEE!!!❞\n\nShe yelled before placing her hands over it. »", "@SoulMadeOfIron « she couldn't run from him at all. When she started to slow down she felt a sudden and immense pain coming from her »", "@SoulMadeOfIron Indeed she thought she was safe now. But what she forgot was that he could hide within the shadows. With that »", "@RuinousPrincess ❝Good Morning Rias-sa-- R-Rias I mean..!❞", "@RuinousPrincess Pat pats with her hair.", "@GiIdartsClive ❝You are cold..❞", "@Boobturia ❝Magic... Ohhh..! I never thought about using my magic to do something like that!❞", "@Boobturia ❝How did you make that crux on your hair?❞", "@HittoAssassin (You are 3 minutes late)", "@SenchoBonney ❝Pizza huh? Just come with me!~❞\n\nShe turned around and began to walk toward the closer pizzeria, motioning the girl to come.", "@AtorasuZencho « She then looked toward her twin and then wiped away her tears.\n\n❝I-I.. I want to be useful..❞!", "@AtorasuZencho « be able to help everyone.. I'm tired of being weak..❞\n\nA sigh escaped her lips and she looked down for a moment. »", "@AtorasuZencho ❝I.. I don't know.. My mind is blank.. I can't think in anything at all.. I.. I just want to get stronger.. I want to »", "@AtorasuZencho « and started eating it, some tears still rolling down her cheeks.", "@AtorasuZencho « Her hopes were still down.  But even like that she did what her twin asked her to do. She picked another piece of bread »", "@AtorasuZencho ❝But.. We are falling one by one.. Even the strong are falling... H-How can we possibly win this..?❞ »", "She simply turns around and starts running away as fast as she could. https://t.co/a265sq8yjF", "❝L-Leave me alone..! Gajeel-san..! You're not like that..! S-Stop..!❞ https://t.co/WPqL6me4Fr", "Steps back quickly. https://t.co/qWb2mfVA1l", "No it's not. Control yourself. https://t.co/DqtMoEPUIH", "Why though. Is scared. https://t.co/XNU4pjFWfW", "❝W-What happened with Gajeel-san..?❞", "@Banbietta She instantly got dizzy because of the loud yell on her ear.\n\n❝T-There is no need for such thing..! S-Stop please..!❞", "@Banbietta ❝S-Stop yelling miss.. Please..❞", "@RuinousPrincess K-Kawaiiii", "@SenchoBonney ❝Sure thing! Do you have only choice of what to eat so I can guide us somewhere that have it?❞", "@AtorasuZencho « are.. We are doomed... I-It's the end.. T-There's.. No way of winning this... Everyone will die...❞", "@AtorasuZencho « to eat anymore. The shock was too much for her. Her breath got heavier and she started sweating a lot.\n\n❝W-We.. We »", "@AtorasuZencho How would she be okay? If she was killed, there is no comeback. That's what Flare was thinking. She wasn't even managing »", "@AtorasuZencho « once doing so, a groan of pain escaped her lips. She was in shock. She couldn't believe that all that was happening.", "@AtorasuZencho ❝E-Erza-san..?!❞\n\nThat was news to her. Her eyes widened and instantly got full of tears again. She tried to sit up, but »", "@AtorasuZencho « She asked, actually getting worried about everyone, and once again feeling bad for not being able to help.", "@AtorasuZencho ❝Yuno... I'm right..? The one that is causing all this trouble..? She destroyed Fairy Tail..? Is.. Is everyone okay..?❞ »", "@AtorasuZencho « But now tell me.. What's going on..? What did I miss..? I mean.. All this battles happening.. I'm lost..❞", "@AtorasuZencho « slow, but it was being done in her pace.\n\n❝I-It's really good..~ T-Thank you for caring about me like that twin..~ »", "@AtorasuZencho With her low forces she extended an arm to grab a bread so she could enjoy the meal as well. Even to bite she was being »", "@AtorasuZencho « It will be lonely without you..❞", "@AtorasuZencho « I promise that to you. Just.. Let me recover and I will do whatever you ask. B-But for now.. Can you stay here with me..? »", "@AtorasuZencho « the girl returning to the room.\n\n❝H-Hey..~ I'm sorry for giving you all this trouble... I will repay you somehow later »", "@AtorasuZencho While the other redhead went away to get food, she closed the eyes to rest a little more. After some time she heard »", "@SenchoBonney ❝I will make sure to cook it for you sometime then! But what would you like to do right now?❞", "@CatBurglarThief ❝Chocolate is really good! But you've never eaten chocolate before Nami-san?❞", "@AtorasuZencho « get stronger.. I want to be useful to other people.. But.. For now I can only rest.❞", "@AtorasuZencho ❝B-Be careful please.. I'm still weak, and the stitches can open if I move too much.. B-But yes.. I will give my best to »", "(I got carried away) https://t.co/q9lS1JL3ZQ", "(wat--) https://t.co/0aYemxFSgH", "#SeductiveSunday https://t.co/sMQLlJDGu1", "『Fairy Tail Easter Egg Event』\n\n『Route 6』\n\n#FTRPEaster \n\nRead: https://t.co/FRir59qKx8", "@AtorasuZencho « sentence, clearly feeling really bad about all that feelings hitting her own mind.", "@AtorasuZencho « I-I Just want to be strong and helpful to everyone else..!❞\n\nTears started falling her eyes in the middle of her »", "@AtorasuZencho « consider how my friends would react.. I didn't consider how you would react... I was selfish.. S-So please forgive me.. »", "@AtorasuZencho « for doing something like that... I was feeling so useless that I thought it would be better to disappear... I didn't »", "@AtorasuZencho « For a couple minutes she stayed silent before finally opening the mouth to talk again. \n\n❝Forgive me... I.. I was stupid »", "@AtorasuZencho The one on the bed didn't smile a single moment though. She only looked away, ashamed of herself and what she have done. »", "@AtorasuZencho « ❝T-Twin..? H-Huh... Where.. Where am I..?❞\n\nIt was everything she said once she noticed that the other redhead was there.", "@AtorasuZencho « with her clothes. Only with a bra, panties and her stomach covered with bandages, besides the blanket covering her body. »", "@AtorasuZencho « completely healed, so she was unable to do so. She winced a little in pain before looking down at her body. She wasn't »", "@AtorasuZencho « She looked around trying to identify the place but without luck. She then tried to sit up, but the wound wasn't »", "@AtorasuZencho After all this time of rest after what happened, Flare slowly opened her eyes. She didn't know where she was at all. »", "@Witchworkx ❝H-Huh.. Okay then.. So.. What's your name..?❞", "Will spread love to help Shelbey", "@Witchworkx ❝How do you know..?❞", "@BootyDefender Yaaaas", "@Witchworkx ❝Afternoon weird gay witch.❞", "@OharaNicoRobin Gives a chocolate to her as a way to apologize for what she did yesterday.", "@BootyDefender Lets give love to everyone", "@BootyDefender Even who isn't cute is cute", "@BootyDefender Cuties everywhere", "@BootyDefender Shelbey is cute.", "@BootyDefender Daily Shelbey's appreciation hug.", "@BootyDefender Huuugs", "@Witchworkx https://t.co/F1dO19JpnS", "@TravelingCloth Is even more confused now. But doesn't move at all.", "Wonders why @TravelingCloth is putting scarfs on everyone.", "@Zetsuboob ❝B-But..! I-I don't want to be a bother to you..!❞", "@UltEngineer ❝M-Maybe..?❞", "@Zetsuboob ❝Huh.. W-Well.. If it's not me t-then I don't want to bother..❞", "@Zetsuboob Lifts hand. And hair.", "❝I-I know I'm very late but-but.. I finally finished my costume..~❞ \n\n#FTRPEaster https://t.co/IFTLnLxb5Q", "@ZennoNoJoou (Ohhhh-)", "❝Somwone created a cloning machine.. And is cloning me. Again and again.❞", "@ZennoNoJoou (I.. Don't get it- What's a budget?)", "@ZennoNoJoou Confused Flare is confused. https://t.co/U7VnNceMVb", "Will flarify some flarings", "Is flareconfused flareabout this flarethings", "@BootyDefender ❝Shelbey-san.. You look more... Man.❞", "@AtorasuZencho @KurokamiHeiress « lost from the blood loss.", "@AtorasuZencho @KurokamiHeiress « treatment, she wasn't in danger anymore. Now she only needed to rest to get back the energy that she »", "@AtorasuZencho @KurokamiHeiress At that moment she was already passed out. Her breath was still a little heavy. But thanks to the fast »", "@BoryokuNoKobito ❝W-Well.. I never tried to do that so.. I can't really know.❞", "@BoryokuNoKobito ❝R-Really..? And.. It really doesn't fall..?❞", "@BoryokuNoKobito ❝Your soda..❞", "@HalfGenieSavior ❝W-Well.. I guess I can accept then. Thank you for that..!❞", "@HalfGenieSavior ❝Are you sure..? I-It will not be a bother at all..?❞", "@HalfGenieSavior ❝I'm actually a little tired.. I guess I need to sleep.❞", "@HalfGenieSavior Still. Will double the time.\n\n❝So.. What are you up to now?❞", "@HalfGenieSavior Feels like she is losing. Needs to increase the time of her hair treatment.", "@HalfGenieSavior ❝Do you stay treating it for two hours straight, everyday?❞", "@HalfGenieSavior ❝T-Thank you..~ It's my most precious treasure in this world..~❞", "@HalfGenieSavior ❝It's a different name~ I like it!❞", "@HalfGenieSavior ❝I-I'm Flare..! Nice to meet you miss!❞", "@HalfGenieSavior Is surprised with the hug, but she just embraces the girl as well.", "@HalfGenieSavior ❝I-It's nothing much really..~ But you're welcome..~❞", "@HalfGenieSavior ❝W-Well, it wasn't all that..~ I just saw that you were in need, so I got you some..~❞", "@HalfGenieSavior ❝So.. How was it? You liked?❞", "@HalfGenieSavior Just waits her to finish the ice cream.", "@HalfGenieSavior Doesn't know why she sat on her lap, but doesn't mind at all.", "@HalfGenieSavior Gives some cookie dough ice cream to her.", "@AtorasuZencho « treatment to avoid any real danger.", "@AtorasuZencho « consider the size of the \"needle\", so it ended up not being big enough to be instantly fatal, but she would need »", "@AtorasuZencho « stomach. Her clothes were getting a darker tone of red because of the blood that were flowing. Good thing she didn't »", "@AtorasuZencho « I-I'm a burden t-to you and to everyone else..❞\n\nAfter that she coughed some more blood. One of her hands were over her »", "@AtorasuZencho « burned everything.. J-Just with your anger... I-I.. I will never be able to d-do that... I-I'm weak... I'm a failure... »", "@AtorasuZencho ❝B-Because.. It's the easiest way.. To get rid of m-my nuisance.. L-Look around... Look what y-you've done... Y-You »", "@RuinousPrincess (Since you RP with me still, I don't mind at all)", "@RuinousPrincess (Not even with Flare??? ;~;)", "@AtorasuZencho « F-Forgive me.. F-For giving you t-trouble..❞", "@AtorasuZencho « trembling to close. \n\n❝T-That.. T-That's what I-I deserve... I-I'm just.. A failed c-clone.. Or something l-like that.. »", "@AtorasuZencho « ground. She wasn't dead at all, but she was very weak because of the wound. Her eyes were still opened, but »", "@AtorasuZencho She then removed her hair from the tree, making it go back to it's normal form. Right after that she collapsed on the »", "@AtorasuZencho « Some seconds later she coughed some blood, her body started trembling and her breath got heavy.", "@AtorasuZencho « go through the tree and also her back, stopping only after getting out from her stomach. Her eyes widened with that »", "@AtorasuZencho « what she was planning, but then a gulp went down her throat and her closed her eyes tightly before making the hair »", "@AtorasuZencho « she was pinned against. She made the tip of that lock of hair stay like a giant needle. She hesitated a little in doing »", "@AtorasuZencho She continued silent while the other were talking, and without she notice she extended her own hair to behind the tree that »", "@AtorasuZencho « rolling down on her cheeks.", "@AtorasuZencho « the tree. Next she felt the hard slap on her face. She simply stayed looking down without saying anything, with tears »", "@AtorasuZencho No doubts she wasn't faster than the hair of the other redhead, so she was easily stopped, soon hitting her back on »", "@AtorasuZencho ❝No..! You are a version of me that worked out..! That is strong..! Not weak like me..!❞", "@AtorasuZencho ❝N-No..! Why are you even following me?! There's no reason to follow a failed version of yourself..!❞", "@RuinousPrincess (Don't flip her ;~;)", "@HonoNoTamashi Hides behind Natsu.", "@AtorasuZencho « things without thinking at all in the consequences.", "@AtorasuZencho She wasn't planning in stop at all. She had too many bad thoughts in her mind, and that were blinding her, making her do »", "@AtorasuZencho ❝L-Leave me alone..!❞\n\nShe said while continuing to run, without really caring about where she was going.", "@AtorasuZencho ❝I-I.. I just..❞\n\nShe didn't know what to say or do, so she simply turned around and ran away with some tears on her eyes.", "@AtorasuZencho ❝I don't know how..❞", "@AtorasuZencho ❝I agree.. But you managed to improve it.. I didn't..❞", "@AtorasuZencho ❝I told you, we are the same, but we are different.. You're strong physically and mentally, while I'm weak in both..❞", "@AtorasuZencho ❝It's not easy when I'm the useless one..❞", "@AtorasuZencho ❝I don't want to bother you... Sorry for making the invitation..❞", "(10 away from 2600--)", "@AtorasuZencho ❝I'm just your failed counterpart I guess.. I can't do anything to help anyone..❞", "@AtorasuZencho « eggs... I'm a disappointment...❞", "@AtorasuZencho ❝I'm a joke compared to you... You're here dealing with important things... And then there's me worrying about chocolate »", "@ZennoNoJoou (Same)", "@AtorasuZencho ❝I'm not going anywhere if my other self isn't feeling well.. It isn't even Easter yet. I will stay with you.❞", "@AtorasuZencho Instead of saying anything she simply embraces the redhead as a way to try to comfort her.", "@AtorasuZencho « worried about the other.", "@AtorasuZencho ❝D-Did.. Did anything happen..? Are you okay..?❞\n\nShe didn't mind that she refused it, but how she said it made her get »", "@AspectOfIce ❝That doesn't include the bunnies! They are a different case!❞", "@AspectOfIce ❝Of course it does!! Why do you think the bunny is the symbol of Easter?!❞", "@AspectOfIce Her hair reacts in the blink of an eye, instantly holding the egg before it reach the ground.\n\n❝BE CAREFUL!!!❞", "@AspectOfIce ❝Yes! All bunnies comes from chocolate eggs!~❞", "@AspectOfIce ❝Exactly! That's how it works!❞", "@AspectOfIce ❝Exactly! But different from a common egg, you need to keep it cold instead of warm. And you can't eat it of course!❞", "@AspectOfIce ❝I'm not smoking anything! It's true! Bunnies comes from chocolate eggs!❞", "@AspectOfIce ❝Only if you want a chicken. Because bunnies comes from chocolate eggs, not regular eggs!❞", "@AtorasuZencho « She said giving a chocolate egg to her counterpart.\n\n#FTRPEaster", "@AtorasuZencho ❝Twin..! Huh.. I know it's not Easter yet but.. It will have an anticipated celebration, and here's your invitation!~❞ »", "@GambollingFlame @WildWarPhoenix (Followed!)", "@9BallSeraph @AtorasuZencho @CrimsonRapunzel Doesn't know what's happening. Just waves.", "@GambollingFlame (Tell me if you move her to another one. I wanna know)", "@RushiKikku Flare uses wrap.", "@U7Icejin (Will watch some more now! And have a nice day too!)", "@U7Icejin (Yeah, that's what I meant-- I just wasn't sure how many episodes were XD)", "@U7Icejin (Tbh I just started. I'm at episode 6 of the regular one. I said that just because it's what everyone says XD)", "@U7Icejin (That makes all sense because you said 5 minutes and it lasted 10 episodes--)", "RT @TheEndMode: @AssertiveAtlas \"gehe... I guess I lost this duel.\" #BOV", "@iBustySamurai ❝Your chest is too big..❞", "@iBustySamurai ❝T-Too big...❞", "@HungryMidora @TheKokuryu « left her more secure.", "@HungryMidora @TheKokuryu « anymore. Probably it was that strong aura that she could feel getting out from Midora, something that »", "@HungryMidora @TheKokuryu « It was what she replied to him before once again look toward Acnologia. For some reason she wasn't afraid »", "@HungryMidora @TheKokuryu ❝D-Don't worry, I will not..! But if you think it's not necessary, then I can just stay out of it.❞ »", "@SapentoNoNaga ❝H-Huh..? D-Do.. Do I know you..?❞", "@GambollingFlame ❝N-No Mai-san..! I-Im talking about.. About your boobs..! T-They will come out if you keep jumping like that..!❞", "@HungryMidora @TheKokuryu « ❝Be careful, he is strong..! B-But I will give you assistance..!❞\n\n#MVRevolution", "@HungryMidora @TheKokuryu ❝Midora-san..!❞\n\nShe said once seeing that he appeared there. She looked up at him with a smile on her face. »", "@TheKokuryu « eyes fixed on him.\n\n#MVRevolution", "@TheKokuryu A gulp went down her throat since she knew who he were. Even like that she didn't run away. She stayed there with the »", "@GiantPupper ❝I-It's not time for that right now..❞", "❝This Ultra thing isn't anything! Anyone can come at me! I will defeat any of you!❞ \n\n#MVRevolution https://t.co/OSegqzV39W", "@CatBurglarThief ❝The flavor is really nice indeed~ But anyway, lets get our ice creams!~❞", "@CatBurglarThief ❝You really might like orange~ Even your hair is orange!~❞", "@SenchoBonney ❝W-Well.. What about spaghetti with white sauce?~❞", "@CatBurglarThief ❝I prefer chocolate!~ But I also like Hazelnut spread with skim milk and cocoa~ What about you Nami-san?❞", "@SenchoBonney ❝Sure thing! What do you like to eat Bonney-san?❞", "@SenchoBonney ❝Really? And the food is good? I'm learning to cook. I know some recipes already, but I have a lot to learn yet.❞", "@SenchoBonney ❝You are a babysitter? A pirate babysitter?❞", "@SenchoBonney ❝You're not old at all~ But do you have kids already?❞", "@SenchoBonney ❝Hmm... You look like... 23 or 24.. 25 at the max! Did I get it right??❞", "@SenchoBonney ❝That's a nice question actually.. How old are you Bonney-san?❞", "@SenchoBonney ❝E-Eh? Adopted? I don't think you're all that old..❞", "@SenchoBonney ❝That.. Doesn't count me right? I'm not a kid after all.❞", "https://t.co/gio0G9TnWK", "(Who even are you-) https://t.co/rYf3wOB5TK", "@CatBurglarThief « cream there just because it will be free for you right?❞", "@CatBurglarThief ❝H-Huh.. I really don't mind Nami-san~ It's Just Ice Cream..~ It's not expensive~ It's not like you will buy all the ice »", "@SenchoBonney ❝You know him as well? That's awesome! He is cool~ And a great friend!~❞", "Hopes @MegamiShishio kills him. He is scary.", "@HeartOfFilia ❝Blondie! Hello there! Good morning!❞", "@SwirlyBrow ❝Hope you're having a nice day!❞", "@SenchoBonney ❝Pirates? Like Luffy-san? You're a pirate as well? That's cool!❞", "@SwirlyBrow ❝Happy Birthday Sanji-san!❞", "@RubberySencho ❝Maybe... It's a kind of soup..?❞", "@SenchoBonney ❝Well, we are in Hargeon right now, the port city of Fiore~ But Grand Line? I've never heard of it too.❞", "JUST GIVES PIZZA TO BOTH OF THEM @SenchoBonney @SenchoHawkins \n\n❝THERE!!❞", "❝Bonney-san, make it stop..!❞ \n\nClearly talking about the smelling sequence.", "(I was wondering how we RP an Yu-Gi-Oh fight. So that's how- Holy shit it's exciting)", "Hugs and protects @OharasLegacy.", "@RushiKikku Flare used Lick.", "@RushiKikku Flare used Submission.", "@RushiKikku \n\nFlare used Sweet Kiss", "@RushiKikku \n\nFlare used Wrap.", "@SenchoBonney ❝It's in the north of Fiore. It's a /big/ village, simply because it's a village of giants..~❞", "@ChildOfShield Hugs because Steven said so.", "@DiabolosDragon (Yup, just making sure-)", "@DiabolosDragon (But Gasper was already from her Team no? He just kept himself locked in the room)", "@DiabolosDragon (Then.. Basically the same team that was before Issei enter for her team?)", "@DiabolosDragon (What's Rias team now?)", "@SenchoBonney ❝N-No no! It's magic..! Mine in special was a blessing from the dragon that protected my village~❞", "@SenchoBonney « eating them and getting abilities.❞", "@SenchoBonney ❝No I haven't. In fact I've never seen one before. I only know what they are because I know some people that mentioned »", "@WeaponTreasure @AtorasuZencho « still a little affected by the poison. But once seeing that it was Niang, she felt safe.", "@WeaponTreasure @AtorasuZencho Suddenly she was groped and dragged to another dimension apparently. She was confused about all that, »", "@CatBurglarThief « wouldn't need to worry about the burglar. She was trustable in the end. So she decided to be kind with the girl.", "@CatBurglarThief ❝W-Well, that's a relief..~ But would you like ice cream? I pay for you Nami-san!❞ \n\nShe was relieved that she »", "@SenchoBonney ❝Devil Fruit? Hmmm... I already heard about this... Isn't that rare fruits that gives powers to people?❞", "@SenchoBonney ❝I can control my hair at my will. Change it's size, shape and resistance, and also make it stay on fire~❞", "@SenchoBonney ❝But I love my hair~ And my magic depends of it, so I need to keep it beautiful and strong~❞", "@SenchoBonney ❝Thank you miss~ I-I mean.. two hours of treatment everyday makes this..~❞", "@SenchoBonney ❝H-Huh.. Nothing much miss.. I'm just.. Looking your hair.. It's very beautiful..~❞", "Stares at @SenchoBonney. She has a beautiful hair.", "Just keeps hugging @HonoNoTamashi and @RubberySencho, one on each boob. https://t.co/NhQQEA50XZ", "Hugs @HonoNoTamashi and @RubberySencho.\n\n❝Good luck you two~❞", "❝It's the least I can do..❞ https://t.co/YftxwqZUeE", "❝I-I will! And I will prepare another one for you..!❞ https://t.co/mzbJwOrGHJ", "❝FORGIVE ME!! I-IT WASN'T ON PURPOSE..!❞ https://t.co/r6Qio3eU53", "❝I-I'M SORRY!! IT WAS AN ACCIDENT..!❞ https://t.co/l4XFo0I5Xu", "@HonoNoTamashi @OmegaFireDragon Hits it with her hair by accident. Oops. https://t.co/Sk7CJKKx1N", "❝Another war..?❞", "@TheGoodLoser ❝There's nothing much to say.. It's a village, and everyone from the village have this crest.❞", "@TheGoodLoser ❝.... No.. That's the crest of my village.. The Sun Village..❞", "@TheGoodLoser ❝H-Huh.. This one..?❞\n\nShe points at the said tattoo on her left breast.", "@TheGoodLoser ❝H-Huh.. I will not put an apron..❞", "@CatBurglarThief « her index fingers together.\n\n❝I-I'm all good Nami-san..~❞", "@CatBurglarThief ❝E-Eh.. N-No thank you.. There's nothing that I need right now..❞\n\nAn awkward chuckle escaped her lips while she poked »", "@iBustySamurai (Thanks for that~ But this isn't really true. There's one that is way better than me.)", "@YopparaiMajikku @HakaiVermouth ❝I just want a Happy Meal...❞", "❝No, I Just want the Happy Meal.❞ https://t.co/hIny2YUa2h", "@HakaiVermouth ❝I want a Happy Meal please.❞", "@SenchoKid (Nice! Just tell me if you need)", "@SenchoKid (I have a Tsuyu if that can help in anything)", "@CatBurglarThief ❝You.. Will not steal anything from me.. Right Nami-san..?❞ \n\nShe trusted in the girl, but she just wanted to make sure.", "@CatBurglarThief ❝Y-You did steal them... W-Well, you're a pirate so.. I guess that's a normal thing right?❞", "@KurokamiHeiress « Medaka-san..~ I-I hope I can get stronger as well..~❞", "@KurokamiHeiress « believe that such thing can happen.. T-Then I guess I could give it a try as well..~ T-Thank you for inviting me »", "@KurokamiHeiress ❝W-Well.. You're way stronger than me Medaka-san.. So probably you will get stronger faster.. B-But well.. If you »", "@KurokamiHeiress « would that be? And how would that help her with her confidence?", "@KurokamiHeiress ❝An organization..? W-What kind of organization Medaka-san?❞\n\nNow she was confused again. What kind of organization »", "@KurokamiHeiress « continued talking.\n\n❝And.. What's your idea Medaka-san..? How can I do that..?❞", "@KurokamiHeiress ❝W-Well.. It's not that easy to do it Medaka-san.. I'm trying but.. It's hard..❞\n\nShe left out a sigh and then she »", "@KurokamiHeiress « the girl. Did she appeared just to talk about this again?", "@KurokamiHeiress ❝H-Huh.. Yes I do remember Medaka-san.. But why are you mentioning this right now..?❞\n\nShe looked confused toward »", "@SaijoNoHaisha (I guess I will give it a try)", "@SaijoNoHaisha (I'm thinking about it. Here in Brazil it's in volume 25)", "(Is Toriko's manga worth of buying?)", "That's what happens when you give chips to Bastet https://t.co/K6ZqRxLMH0", "@SaijoNoHaisha (People only use that art to make Bastet accs.\n\nThat leads to the same thing no?--)", "@AHeroForFun Tripped even in the username", "@TheEndMode (Yaaas, and no problem!)", "@TheEndMode (Done~)", "@CatBurglarThief ❝E-Everything?! Y-You.. You didn't steal Nami-san.. Or did you..?❞", "@KurokamiHeiress ❝I recognize your voice Medaka-san~❞\n\nAnd so she turned around, already giving a tight hug on the blue haired girl.", "@iBustySamurai (@SunekuSoru)", "(Which one should I use on my Kinana?) https://t.co/BhoyexzsR5", "@WeaponTreasure @AtorasuZencho Is passed out suffering from the poison that were in the food that she ate.", "@KoronaFlare « on the ground passed out from the poisoning.\n\n#MVProm", "❝I-I'm.. I'm not feeling well..❞\n\nHer vision were getting blurry. She did eat something, Sotheby's poison were stronger. Soon she fell »", "@HanzoLegacy ❝You look great Asuka-san! Don't you worry!❞", "@iBustySamurai ❝O-Okay then..❞\n\nShe was unsure of what to do, so she simply followed the girl, letting her guide all of her steps.", "@RushiKikku ❝Yes I am! It's being cool so far~ There's some known faces, and even now that you're here too~❞", "@AtorasuZencho ❝Twin..! No!❞", "@WeaponTreasure @TheGoodLoser Just hides behind her.", "@RushiKikku ❝Sorry if I scared you.. I-It's just that I'm happy to see you around here Blondie..! It's been a while already..!❞", "@iBustySamurai ❝H-Hai..!❞ \n\nAnd then she held the girl's hand so they could dance.", "@HanzoLegacy ❝Well, you're already in it, so just stay!❞", "@iBustySamurai ❝I-I guess so..! But, I don't really know how to dance Chifusa-san.❞", "@WeaponTreasure ❝T-Thank you for that..❞", "@RushiKikku ❝BLONDIE!!!!❞ \n\nHugs her tightly from behind.", "@HanzoLegacy ❝H-Hai.. I-I.. I will do that..! Y-You too..!❞", "@iBustySamurai ❝But.. You're in the water.. And naked.. Shouldn't you at least get out from the water first..?❞", "@WeaponTreasure ❝That's why I'm asking your help..! I prefer to be a pet than a slave..!❞", "@WeaponTreasure ❝Help.. Someone wants to make me their slave..❞", "@iBustySamurai ❝W-Well.. I just got here, but I'm enjoying so far~❞", "@DakuUizado @Doragoneel ❝Maybe you're the strongest.. But you sure need a grammar book..❞", "@HanzoLegacy ❝B-But..! I-I..! I..!❞ \n\nShe didn't know what to say at all.", "@iBustySamurai ❝And.. Are you enjoying the prom so far Chifusa-san?❞", "@HanzoLegacy ❝I-I'm not..!❞", "@iBustySamurai to*", "@iBustySamurai ❝I-I.. I'm Flare..~ Nice tô meet you miss..~❞", "@Doragoneel ❝Y-Your brother want to attack me..❞", "@TheGoodLoser ❝No.. That never!❞", "@iBustySamurai ❝W-Well.. If you don't mind then I guess it's fine.❞", "@iBustySamurai ❝You.. Don't mind being naked in front of everyone..?❞", "@iBustySamurai ❝It's all exposed miss..❞", "Is all alone on the corner like always. \nBut is eating a dessert that Shiranui forgot.\n\n#MVProm", "@TheGoodLoser « she takes off her clothes and puts on the apron before returning her hair.\n\n❝T-There..❞", "@TheGoodLoser ❝H-Hai..❞\n\nAnd then she she places her hair around her to cover everything, making a kind of changing room. After that »", "@iBustySamurai ❝H-Huh.. Excuse me... Your chest..❞", "@TheGoodLoser ❝I don't have an apron though..❞", "@TheGoodLoser ❝I-I want my voice..❞", "@TheGoodLoser ❝It's embarrassing for me..❞", "@TheGoodLoser ❝B-But.. This is embarrassing..❞", "Was about to eat something from the buffet but almost lost her hand. Reason? Shiranui.\n\n#MVProm", "Walks away from Yuno as well.\n\n#MVProm", "@TheGoodLoser ❝I don't want to lose my voice..!❞", "@Doragoneel ❝You look funny Natsu-san..~❞ \n\n#MVProm", "@TheGoodLoser ❝E-Excuse me..❞ \n\nShe then slowly stepped back to go away.", "@TheGoodLoser ❝I will yell..❞", "Is afraid of the pinky that killed her. #MVProm", "@TheGoodLoser ❝You want to force me to do something that I don't want..❞", "@TheGoodLoser ❝I don't want to!  And if you try to force me I will yell..❞", "@TheGoodLoser ❝I-I will not do that..!❞", "Now goes to the #MVProm https://t.co/cVcSEbSxb4", "@TheGoodLoser ❝I.. Will not even answer to that..❞", "@TheGoodLoser ❝What do you mean by that?❞", "Getting ready for the #MVProm https://t.co/zAMTSCKmgt", "@CatBurglarThief ❝And anything that is free for you, is a good thing ne?~❞", "@TheGoodLoser ❝Yes you can! They are perverted! It's not something to take serious! It's just for you perverted guys to have fun..!❞", "@CatBurglarThief ❝I-I'm doing fine~ And everything is good as well~ What about you Nami-san? Did you get any money this week?~❞", "@TheGoodLoser ❝I do know..! But they are not supposed to be taken as reference..!❞", "@TheGoodLoser ❝I... Huh.. I don't even know who to answer to that..❞", "@RubberySencho (I know your accounts- Shh)", "@DunScaith (W-What?)", "@RuinousPrincess ❝Morning Rias-sa-- I-I mean, Rias..!❞", "@KoronaFlare « accounts belongs to friends-)", "(So, I will be doing a massive unfollow spree on all my accounts. So if you lose too many follows, ask me- Maybe I will forget that some »", "@EnteiKoen @SaijoNoHaisha (cries)", "@SaijoNoHaisha (Gimme candies)", "@SaijoNoHaisha (You hate me ;~;)", "(Just noticed I reached 2.5K. Thanks everyone!)", "@CatBurglarThief ❝It's been only a week I guess.. B-But I'm happy to know that you missed me Nami-san! Thank you!❞", "@HanzoLegacy ❝What kind of tea..? Huh.. I don't think I have ever stopped to choose a favorite one.. Hehe..~❞", "@CatBurglarThief She got surprised by her reaction. Why was she so happy?\n\n❝N-Nami-san? Are you okay? What happened? Why are you so happy?❞", "@CatBurglarThief ❝Hello there Nami-san!❞", "Would hug the little girl with blue hair, but now is scared of her after seeing she eat that plate of donuts.", "@TheGoodLoser ❝I-I know.. But it's also impolite to stare at someone's chest..❞", "@xTheGoldenHind (BANINGU)", "@TheGoodLoser ❝I-It's.. It's Flare.. W-Why do you ask..?❞", "@TheGoodLoser ❝H-Huh.. I.. I heard someone calling my name.. Excuse me..❞", "❝Misogi-san is so pervert..❞ https://t.co/uaVKsV70nj", "My love compatibility with @KoronaFlare is 95%\n\nCalculated with https://t.co/TVMg6XiloE\n\n. https://t.co/yXJizjixoC", "@Electrahato When you don't love yourself enough.", "@HanzoLegacy She didn't know the direction, so she simply followed the girl toward the Tea Shop.", "@WielderOfLae (yeah, I knew it would be something like that when I saw his life bar was purple. And you fight him again later)", "@ErzaSukaretto (I'm your mom-)", "@ErzaSukaretto this app knows the truth--", "@RuinousPrincess Consequence of the last night. Flare was still on the bed.", "@RuinousPrincess The blanket was Flare's hair tho.", "@HanzoLegacy ❝Tea seems a nice idea..~ They make me relax. So why not?~ Lets go then..!❞", "@ErzaSukaretto (Thanks!)", "@HanzoLegacy ❝I don't really know what we could do.. I don't have any idea in mind.. Do you have any?❞", "@ErzaSukaretto (Ohhh! We a lil close but a lil far)", "@ErzaSukaretto (What? Where are you? I mean, it's almost 1am here too)", "@HanzoLegacy ❝Yes.. We should do more things together Asuka-san.❞", "@HanzoLegacy ❝I guess I can say the same~ Just being me~❞", "@ZennoNoJoou (Hack his account-)", "@HanzoLegacy ❝It's been a while! How are you doing?❞", "@HanzoLegacy ❝Asuka-san!❞", "@BurakkuGoku cries", "@RuinousPrincess (Oh, I'm relieved.)", "@RuinousPrincess (She dies?? ;~;)", "@FutsuNaShujinko Kicks him out", "@FutsuNaShujinko RUNS FASTER", "@FutsuNaShujinko Runs away", "@FutsuNaShujinko Noooo", "Watches her twin and Timo. https://t.co/3gjJ6H10ZX", "@RuinousPrincess Yes please Rias-sama.", "@RuinousPrincess Hug, pat and feed Flare too.", "@ErzaSukaretto (Eileen better--)", "@ErzaSukaretto BUT EILEEN!", "MY BBY EILEEN FINALLY https://t.co/n3VULo7HgC", "@RuinousPrincess ❝R-Rias-san..❞", "@KurokamiHeiress HUUUUUUUGS", "@FlamingAkuma ❝I'm Flare as you already said~ It's nice meeting you personally Akarui-san!~❞", "@FlamingAkuma ❝I don't think we have introduced before.. But I did see you before~ Because of your guild~❞", "@GambollingFlame ❝Mai-san..! They will jump out..!❞", "@WeaponTreasure ❝I-I'm not a pony..! Humpf..! B-But.. I guess it's not that bad.. Since I can live my life..❞", "@WeaponTreasure ❝Pet..? But.. I'm not an animal.. I'm a person.. I can't be a pet..❞", "@WeaponTreasure Somehow is alive again. \n\n❝H-Huh.. Is this the heaven..?❞", "@SaijoNoHaisha @AtorasuZencho (No one warned me about that- Now it's kinda late.)", "@AtorasuZencho (But Flare asked why Yuno was a threat so-- It was kinda my fault-)", "@DakuUizado (Just like this little guy on your shoulder-)", "(Second time a character of mine dies without being involved-- Remember when Spider Man killed my Hancock-)", "@BrokenPinkette « completely on the ground. There was no return..", "@BrokenPinkette « was sent in the air, falling a few meters away from there, and later her body fell on her knees before collapsing »", "@BrokenPinkette She had no time to react at all, and even if she had, she wouldn't be able to do anything. In the next second her head »", "@BrokenPinkette « was emanating from her. Because of that she stepped back to keep some distance from her. https://t.co/QSj95PVfPl", "@BrokenPinkette ❝W-What..? Who.. Who are you miss..?❞ \n\nShe didn't know that /this/ was Yuno, but she could feel the devilish aura that »", "❝W-Who is this Yuno..? And why is she a threat..?❞", "@KurokamiMode ❝Excuse me.. Medaka-san..?❞", "@AztecServant ❝Miss... Huh.. Your chest is.. Appearing..❞", "Why I'm needing to update my DMs manually? Ffs", "BEST PERSON EVER https://t.co/iFeniKX66g", "❝Even though you never remember my name.. You're a great friend..!❞ https://t.co/R3oUdvsdub", "https://t.co/Ls6CtF7OO1", "@KurokamiHeiress Covers herself with her hair to keep dark.", "@KurokamiHeiress @RuinousPrincess Waits for one as well. In the darker corner.", "Didn't I just say I would claim you? Yes I did. https://t.co/KhGQYrgX2n", "@Electrahato Will claim the only Shelbey then.", "@Electrahato But Shelbs-", "@RuinousPrincess Rias will kill Flare someday.", "@Electrahato Two Shelbeys better than one Shelbey.", "@Electrahato ❝Can I clone you?❞", "@Electrahato ❝Yes. I want to have a Shelbey for me~❞", "@Electrahato ❝Shelbey-san, where can I buy one of you?❞", "@AtorasuZencho (Nah)", "@AtorasuZencho (I'm Carol)", "❝Gil-san.. How.. Vulgar..❞ https://t.co/nkXO6a47eD", "@FlamingAkuma ❝Welcome back..~❞", "@FaerieNoMajin ❝Where have you been Mira-san..?❞ \n\nStill hugging the girl tightly, crying like Juvia.", "@iJanenba Nooo", "@iJanenba https://t.co/RMD7N4mHI1", "Needs a Shelbey as well. Wonders where she can get one.", "@AtorasuZencho @SaijoNoHaisha Can't at all.", "@SaijoNoHaisha @AtorasuZencho Doesn't learn if. Too weak to do that.", "#SeductiveSunday https://t.co/RsOdBDRPjz", "@BustingGlacier Sure thing. I will be waiting", "@KurokamiHeiress ❝None of that are good in me..❞", "@KurokamiHeiress @AtorasuZencho ❝I don't know what that means..❞", "@AtorasuZencho ❝That's what you think.. We are very different..❞", "@AtorasuZencho ❝We are different..❞", "@KurokamiHeiress @AtorasuZencho ❝But I am not.. Maybe she is, but I'm not..❞", "@BustingGlacier She is there filled with spider webs", "@AtorasuZencho ❝I'm not though..❞", "@BustingGlacier ?", "https://t.co/tFNV8VrtHT", "@FaerieNoMajin HUUUUUUUUGS TIGHTLY", "https://t.co/Y8GLiGXVVz", "❝Pretty sure this Flare isn't me.. So why should I care..?❞", "@Viseleaux ❝I will not.. I'm no one.. People don't care about me..❞", "@Viseleaux ❝There's no action figure of me..❞", "❝What's with Steven-san and Action Figures..?❞", "@HanzoLegacy ❝Yours are way bigger..❞", "@HanzoLegacy ❝N-Not at all..❞", "❝S-So big..❞ https://t.co/jqgx5akpJe", "@BoubastisUbasti Pat pats.", "@SavageKakarot @RuinousPrincess No, me!", "@SavageKakarot @RuinousPrincess Yes I know. You shhhhhhhhh", "@SavageKakarot @RuinousPrincess NO S(HE) IS MINE", "@WeaponTreasure @AtorasuZencho Doesn't know what's happening. Just screams for help.", "@ErzaSukaretto (Thank you for that *^*)", "@RuinousPrincess ❝C-Can.. Can I have one too..?❞", "@RuinousPrincess Passes out because of the amaziness.", "@DunScaith (What is this?? It's just an art or a cover to some manga?)", "@BoubastisUbasti ❝W-What.. Are you doing..?❞", "❝I wonder why this Valentine's Day is looking more like Easter than Valentine's Day.. I mean, everyone is focusing on the chocolates..❞ https://t.co/P1Tohj4VzY", "❝I'm sure Steven-san will give the biggest headpat once he get that character he wants in that game he plays.❞", "@RuinousPrincess ❝A-And where's her..?❞", "❝I did~ Even though he never remembers my name.. But I heard that this is a common thing when it comes to him.❞ https://t.co/da5rRYkdNw", "❝Luffy-san talks about you sometimes..~ I pretty much already know everyone from his crew~ I'm Flare..! Nice to meet you personally~❞ https://t.co/WV6s7cazQd", "❝Treasure... What kind of treasures you think that people would like?❞ https://t.co/1nhKsk2XLM", "❝Huh.. I'm feeling that you are excited just because a lot of guys will give you chocolate..?❞ https://t.co/nYfa6hOFGT", "❝Nami-san seems excited for Valentine's Day. I wonder who is her Valentine...❞", "@RuinousPrincess And she is totally loving that. Casually wraps her hair around them to make them cuddle tighter.", "@RuinousPrincess Dorsnt know how to react. So she just cuddles as well and sleeps happily.", "#FTRPValentine \n\nDoesn't have a Valentine\n\nJust... Stays in her house. Alone. Sleeping.", "❝Ice cream is important though Steven-san..❞ https://t.co/B1bclSyG7Z", "@RuinousPrincess Casually is on Rias's bed.", "@BlueRoseYukino ❝I'm not! I just can't explain right now Yukino-san..!❞", "@iLyonVastia ❝No time to explain!❞", "❝This guy didn't die when he was killed..❞", "❝Apparently it was just a joke.. That.. Isn't something to joke about..❞", "❝H-Huh.. was that.. A real death or he is just pretending..?❞", "@RuinousPrincess ❝But.. I'm not worth Rias-san..❞", "@RuinousPrincess ❝Y-Yes but.. You're so busy and with more important things to do..❞", "@RuinousPrincess ❝W-Well.. I see you around but.. I just stay afraid of bothering..❞", "@RuinousPrincess ❝We.. Could talk..?❞", "@NamelessHeroism https://t.co/20BPUMXipv", "@VengefulGoldenF Runs", "@BlueRoseYukino ❝No time to explain!!❞", "Just grabs @BlueRoseYukino with her hair and runs away.", "@RushiKikku Heavy breath behind her.", "❝I will just.. Sit on my corner..❞", "@GiantPupper ❝W-Why you always do this..?❞", "❝Huh.. Good evening..❞", "@RushiKikku ❝Good morning Blondie..~ It's time toward up..~❞", "@FutsuNaShujinko (How the fuck do you have 40MB of accounts?)", "@FutsuNaShujinko (Smhsmh)", "@RushiKikku ❝B-Bloooondieeee..~❞", "@FutsuNaShujinko (Shhhhhh I'm not on her because I don't see the verse-)", "@FutsuNaShujinko (why I'm not in that medaka group?)", "@AtorasuZencho @Viseleaux ❝Why do you complain?❞", "@Viseleaux @AtorasuZencho Doesn't know what is happening.", "@FleurOfOhara ❝I hope you had a great day..~ And.. Y-You are Robin I'm right..? Luffy-san talks about you sometimes..~❞", "@FleurOfOhara ❝H-Huh.. I heard it's your birthday so.. Happy birthday miss..~❞", "@RushiKikku Just stays on the side of her bed watching the blonde while she sleeps.", "@RushiKikku Staaaaaaaares", "❝B-But.. If you burn you will die..!❞ https://t.co/5lNdSKsNAW", "RT @DimariaYesta: (What I find cool is that Dimaria's hair suddenly got longer.) https://t.co/TTcW18Q22n", "@GodIyGoku Whyyyyy", "@BurandoSeirei ❝W-Well.. I guess I can call you Lucy then.. I just.. Don't feel that intimate to call you by your name..❞", "@BurandoSeirei ❝How is that embarrassing..? you're blonde right?❞", "@BurandoSeirei ❝B-But.. I always called you Blondie.. What's so bad about it..?❞", "@BurandoSeirei ❝I'm here have a long time Blondie. Didn't you see me?❞", "@BurandoSeirei ❝Not at all Blondie..❞", "❝Will you be my valentine @RuinousPrincess?❞ https://t.co/iPy9nv8wdH", "@KenshiNoZoro (Ye- Cause I have almost 2500 followers so we can do a half rp--)", "@GambollingFlame « compliments..~ T-The same goes to you..! And also.. My name is Flare..~ Nice to meet you..~❞", "@GambollingFlame ❝H-Huh.. It's just that.. I don't hear that so much s-so.. I'm not used to it at all.. B-But I really appreciate your »", "❝Gil-san is cute when she is laughing..~❞", "@KenshiNoZoro (And also our half RP)", "@RubberySencho (I'm not--)", "@RubberySencho (For a moment I thought that was a boner-)", "@BlackCatAssasin Would like to know how is the feeling of being part cat.", "@GambollingFlame « poking them against each other.\n\n❝T-Thank you for the compliments miss..~ I-I really appreciate that..~❞", "@GambollingFlame A blush instantly appeared on her cheeks after that compliments. She placed her index fingers together a started »", "@BlackCatAssasin That's all she do.", "❝G-Good morning..❞", "@GambollingFlame ❝Rapunzel..? Huh.. W-What does that mean miss..?❞", "My Twitter Valentine is: @RuinousPrincess\n\nFind yours at https://t.co/jldy1WitMX\n\n. https://t.co/HUrahbD0HO", "@KurxsakiIchigo (What-)", "@KurxsakiIchigo (Fuck-)", "@KurxsakiIchigo (I have almost half of that. Can you half RP with me?)", "@DunScaith Pokes", "When Juvia steals your hair style. https://t.co/KeQ8MsNW2W", "❝Why so many headpats..?❞ https://t.co/4iwdmzFDYB", "@HanzoLegacy ❝W-Well, you don't need to ask at all..~ You can give me a hug whenever you want..~❞", "❝H-Huh.. Thanks..?❞\n\nIs a little confused with the headpat. Wonders if he is spending time with Steven. https://t.co/GuQtW1iHQ0", "❝Y-Yes..! I don't get in trouble a lot at all.❞ https://t.co/VUz2U5nyXW", "@HanzoLegacy ❝You were thinking on scaring me though..❞", "@HanzoLegacy ❝I can hear everything you're saying Asuka-san.❞", "❝Huh.. Hello to you too then..❞ https://t.co/RubOlPl8XP", "@OriginalGogeta to*", "❝Doesn't seems you're enjoying tô do so though..❞ https://t.co/PPPzJy8eXt", "❝Huh.. Anything wrong..?❞ https://t.co/IAUvfJ2HQk", "❝G-Good evening..❞", "@CopyCatsPride ❝W-Well.. It was nice meeting you..~ Hope we can become friends Luke-san..~❞", "@GureiFuruubasta ❝H-Huh.. Sorry for what Gray-san..?❞", "❝Cheers love! The cavalry is here! N-No.. Wait.. That's not my script..❞", "@MusukoNoHono (No problem at all!)", "@MusukoNoHono (Follow Friday. It's like, a list of recommendations of accounts to follow. And they do that on Friday-)", "@CopyCatsPride She slowly nodded her head before cleaning the rest of her tears.\n\n❝H-Hai..~ Thank you Luke-san..~❞", "@GenesisChampion ❝I-I don't want to use money with boxing gloves..!❞", "@HanzoLegacy Doesn't know what to believe anymore.", "@HanzoLegacy Is now scared of Asuka.", "@CopyCatsPride « know if I will be able to do the same right now..❞", "@CopyCatsPride « B-But.. I'm not emotionally ready to train or do something like that.. I-I know everyone is fighting.. B-But.. I don't »", "@CopyCatsPride She instantly wiped her tears away with her hands and then stayed staring down for a moment.\n\n❝M-Maybe you are right.. »", "@CopyCatsPride « about a certain someone that wasn't between them anymore.", "@CopyCatsPride « my limit.. I.. I was about to train with her b-but then..❞ \n\nInstantly tears formed on her eyes once remembering »", "@CopyCatsPride ❝But.. I don't know how I can improve my magic.. Doesn't matter how much I train, I.. I feel like I already reached »", "@CopyCatsPride ❝But I'm not even strong to hold it while they are away.. And what kind of friend I am if I don't even go make justice..?❞", "@CopyCatsPride « fighting now and only yesterday I discovered what was happening... I.. I guess I should just return to my village..❞", "@CopyCatsPride ❝I am.. But.. I don't know.. I feel like I'm just being a burden to them.. I never know what's happening.. They are »", "@CopyCatsPride ❝O-Oh.. Heh.. S-Sorry..! I-I.. I'm a little slow to understand figure of speech.. Normally I take them literally..❞", "@CopyCatsPride ❝Y-You have a horn?! You're a demon or something like that?!❞ \n\nShe was a little slow when the matter was a play of words.", "@CopyCatsPride ❝Y-Yes.. That's my name..~ And you are Luke right..?❞", "@HanzoLegacy ❝Y-You don't really need to do all that Asuka-san.. I-It's not necessary..~❞", "@HanzoLegacy ❝May 3rd! This will be my birthday! Because it's the Day of the Sun!❞", "@HanzoLegacy ❝May 3rd!!❞", "@CopyCatsPride ❝Huh.. Hello there..?❞", "(20 away from 2400--)", "@ObsidianHeavens (I'm sorry--)", "@PhotophobicMage ❝Only what happened in the games.. But I have no idea what is happening now..❞", "@PhotophobicMage ❝I only heard about that later.. I.. I actually feel so bad..❞", "@PhotophobicMage ❝I-I'm sorry.. People don't really tell me what's happening, so I'm always left behind..❞", "@PhotophobicMage ❝Fight against what..?❞", "@PhotophobicMage ❝What's happening Mana-san?❞", "@JikanMegami (Brandish pretty much will. I don't know about Dimaria.)", "❝Lyon will cry.❞", "@DivineDoragon ❝I'm just kidding Sting-san! Of course I missed you..!~❞", "@DivineDoragon ❝Were you away?❞\n\nJust pretending that she didn't notice at all.", "@DivineDoragon ❝Sting-san..! You're here!❞", "@ZennoNoJoou ❝Welcome to the fun Gil-san!❞", "@JoseiDorobou ❝Heh.. I'm already getting use to that to be honest..~ Everywhere is full of weird but cool people~❞", "@JoseiDorobou ❝Well, it's nice to finally meet you..~ And I hope you're enjoying this car wash!~❞", "@JoseiDorobou even*", "@JoseiDorobou ❝It's nice to see you around here~ Ecen though we never talked at all, Luffy-san talks about you~❞", "@JoseiDorobou ❝Nice bikini Nami-san..!❞", "@Namekian ❝I am having though!❞", "@Namekian ❝Humpf!❞ \n\nJust cleans the bird poop.\n\n❝There! Happy now?!❞", "@Namekian ❝That's unfair!❞", "@Namekian ❝What? But.. That other girl is being paid..!❞", "@KurxsakiIchigo (Follow me btw Jay)", "@Namekian ❝Blame the bird, not me. You will need to pay again.❞", "@HanzoLegacy ❝Now lets just enjoy the day!~❞", "@Namekian ❝Huh..❞\n\nJust grabs a water spray and sprays all over the car.\n\n❝There you go..?❞", "@HanzoLegacy ❝That's too sudden.. I will think in a day and then.. maybe..?❞", "@KurxsakiIchigo (I WILL KICK YOU)", "@KurxsakiIchigo (TELL ME)", "❝W-Well.. Okay then scary guy..❞ https://t.co/zBq9zyXuVR", "@KurxsakiIchigo ( What you doin-)", "@HanzoLegacy ❝B-But when exactly..?❞", "❝It must be horrible.. Die twice..❞ https://t.co/22ik4YqHjh", "@Zetsuboob ❝I'm there..!❞", "❝And.. If a hollow die.. Where does it end?❞ https://t.co/dJknSuFVG6", "@Namekian ❝Just a single spray is enough to clean everything.❞", "@HanzoLegacy ❝Don't mindit really.. I already accepted this fact, even though it would be good to know my birthdate..~❞", "❝I-I understand.. And.. Huh.. What happens there? I mean.. Can you die..?❞ https://t.co/wU6y9fFSsi", "❝It will take all day to clean it though..❞ https://t.co/Iuog36ktPK", "@Namekian ❝It's a little car..❞", "❝I-I see.. It's a little creepy but.. You seems very solid for me..❞ https://t.co/WAxw422nBP", "@HanzoLegacy ❝I am enjoying it as well~ Everyone seems to be having fun~❞", "❝Huh.. Dirty like that.. I recommend you buy a new one instead..❞ https://t.co/cNtaWrQ9fN", "❝T-Then.. It's a world of ghosts..?❞ https://t.co/PtHY1lJ531", "@HanzoLegacy ❝I know so!~ But it's not having so many cars at all.❞", "@HanzoLegacy ❝Y-You're looking great in it..! It really fits you..~❞", "❝The place is like the name says..? It's rather.. empty?❞ https://t.co/0ChtU6Gp7R", "❝At least we know the difference of \"their\" and \"they're\".❞ https://t.co/7zejwxMG1P", "❝I-It must be a hard job..❞ https://t.co/1FuCHuyMQW", "@HanzoLegacy ❝T-Thank you Asuka-san..~ And you? What will you use?❞", "❝I see.. Are you really the ruler of your world..?❞ https://t.co/PCFNf0qkYa", "❝I didn't know that you have TV in your world..❞ https://t.co/QDW6B4bay3", "@HanzoLegacy ❝But.. I'm already wearing what I will use.❞ https://t.co/ZlLHLKTcIM", "@HanzoLegacy ❝I-I am..~ It seems fun..~❞", "Blink blink.\n\n❝I.. Don't know what you talking about.❞ https://t.co/NZchZ4pvlT", "@Zetsuboob ❝It's scary..❞", "@HanzoLegacy ❝Are you also joining the car wash?❞", "Secretly does too. https://t.co/nk2PL1koWR", "@HanzoLegacy ❝H-Hello again!~❞", "Still scares everyone. https://t.co/9crIhHjxxJ", "that mask makes her scary. https://t.co/azDw0AA7bJ", "❝Okay.. Huh.. I guess no car then..?❞ \n\n#Luffy2017", "❝So.. Any car for me to wash..?❞\n\n#Luffy2017", "#Luffy2017 https://t.co/I7elMdPZ89", "❝Car wash..? T-Then I should dress properly..❞ \n\n#Luffy2017 https://t.co/CPnHE91keh", "@SaijoNoHaisha ❝I-I see you got out from this safe as well..❞", "@HanzoLegacy « a lot..!❞", "@HanzoLegacy ❝T-Thank you for the nice words Asuka-san..~ I really appreciate all that..~ I'm already happy that I met you..~ Thank you »", "@HanzoLegacy ❝No I didn't.. If I don't know when is it, I can't really celebrate..❞", "@HanzoLegacy ❝It's not so cool.. Because I don't know my birthday too..❞", "@HanzoLegacy ❝W-Well.. I don't really know how old I am.. It's a long story..❞", "@GenesisChampion ❝But I don't know requip magic to put gloves on me!❞", "@GenesisChampion ❝I don't think gloves are enough..❞", "@GenesisChampion ❝B-But it will hurt..! I don't want my hand to hurt..!❞", "@GenesisChampion ❝How is the right form?❞", "@GenesisChampion ❝B-But.. It would hurt on me..❞", "@GenesisChampion ❝I-I don't.. Why would I..? it would hurt..❞", "@GenesisChampion ❝But.. You're punching a wall..❞", "@AtorasuZencho ❝I don't care..❞", "@BootyDefender ❝You look like a little kid with them..~❞", "❝I can't be a man at all..❞ \n\n(More like I can't find a good pic that would look like a Flare Genderbend lol)", "@HanzoLegacy ❝I-It's nice to meet you too..~ I'm Flare..~❞", "@HanzoLegacy ❝W-Who are you..?❞", "@KurokamiHeiress ❝Medaka-san.. Why are you changing everyone's gender?❞", "@JusenkyoCursed ❝Medaka-san..? why she doing this?❞", "@JusenkyoCursed ❝Who..?❞", "@GambollingFlame ❝You're beautiful miss..~❞", "❝Why.. Everyone is changing gender..? No, better.. How..?❞", "@JusenkyoCursed ❝Your clothes are falling down miss..❞", "@AtorasuZencho ❝Because I don't want to get fat..!❞", "@AtorasuZencho ❝I didn't eat anything all day.❞", "@AtorasuZencho ❝I'm not.. but I'm not eating anything at all..❞", "@AtorasuZencho ❝I don't want to get fat though..❞", "@AtorasuZencho ❝I-I'm sorry.. I guess it was my stomach..❞", "@GenesisChampion ❝Excuse me.. Are you okay or..?❞", "@TheDepravedMagi ❝Huh.. I am the sun and I'm hotter..❞", "@GiantPupper ❝H-Hey, calm down now..~❞", "@GiantPupper ❝H-Huh.. Hello there..~❞", "❝Good evening everyone..~❞", "@BootyDefender ❝Huh.. Nice cosplay..~❞", "@RuinousPrincess ❝R-Rias-san..!!❞", "@BootyDefender ❝G-Good afternoon miss~❞", "@iGyakusetsu Good luck-", "@iGyakusetsu Then play it or watch a playthrough", "@iGyakusetsu It's very good, but the end is friggin bizarre", "@iGyakusetsu Yes", "@iGyakusetsu That's a game called Inside.", "@BoubastisUbasti Staaaares.", "@RuinousPrincess Just watches the show.", "@DaimaoSaramanda ❝It's not supposed to seduce you..❞", "@RushiSeirei « showing that she was really scared of losing her dear friend.", "@RushiSeirei « Please explain what's happening.. What's threatening your life..? I'm worried about you..!❞ \n\nSoon tears formed on her eyes »", "@RushiSeirei Of course she was very worried about the blonde girl. Even more now that she decided to talk with herself.\n\n❝B-Blondie.. »", "@KonoTuyuDa @ZaeemulShams ❝No you're cute.❞", "#SeductiveSunday https://t.co/i4wqq3YNCZ", "@ZaeemulShams @KonoTuyuDa ❝YOU'RE SCARY!❞", "@ZaeemulShams @KonoTuyuDa ❝W-WHO ARE YOU?!❞", "@KonoTuyuDa NO YOU CANT", "@BoubastisUbasti ❝So cute..~❞", "@BoubastisUbasti Pat pats the ears.", "@RushiSeirei ❝Why though?! It's a disease?! G-Go to that old doctor..! S-She can heal you..! O-Or maybe Wendy-san..! J-Just don't die..!❞", "@RushiSeirei ❝W-WHAT?! What are you saying?! D-Don't die Blondie..!! I-I need you!!❞", "@RushiSeirei ❝Huh? I'm not understanding.. How does it depends?❞", "@RushiSeirei ❝Sure Blondie! But.. It's good news or bad news..?❞", "@RushiSeirei ❝Hello there Blondie! I-It's been a while..! How have you been..?~❞", "@RushiSeirei ❝BLOOOOOONDIIIIIIE!!!!❞", "@RuinousPrincess ❝Good morning Rias-san~❞", "@FutsuNaShujinko @FlxreCorona ❝But we are the same.. A fusion between us would only result in an exactly copy of us..❞", "Hears a heart breaking like glass.", "@Alterniad Cute face. But scary woman. Stays away.", "@UltimateFortune ❝You look beautiful the way you are~❞", "@UltimateFortune Pat pats. \n\n❝Don't cry about it Anri-san.❞", "@HiroNoZetsubo (Okay)", "@HiroNoZetsubo ❝It's not imitation.. It can't be imitation when it's the first time I see you miss..❞", "@HiroNoZetsubo ❝Actually.. I just met you.. B-But my hair is very long, so I had to make a hairstyle that would fit it..❞", "@HiroNoZetsubo ❝Okay then miss.. A-And.. Your hair is very beautiful..~❞", "@HiroNoZetsubo ❝O-Okay then.. Forgive me..❞", "@HiroNoZetsubo ❝But why do you think that miss..?❞", "@HiroNoZetsubo ❝Huh..? So.. You're sayin that not having parents is a good thing..?❞", "@HiroNoZetsubo ❝H-Huh.. Then I guess you're not my mom..❞", "❝I-I'm going.. I will be around again later..❞ https://t.co/PGGg19G0Ly", "@HiroNoZetsubo ❝I don't consider myself a worthless trash..!❞", "@HiroNoZetsubo ❝H-Huh.. I.. I don't know..❞", "❝I.. I need to rest.. My head hurts..❞ https://t.co/emhJ5SOJdr", "She didn't know exactly where to go, so she just followed the other girl. https://t.co/pIUp1l5tFT", "@TheFDSlayer ❝I-I'm sorry!! I-I didn't mean to do that!!❞", "❝I-I'm sorry... It was an accident..❞ https://t.co/EohHPJZZgd", "❝YES LETS!!❞ \n\nAnd then she just runs around with Medaka, searching for the chocolate fountain. https://t.co/jNQEne9OxU", "Once again she shook her head slowly, so ashamed that she didn't even look up. https://t.co/Atw3f6fcRX", "@iLyonVastia ❝Candies are good!❞", "@iLyonVastia Shoves ice cream in his mouth.", "@HiroNoZetsubo ❝Are you my mom..?❞", "❝I dislike it.. I saw everyone drinking that.. I didn't know it had alcohol.. And my tolerance for it is very low..❞ https://t.co/WkjuDmqii7", "She slowly shook her head while still embracing her twin. In fact she was embarrassed herself for being like that. https://t.co/iRNMQZQYq2", "❝I caaant help... I didn't know it had alcohol.. That's what happens..!❞ \n\nAnd then she buries her face in the chest of the other and cries. https://t.co/kEPNbEbaUu", "@BootyDefender SAVES", "❝Ouch!! You meanie!!! Why you hate me?!❞ https://t.co/Bf9RBdsNoW", "❝I'm not dippy whatever that means!! Have chocolate!!❞\n\nAnd then she shoves chocolate in the mouth of her twin. https://t.co/ay1PsyLNcN", "@TheFDSlayer ❝I don't want to!!❞ \n\nAnd then she used her hair to punch his face.", "❝Noooo I didn't, you did!❞ https://t.co/7xzdtc0axq", "@RubberySencho (Third one!)", "❝I-I don't drink alcohol!! You drink alcohol you ugly face!❞ https://t.co/k9lrjwAgcO", "❝I DON'T KNOW!!❞ https://t.co/HtDqKx6lB7", "@TheFDSlayer ❝I will not do it!❞", "@ICorruptAll ❝You are drunk!❞", "❝With reason. There's no good in being immortal when you're ugly like an Angler.❞ \n\nhiccups https://t.co/gjXzPWFEWp", "Yells on her ear.\n\n❝CHOCOLATE FOUNTAIN!!❞ https://t.co/J1CMcUxzoq", "@ICorruptAll ❝I'm fiiiiine!❞", "@ICorruptAll And just like expected she fell on her butt.", "@ICorruptAll ❝But I can!!❞", "❝CHOCOLATE FOUNTAIN!!!❞", "@RubberySencho ❝I aaaaam... Medusa! Can't you see my snaaaakes?? Buffy-san eat chocolate too!❞", "@ICorruptAll ❝But lines can't waaaalk!~❞", "@Viseleaux ❝CHOCOLATE!!!❞", "@DivineDoragon ❝Caaaaandies are always taaaaasty!!!❞", "@GambollingFlame (Done!)", "@DivineDoragon Shoves pepper in his mouth.", "@xTheGoldenHind (Nice! I got her in the 10 roll. I wasn't even aware of who she was XD)", "@Viseleaux Shoves chocolate in his mouth.", "@xTheGoldenHind (You got her too??)", "@KonoTuyuDa ❝Candies are aaaaalways good!❞", "@TheFDSlayer ❝It will!❞", "@RubberySencho ❝Haaaaappy neeew year!❞ \n\nAnd then she hugs him tightly.", "@KonoTuyuDa ❝Noooooo problem bear~❞", "@TheFDSlayer ❝Because.. It will hurt.❞", "@TheFDSlayer ❝No! I don't want!❞", "@RubberySencho Shoves meat in his mouth.", "@ICorruptAll ❝I am nooot drunk..!~❞", "@KonoTuyuDa Shoves a chocolate in his mouth.", "@TheFDSlayer ❝You can't force me!❞", "@ICorruptAll ❝Yeeees?❞", "@SlayerOfLaw Tries to put a chocolate in his mouth.", "@SlayerOfLaw ❝Waaaant some candies?? They are soooo good..~❞ \n\nTotally under effect of alcohol yet.", "@TheFDSlayer ❝I will not do that!❞", "❝I'm not drunk... I only drank like.. 4 bottles..~❞", "@TheFDSlayer ❝Your fist is still you though..!❞", "@TheFDSlayer ❝B-But.. I don't want to punch you Natsu-san..❞", "(5 follows please--)", "@TheFDSlayer ❝Huh.. What are you doing Natsu-san..?❞", "@TheFDSlayer ❝Blondie was right when she said you're a little dumb..❞", "@TheFDSlayer ❝Blondie was helping me as well... You even looked at me.. How can you forget this..?❞", "@TheFDSlayer ❝Are... Are you serious..?❞", "@TheFDSlayer ❝I thought you had already forgiven me after the things on my Village..❞", "@TheFDSlayer ❝You look funny wearing  that..~❞", "@Mugiwara_Sencho ❝I-I guess so..~ But I will not take too long to sleep.❞", "@Mugiwara_Sencho ❝I just got in here to be honest..❞", "@Mugiwara_Sencho ❝H-Hey there Luffy-san~❞", "Casually hugs @BootyDefender from behind. Shirtless. And then puts her pajamas again.", "@GiantPupper ❝H-Hey, calm down! Calm down! Happy new year to you too!~❞", "Gets on her pajamas and joins #MVSlumberParty", "❝H-Happy New Year everyone..~ I hope you all have a nice year..!~❞ \n\n#MVNewYear", "Gives the first volume of Bleach to @BootyDefender", "@SaijoNoHaisha ❝T-Then.. I guess it was good..~❞", "@SaijoNoHaisha ❝And.. Is that a good thing..?❞", "@BootyDefender ❝That.. Means you love thighs..?❞", "@SaijoNoHaisha ❝B-But it wasn't a pun.. I-I was just correcting my name..❞", "@SaijoNoHaisha Sobbs because is too innocent to notice the puns.", "@SaijoNoHaisha But it wasn't a pun. Just cries. https://t.co/pRVUlR7loz", "❝I-It wasn't a pun.. I was only correcting you.. S-Sorry..❞ https://t.co/WThtDASdXd", "❝No no, it's Flare! With F!❞ https://t.co/dYf9J0Prjc", "❝Bastit.❞", "Deposits one million jewels in @Viseleaux's bank. That would be 10.000 dollars.", "❝I-I have a ruby card in the Bank of Fiore.. I don't mind giving some money to Steven-san..~❞", "@Viseleaux ❝Steven-san, what have in your fridge?❞", "Wonders why people want to go to Steven's fridge.", "@TwinOfDark ❝You're indeed a little slow Rogue-san.. But that isn't always bad~❞", "@TwinOfDark ❝I already knew that they loved each other~ It was a little obvious to be honest.❞", "@TwinOfDark ❝I was just making sure..~❞", "❝Minerva-sama's fiancée is Erza-san, right?❞", "❝No one talks bad about Minerva-sama's fur coat and gets out alive.❞", "@Viseleaux ❝I love music!~❞", "@Viseleaux ❝Can I get a ticket for the show?❞", "@HonoNoTamashi ❝Don't eat my hair please.❞", "❝Good evening everyone~❞", "@RubberySencho ❝W-Why are you looking at me like that..? Did I say anything wrong..?❞", "@RubberySencho Remember that boobs are also meat.", "@ChildNatsu Slaps him away.\n\n❝No! Bad!!❞", "@SxntaClaus ❝I hope you enjoy it Santa!❞", "Just gives cookies and milk for him. And a bottle of Coke. https://t.co/GkeEU0V2Ou", "Is a model for the brand. Is proud of it. Thanks him a lot for the presents. https://t.co/Z5P9yEqolX", "@SxntaClaus Casual is on the cover of the shampoos.", "❝Someone gave me another idea!❞ \n\nInstead the mistletoe were over her hat. https://t.co/nReYLfMuSr", "@SaigaiNoKami ❝Are you sure about that? I never really heard about a god named Yato.❞", "Tears up and runs away crying. https://t.co/ggZrIqGBcS", "@SaigaiNoKami ❝Ohhhh! You're the selfproclaimed God that do anything for 5 iens!❞", "@SaigaiNoKami ❝T-Thank you..! But.. I-I don't think we have met before..❞", "@ReformedTigress ❝Y-You did?! T-That's amazing..! I love your recipes..! T-Thank you Minerva-sama!!❞ \n\nShe couldn't help but hug Minerva.", "❝H-Huh.. Can I go as well..?❞ https://t.co/kLU40oTSM4", "@ReformedTigress ❝I didn't go there yet, but I'm already thankful!~❞", "@ReformedTigress ❝That's nice to know~ I wouldn't forget about her if course~❞", "@FreezingDoragon ❝To you too Ayumi-san!❞", "❝Merey Christmas to everyone!❞ #MVChristmas", "(Can I have 2300 for Christmas please? 24 away--)", "@ReformedTigress ❝Hope you enjoyed your present Minerva-sama!❞", "@KurokamiHeiress (But now seriously, here XD) https://t.co/XMqXcLwaeR", "@KurokamiHeiress Here you go https://t.co/Xpgytf0KRg", "@SxntaClaus ❝I regret every moment of my life while I was there..❞", "@SxntaClaus ❝R-Really..? I-I mean.. I used to be on the other one when I was in Raven Tail..❞", "@SxntaClaus ❝I-I know you're the real..! I-I meant which one of the lists..? There's two of them..❞", "Leaves a new microphone for @DarkVoltage over his bed.", "@SxntaClaus ❝H-Huh? Which one of them Santa..?❞", "@SxntaClaus ❝I knew you were real!!❞", "❝Why you don't believe me..?!❞ https://t.co/gNHANi7fj1", "❝B-But it's true..!❞ https://t.co/csYjKQYt0l", "Leaves two wrapped gifts over @ReformedTigress's bed. One with a white and black dress and the other with a mouse toy.", "❝W-Well.. That's true b-but.. Doesn't change the fact that I am..❞ https://t.co/rPzfBIgDfE", "❝B-But I am shy..❞ https://t.co/Am3uOM2Ig9", "❝N-Nothing much..! Just.. Just thinking out loud~ Don't mind it!❞ https://t.co/wKAmRFqJS0", "❝I believe in Ste-- I-I mean.. Thank you..!❞ https://t.co/XQ2nSOUJSP", "❝B-But I'm shy..!❞ https://t.co/dQ0GnPZlro", "❝B-Because it will be everyone kissing me on the lips..!❞ https://t.co/yeU5d20e0x", "❝B-But I will get flustered..!❞ https://t.co/4Yn7dcTyyU", "❝T-That is still embarrassing..❞ https://t.co/RMTJjCieRw", "Never really had a mistletoe on her neck. Only asked what could happen. But accepts the sudden mistletoe on her hat anyway. https://t.co/cnpzSEFOx6", "❝Hmm.. So.. What now?❞ https://t.co/IUnXfGmYXA", "@BoubastisUbasti And then somehow she gets a mistletoe.\n\n❝Here you go!~❞", "@FlxreCorona (What you even saying. The way you get follows you will reach 2700 before tonight.)", "@BoubastisUbasti ❝I can get you one!❞", "@BoubastisUbasti ❝It can be.❞", "❝Humpf..! Fine.. Sorry..❞ https://t.co/mrm4Fo6ryB", "❝Pervert..!❞ \n\nSlaps his face. https://t.co/5F4yYRBToj", "❝That.. Would be embarrassing..❞ https://t.co/W71ZzcRjFY", "Already gave magic seeds for a meat tree to Luffy. Have no idea what to give him at all.", "❝If I put a mistletoe around my neck and go around.. Everyone will need to kiss me?❞", "@Viseleaux Gives a present to Dot. A pokémon Egg.", "@YoseiNoMajin Didn't get any gift. Cries internally. \n\nAnd cries externally because Mira is leaving.\n\nJust cries.", "Didn't know that cats could be that hot. Nosebleeds. https://t.co/0y17ONRvyq", "(Which one is better??) https://t.co/oSKzXrQYrK", "❝Another word.❞ https://t.co/gfLInpqTan", "Santa Lily Flare https://t.co/QJh3dZNNzy", "❝You are not real!❞ https://t.co/hsQZMS4Kiw", "Happy Flare noises. https://t.co/TfMpufuleC", "@FatelessKey ❝Can I have a present too?❞", "❝S-Santa.. Isn't real..?❞", "❝I want presents..❞", "@YoseiNoMajin (BAKE ME COOKIES SHWLBEY)", "Wants to be healthy with her help. https://t.co/APD58y0Qqe", "@BoubastisUbasti ❝Do you like.. Catnip?❞", "@BootyDefender Still--", "@BootyDefender Very pure https://t.co/VTQHH1pN26", "@ZeroNoTachi (If you were around you would know that this was a joke.)", "@StrikingLaxus ❝Remedy what? I'm not sick! You're the one that must be sick! You're going insane!❞", "@StrikingLaxus ❝What even is McDonald..? I have no idea what you're talking about.❞", "@StrikingLaxus ❝Huh.. What now..? You don't believe in magic..?❞", "@StrikingLaxus ❝Some.. Blue bird told me about it.❞", "@StrikingLaxus ❝You do that sometimes as well.. Humpf..❞", "@StrikingLaxus ❝They are my friends! Of course I will defend them!❞", "@StrikingLaxus ❝You're the one to blame for even mentioning Erza-san!❞", "@StrikingLaxus ❝You're the one that started all this..!❞", "@StrikingLaxus ❝You make no sense! You're senseless..!❞", "@StrikingLaxus ❝T-That makes no sense..! I'm not a pervert!❞", "@StrikingLaxus ❝What?! How is that perverted?!❞", "@StrikingLaxus ❝It's her present to everyone. A clean place!❞", "@StrikingLaxus ❝Why do you think that..?❞", "@StrikingLaxus ❝It's not hard to clean while using a santa suit..❞", "@Viseleaux ❝You have a big mouth and no eyes.. That means you can smile more and cry less..~❞", "@Viseleaux ❝What do you eat? What exactly are you?❞", "@Viseleaux ❝Huh.. Do you not have eyes..?❞", "@Viseleaux ❝D-Don't bite me too please..❞", "@Viseleaux ❝D-Dot not kill me please..!❞", "@Viseleaux ❝She is scary...❞", "Peak Performance https://t.co/PEOYXuWU4F", "@YokuNoGemu ❝Neither is she, so just keep your mouth shut.❞", "❝Why not..?❞ https://t.co/eIGKEuE55F", "❝Everyone do that once in a while.. Let me live..❞ https://t.co/4qUE6XA6qs", "❝You never give a damn to anything that I say, much less care about my existence, and now you come say that? And it's ecchi, not hentai..❞ https://t.co/EmfN5At5Ua", "@RuinousPrincess ❝You are the best Happy cosplayer Rias-san!~❞", "@RuinousPrincess ❝Then.. I will buy it and put in my collection..~❞", "@RuinousPrincess ❝Does it ship to Sun Village?❞", "@YokuNoGemu ❝You are the weakling.❞", "@RuinousPrincess Is totally hypnotized.", "@AtorasuMusume ❝Huh.. Why.. Are you petting me..?❞", "Nope, selfcest is what is happening in DM I mean what https://t.co/jZr2cMtKeU", "@AtorasuMusume ❝I always have a point..!❞", "@AtorasuMusume ❝It's actually impossible to look at something that is never around..❞", "@TheKokuryu ❝Ew!! You should brush your teeth! Your breath tastes horrible!❞", "@TheKokuryu ❝You are ugly.❞", "@AtorasuMusume ❝T-That.. That isn't true..!❞", "❝Sometimes you like when it happens..~❞ https://t.co/RdyT0WflDh", "@AtorasuMusume ❝B-But i'm not a pervert..! Maybe you are, but I'm not..❞", "@StrikingLaxus ❝You are never around, so you don't really see anything happen..❞", "❝Why don't you just admit that you like that?❞ https://t.co/FtKx0YgvAF", "❝I-I'm not a pervert..!❞ https://t.co/Zvi3n6mIzh", "❝Well, it is Blondie..~❞ https://t.co/x3wHkdCXh3", "@StrikingLaxus ❝I'm always stal-- Huh.. I'm always around her, so I can say that sometimes she had a choice..❞", "❝Isn't a little suspect that it happens all the time Blondie?❞ https://t.co/6KO6xg5NnR", "@StrikingLaxus ❝Even a dragon made her stay naked.❞", "❝Huh.. N-Not at all.. Blondie already got naked in public a lot.❞ https://t.co/BEkFKbgmcp", "❝It's uncountable the times that you stayed naked in public..❞ https://t.co/E3QAcYYLhM", "❝I'm pretty everyone around here already saw you naked at least once.❞ https://t.co/7KNCMABqLh", "❝Blondie.. You can't really say anything. Did you look at your clothes..?❞ https://t.co/MxqPCa6s9H", "❝Huh.. It's very lively here today..❞", "❝If you are not in good terms with Minerva-sama, then yes, you should always worry.❞", "❝Yukino-san is making out with the competition..? How.. Does that work..?❞", "❝I will not participate this time. I don't want to hold anyone back.❞", "@RuinousPrincess Nosebleeds. A lot.", "@BoubastisUbasti ❝Forgive me.. I-I just.. Thought you were a nekomata.. I didn't know you were way more than that..❞", "@BoubastisUbasti ❝I-I'm sorry..! I'm sorry..! I-I didn't mean to let you angry..! F-Forgive my ignorance..!❞", "@BoubastisUbasti ❝I-I meant.. You are half human too.. Right..? Aren't you a nekomata?❞", "@BoubastisUbasti ❝But you're half cat and that's so cute..! I feel like hugging you..!❞", "@BoubastisUbasti ❝You are so cute..!❞", "@StrikingLaxus (And I said that on the wrong account lol)", "❝Because you like her~❞ https://t.co/xXpQUKr2Hk", "❝But I'm already considering it as yes~❞ https://t.co/c3AyDD4lRi", "@KurokamiHeiress ❝I-If you want, then I don't mind going..~❞", "@KumoNoYokai ❝M-Men?! You eat guys?! T-That's..! Scary..!❞", "❝I will consider that as a yes then~❞ https://t.co/EGNbNQtzcy", "@AlluringScarlet (That's fine by me! But could you follow so we can plan it on DM?)", "@AlluringScarlet (Do you still wanna plan that RP??)", "❝But do you like her Gray-san?❞ https://t.co/GS0PeKoDe5", "@KumoNoYokai ❝I'm.. I'm Flare. Flare Corona. It's nice to meet you..~ And.. You will not bite me right..?❞", "@HiroNoZetsubo ❝I'm confused.. You are or not my mother..?❞", "@HiroNoZetsubo ❝H-Huh.. I.. What affairs..?❞", "❝What about Juvia-san?❞ https://t.co/fYr0LwKB2h", "@KumoNoYokai ❝N-Not at all.. It's just.. I'm not so much of a fan of spiders.. F-Forgive me..❞", "@KurokamiHeiress ❝You are right about that.. Huh.. Why don't we go then..?~❞", "@HiroNoZetsubo ❝Huh.. Are you my mother as well..?❞", "❝So everyone annoys you..?❞ https://t.co/1HitEfknYw", "@KurokamiHeiress ❝Why don't you go to one then Medaka-san?❞", "@KumoNoYokai ❝A-A spider..? R-Really..? Huh.. T-That's.. That's nice m-miss..!❞", "@MagistMercurial ❝And your hair is very beautiful as well..~❞", "❝B-But.. You yelled at me..❞ https://t.co/9oKEz55MXX", "@MagistMercurial ❝Miss.. You have a cool hat.❞", "@KumoNoYokai ❝Huh..? So.. You're not a human? Yokais are like.. Huh.. That girls with cat ears?❞", "@KumoNoYokai ❝Yokai..? What is this miss? If you don't mind me asking..❞", "@KurokamiHeiress ❝H-Hai..! I will remember that Medaka-san..! A spa is really relaxing..~❞", "@KurokamiHeiress ❝I always enjoy~ It's my home and my family after all~❞", "@KumoNoYokai ❝W-Wait.. Why are you crying now?? W-What's the matter..❞", "@KurokamiHeiress ❝I-I guess so.. I have been away.. I went to my village to throw away the stress, but now I'm back..~❞", "@KumoNoYokai ❝C-Calm down miss..❞", "@KurokamiHeiress ❝H-Hello Medaka-san..~ It's nice to see you..!❞", "@KurokamiHeiress Casually hugs tightly.", "❝B-Because.. Because I annoyed you..?❞ https://t.co/8Pt8l8QEzX", "❝I-I'm sorry..! D-Don't hurt me please..!❞ https://t.co/2zMuxZFfsZ", "❝Why did you even call me that?❞ https://t.co/D2gcKBhckl", "❝Thank you, but I'm not psycho..!❞ https://t.co/v18bJv2GBR", "❝I'm doing better..~ Just.. Went to stay some time in Sun Village. To throw away the stress and all.❞ https://t.co/7k6ZP4lUYc", "❝I'm not a psycho!❞ https://t.co/iQ1vK81ey1", "@AlluringScarlet (Hey! It's me @FlareIRL!)", "❝I'm sorry, but I'm here to stay..~❞ https://t.co/lAcHIlThDV", "❝T-Thank you Yukino-san..!❞ https://t.co/W9s7WKWAwX", "❝Hello everyone..~ I-I'm back..~ It's good to see you all again~❞", "@ZennoNoJoou ❝If I am right it's a battle where you use your butt to push the opponent off the platform.❞", "Totally wants to watch this. https://t.co/BOoQbZEqHa", "@RuinousPrincess Waits patiently for the class of how to be amazing.", "#SeductiveSunday https://t.co/Mc3FuVuntG", "@SwarmOfChakra Is confused.", "❝I-I don't think it's a good idea Medaka-san..❞ https://t.co/j4QlOtRVMq", "@SirMeIiodafu (I only have 86 smh--)", "@SirMeIiodafu Shit, I already follow your Meliodas on all my accounts-", "@SirMeIiodafu (Just a min)", "@RuinousPrincess (And I am confused)", "❝Y-Yes.. This things..❞ https://t.co/HEaign3PT0", "❝I made a new friend today..~ Robin-san~ She is a little weird but.. She seems to be a nice person~❞", "@KeysOfTheEast A gulp went down her throat and an awkward smile formed on her lips after the girl said that.\n\n❝H-Hai Robin-san..~❞", "@KeysOfTheEast ❝I-I.. I just heard that it need to be like that when this is over the people.. S-So.. I-I only did it..❞", "@KeysOfTheEast « giving a fast kiss on the lips of the girl before covering her face again.\n\n❝T-There..❞", "@KeysOfTheEast « what the girl was talking about. She had no idea of what to do, but by instinct she did what she wanted before »", "@KeysOfTheEast She slowly uncovered her eyes to look toward the girl.\n\n❝H-Huh..? What you me--❞\n\nShe then looked up, finally seeing »", "@KeysOfTheEast « situation only getting worse for her.", "@KeysOfTheEast ❝I-I didn't say that..! I-I was just confused..! I-I..! I will just shut up..!❞ \n\nShe continued covering her face. The »", "@KeysOfTheEast « more embarrassed.", "@KeysOfTheEast « the mouth..? N-Not that I want to..! I-I just..! Huh..! I don't know..!❞\n\nWith that she covered her face, staying even »", "@KeysOfTheEast A  weak blush appeared on her cheeks after that. Of course she was surprised.\n\n❝H-Huh.. I.. I thought it needed to be on »", "@KeysOfTheEast ❝I-I see.. It's nice to meet you I guess..~ And well.. You already know my name..~ But you scared me..❞", "@KeysOfTheEast ❝G-GAHH!! W-WHO ARE YOU?!❞", "@xBiriZaKiddo ❝I meant that Mistletoe thing.. And who are you..?❞", "@GiantPupper Isn't under him so she doesn't need to do so. Besides that isn't her dog.", "❝W-Wait.. It's time for that things that if two people are under it they need to kiss..? Again..?❞", "@Viseleaux Doesn't trigger Flare tho.", "@Viseleaux Steven likes to trigger people.", "@GiantPupper ❝You should return to your owner or he or she will get worried.❞", "@GiantPupper ❝T-That's not my dog.. Huh.. I guess I made a mistake..❞", "@HarrowMaiden ❝Huh..? Do I know you..?❞", "@Viseleaux Casually enters his house and pulls the dog away from there.\n\n❝Sorry, I kind of lost him Steven-san.❞", "@EIizadeath (You can totally count with me on that! I'll be here for whatever you need, and knowing myself, I'll make an account of one XD)", "#MVThanksgiving \n\n❝How are you so sure about that..?❞ https://t.co/v4RpvZGt6x", "#MVThanksgiving \n\n@xTheWrench ❝I-It's not a matter of having enough for everyone or not.. I just.. Don't want to get fat..❞", "#MVThanksgiving \n\n❝B-But.. I don't want to get fat..❞ https://t.co/l8jhY6WUr6", "#MVThanksgiving \n\nThat sure surprised her but she had to swallow the cookie.\n\n❝I-I don't..! I need to lose weight..!❞ https://t.co/vFTWBVUtGK", "#MVThanksgiving \n\nWill really not eat anything. Even though she is hungry.", "#MVThanksgiving \n\n❝I-It's all good..~ I need to lose weight s-so.. I will not really eat anything..~❞", "#MVThanksgiving \n\n❝H-Huh.. Hello..? Can I come in..?❞", "@RuinousPrincess ❝W-What do you mean Rias-san..?❞", "@RuinousPrincess ❝H-How do you get to stay around so many beautiful girls..?❞", "@iLyonVastia Feels the hate.", "@iLyonVastia ❝Don't unfollow me icebutt-san..❞", "❝Oh no.. Steven-san is using the extreme headpat...❞", "@FlamingEntity ❝And what will you do as president?❞", "@FlamingEntity ❝Who even are you?❞", "❝Who even is this guy that is our president?❞", "❝Luffy-san sometimes is so mean..❞", "@RubberySencho ❝I-I'm not fat..!❞", "@RubberySencho ❝Vegans everywhere..❞\n\nShakes the head.", "@TheHakuryu ❝Yes it is Sting-san!❞", "@TheHakuryu ❝It's.. Nice to see you again Sting-san..~❞", "@RuinousPrincess ❝Have you been exhausting yourself..? That's not good you know..?❞", "@RuinousPrincess ❝You should sleep Rias-san.❞", "@RaijinYaju @iLyonVastia Doesn't even know what to say. Just walks away silently.", "@RaijinYaju @iLyonVastia Is afraid of the \"yet\".", "@RaijinYaju @iLyonVastia Feels happy that for the first time he is being nice with her.", "Much better now. https://t.co/Ot4XK7eT1u", "Cleans @iLyonVastia's ashes with a broom and throws in a bucket.", "@BootyDefender ❝You could buy that gloves that comes with claws~❞", "@BootyDefender ❝But.. If they are food, then they will break easily. It will not work as claws..❞", "@BootyDefender ❝And.. Why you have them on your fingers?❞", "@BootyDefender ❝What's that things in your fingers?❞", "@TerminusOrtem ❝I-I'm Flare..~ Nice to meet you too Cloud-san~❞", "❝Good evening everyone..~❞", "@AspectOfIce @iLyonVastia ❝Are you calling me that, or him..?❞", "@Dobengal ❝I guess we can go then~❞", "@AspectOfIce ❝That's not a lie..❞", "@AspectOfIce ❝I don't know what to say..!❞", "@Dobengal ❝Huh.. Since we will only work there, I guess it's not a problem if we don't know the owner of the party right?❞", "❝I'm not going anywhere..❞ https://t.co/CWK3OvpGzY", "@AspectOfIce ❝Huh.. You.. You are cool?❞", "❝No, I meant that you are jealous of me. You don't want me to flatter him because you want to do it yourself.❞ https://t.co/JamPFY2Kax", "❝Someone is jealous.❞ https://t.co/5ee0I24bf0", "@Dobengal ❝Birthday party? Of who? And sure~ It seems a nice event!❞", "@iLyonVastia ❝That's.. Cool.. I mean, it's interesting..!❞", "@TerminusOrtem ❝H-Huh.. Hi..~ I'm sorry, I don't think I know you..❞", "❝Good evening..~❞", "@iLyonVastia ❝Can you cool other people too?❞", "@UnversedGod ❝I just don't want to make her hate me even more.. It's better to let it how it is now..❞", "❝If Luffy-san chose her to be his navigator, then I know she is an amazing and good person, doesn't matter if she like me or not..~❞", "@UnversedGod « her by asking what it is..❞", "@UnversedGod ❝There's no reason for such thing.. She is a nice person.. S-She must have a reason to hate me, a-and I don't want to bother »", "@UnversedGod ❝I-I don't know why she hate me.. I-I honestly did nothing wrong to her.. I-I mean.. I just met her in person..❞", "@UnversedGod Will need a lot of hugs.", "@Viseleaux ❝Even like that you're very small compared with the people in my village..~❞", "Already left the ball cause was told to kill herself. https://t.co/pq8v64Clu4", "Just turns around and goes away from the ball. https://t.co/aboyATrcvx", "(Sometimes I don't know if the person really hates the character or not ;~; help--)", "@Viseleaux ❝Why are you so tall?❞", "@KurokamiHeiress ❝W-We can..? Are you sure..? You promise this..?❞", "@KurokamiHeiress And then a pout formed on her face and her eyes got teary.\n\n❝B-But.. But it was my favorite pair of shoes..❞", "@KurokamiHeiress ❝E-Ehh??! H-How this happened?! My shoes disappeared..!❞", "❝Where are the desserts?❞ \n\n#MVBall", "@KurokamiHeiress ❝It's just a little hard to dance with my shoes, but it's cool~❞", "@ZennoNoJoou (Good night Arty!)", "@KurokamiHeiress ❝I-It's not so hard..! And it's funny! I'm enjoying it Medaka-san!~❞", "@Viseleaux ❝Why are you so tall?❞", "@KurokamiHeiress Of course she was having some difficult in the start, but then she was getting used to it and enjoying the dance.\n\n#MVBall", "❝Gil-san always so cold..❞\n\n#MVBall", "@KurokamiHeiress ❝But you learn anything in a second, it's not hard for you Medaka-san..!❞\n\nJust tries to follows her movements.", "@KurokamiHeiress Can't fight at all and just accepts it.\n\n❝O-Okay then, but I don't know how to dance Medaka-san..❞", "❝I can't sing at all..❞\n\nActually can, but is too shy.\n\n#MVBall", "@KurokamiHeiress ❝A-AH!! M-Medaka-san! C-Calm down..!❞ \n\nToo much weaker than Medaka to pull back.\n\n#MVBall", "@OriginalGogeta ❝B-But I don't know so much people around..❞", "@OriginalGogeta ❝Mingle..? What does that mean?❞", "@OriginalGogeta ❝Since when you call me chan..? A-And nothing much..! Just.. Looking everything..~❞", "@OriginalGogeta ❝H-Huh..! Hello..!❞", "#MVBall \n\nDoesn't even know what is happening and just stays on the corner like. https://t.co/tVUEpbZbdA", "#MVBall \n\n❝I-I'm not..? That's great..!❞", "#MVBall \n\n❝But I guess I'm late..❞", "#MVBall \n\n❝I'm here..~❞ https://t.co/avtfppwELG", "@RubberySencho (Like, from any verse or only OP??)", "@iLyonVastia ❝I'm sure you can't handle high temperatures though..❞", "@iLyonVastia ❝No, you need to.❞", "@iLyonVastia ❝This isn't hot..! This is cold..!❞", "@iLyonVastia ❝But it isn't that hot at all right now.. Right..?❞", "@iLyonVastia ❝Well.. But you love him.❞", "@iLyonVastia ❝In public it is..❞", "@iLyonVastia ❝Why do you love Gray-san so much?❞", "@iLyonVastia ❝This is so weird..❞", "@iLyonVastia (Explain Invel-)", "@iLyonVastia ❝And apparently like you..❞", "@iLyonVastia ❝She.. Gets naked everytime..?❞", "@Viseleaux ❝He is docile so don't worry about bites~ But be careful if he lick you, you might get stuck in his tongue..❞", "@iLyonVastia ❝This.. Huh.. At least you're a guy..❞", "@Viseleaux « later.. I was just missing him..~ He is beautiful don't you think Steven-san??❞", "@Viseleaux ❝I brought him from my village~ But he can't stay too long because he is too big to the cities. I will need to take him back »", "@iLyonVastia ❝Why are you doing this..?❞", "@Viseleaux And then some dog drool started falling near him. \n\n❝Just look up!❞ https://t.co/oCHXRUNvgm", "@Viseleaux ❝Steven-san! My pet is here!❞", "(BLOCKS) https://t.co/BXgX345Fio", "@InfernoKaso (Hardy tho-)", "@YoseiNoMajin (At least it wasn't this-) https://t.co/RpMRdtqRb6", "@YoseiNoMajin (That one of you stalking everyone is your first one.)", "https://t.co/a6C7MR0xAT", "@iRedNightmare « she said before falling on the ground passed out.", "@iRedNightmare « started falling from her eyes before finally spilling out some words.\n\n❝E-Erza-san... W-Why..?❞\n\nThat was everything »", "@iRedNightmare « other redhead and slowly stepped back to remove the sword. Once it was out she placed her hands on the hole and tears »", "@iRedNightmare « completely through her side, making her blood flow down on her dress and on to the ground. She then looked up at the »", "@iRedNightmare Her eyes widened with the sudden impalement. She coughed some blood and then slowly looked down seeing the sword »", "I haven't sworn on Twitter at all.  \n\n❝I-I guess I will get presents from Santa again..~❞ \n\nhttps://t.co/CwhguFKhrX", "(Evilza gonna hurt poor Flare I cry)", "@Viseleaux « able to take care of it..❞", "@Viseleaux ❝I see.. I don't have any pet, so.. It's very lonely at home. I really would like to have one, but I don't think I would be »", "@iRedNightmare With a smile on her face she just embraced the girl as well.\n\n❝It's red of course Erza-san!~❞", "@Viseleaux ❝Where can I get one Steven-san?❞", "@iRedNightmare ❝Yes please..~ I would love a cuddle..!❞", "@iRedNightmare ❝Always make we wait for something that you could do now..❞", "@Viseleaux ❝Where's... The eyes..?❞", "@iRedNightmare ❝Erza-san, why you always do that..?❞", "❝Who is Dot?❞", "@YoseiNoMajin ❝Teach me please Mira-sensei.❞", "@Astralizaton ❝And who would you be little girl?~❞", "@iRedNightmare ❝But.. What if I don't win..?❞", "RT @NullCausality: #MVEarthPrez\n\nRead: https://t.co/S9BjmMA1hP", "@iRedNightmare Seems so comfy. Wants to cuddle so much.", "@MVVote2016 ❝Me too!! Flare for president!❞", "Actually threw it with her hair. https://t.co/EMzgYXpzZD", "❝See?? A golden beetle is cool!❞ https://t.co/3CA2Q8yQPO", "❝Take this with you..!❞\n\nThrows a shampoo at him. https://t.co/QbJU1TPLsM", "❝Who wouldn't get distracted by a golden beetle?? It's golden!❞ https://t.co/Fnd86CTUCK", "@lncarnatedEvil ❝H-Huh.. H-Hello again.. I.. I need to get going now. Huh.. Excuse me..❞\n\nShe then turned around and slowly started walking.", "@Viseleaux « at him with a smile.\n\n❝I don't regret it though..~ Sometimes it's good to do something different..~❞", "@Viseleaux « moment she looked away feeling as little embarrassed for saying that she did a sensual photoshot, but then she looked »", "@Viseleaux « on the kind of photos, a-and.. Since I did.. Huh.. A more.. Revealing one lately.. The return was very good..❞ \n\nFor a »", "@Viseleaux « the part of photos. Once in a while I'm invited to do these photoshots, and what they pay to do so is very good~ It depends »", "@Viseleaux ❝W-Well.. Sorcerer Magazine is the magazine of mages of Fiore. It have interviews, rankings and things like that. And also »", "❝But you said I got distracted by the beetle.. How I got distracted by it if there's no beetle around?❞ https://t.co/LYMiw0VsdB", "❝You should destroy your louses first.. But for that you need shampoo and conditioner.❞ https://t.co/0MEiHgMpr9", "@xTheGoldenHind (Aimu alreadu forouingu yu!)", "❝I've been distracted by a beetle..? What beetle?? I don't remember..!❞ https://t.co/GfTmCRAVuA", "@xTheGoldenHind (BANINGU RABUUUUUU)", "❝Do you even wash your hair?? Or are you like a monkey that only takes a shower once a week?❞ https://t.co/igJu5tKc3z", "❝But now i'm curious about the golden beetle..❞ https://t.co/np1cmrStm7", "❝I mean, your head looks like a pineapple because of your hair..❞ https://t.co/Fb4uqE0I9T", "❝Maybe you don't, but I do.❞ https://t.co/JdGHgYK5pe", "❝Golden Beetle..?❞ https://t.co/azivgk5nwb", "❝Hair treatment products for everyone! And you really need it..❞ https://t.co/cMjc61JzHm", "Flare for President", "(Rip Shellder- I mean Shelbey)", "❝N-No! I would be a good president..!❞ https://t.co/DfAr8svtZj", "@RuinousPrincess Once president always president. Buchō~", "@RuinousPrincess Rias is already president.", "❝I-I don't think it would be that bad..❞ https://t.co/m56W880FaL", "❝W-Why not?!❞ https://t.co/aSg14Db9zy", "❝What about me as president??❞", "❝Luffy-san as president..? We would have a lot of meat to eat.❞", "@SavageKakarot @lncarnatedEvil ❝W-Wait! Don't leave me with him..!❞", "@SavageKakarot ❝D-Don't mention him..❞", "@SavageKakarot ❝But i'm not anymore..!❞", "@SavageKakarot ❝I will not.. I'm not a bad person anymore..❞", "@SavageKakarot ❝Even the most beautiful rose has it's thorns..❞", "@SavageKakarot ❝I'm not food as well!❞", "@SavageKakarot ❝I'm not a piece of chess.❞", "@SavageKakarot ❝I only asked.. What would it be..?❞", "@SavageKakarot ❝A massage on the feet?❞", "@SavageKakarot ❝What if I do it so good that you don't kill them?❞", "❝I am so confused..❞", "@SavageKakarot ❝But I don't want Luffy-san and Gil-san to die... Neither Rias-san to be raped..❞", "❝I thought Rias-san was the president.❞", "@SavageKakarot ❝And what about me..?❞", "@RuinousPrincess ❝What about cuddles??❞", "@RubberySencho (What did I do? ._.)", "@Viseleaux ❝Pat me please.❞", "@Viseleaux (Take your time In being serious!)", "@ZennoNoJoou (Take your time- I still have replied to do, so no rush &gt;.&gt;)", "@ZennoNoJoou (I'm glad I finally managed to do mine-)", "@UltimateFortune ❝Go to sleep. Now.❞", "@BurakkuGoku @OriginalGogeta (No you're illusion 1)", "@UltimateFortune ❝You really should if you're tired.❞", "@OriginalGogeta (I do exist. Everywhere. Everytime.)", "@OriginalGogeta (Neither are neither. They are both illusions from your mind.)", "@UltimateFortune ❝Then sleep Anri-san..~❞", "@YoseiNoMajin Sorry not sorry. https://t.co/XlWbnPRBTF", "@ReformedTigress « normal again, but sweating a lot... I-Is this normal..? This sudden pleasure..? Or there's anything wrong with me..?❞", "@ReformedTigress « never felt so much... Pleasure like that before... I even passed out because of that.. When I woke up I was »", "@ReformedTigress ❝S-So.. Huh.. Some days ago, out of nowhere.. My body got so hot.. Hot in that way.. I couldn't handle at all, I »", "@UltimateFortune ❝Good to know~ your hair is very beautiful, so it deserves a good treatment everyday~❞", "@UltimateFortune ❝Just a little present~ Take good care of your hair! Don't let it die!~❞", "Just gives a hair treatment kit to @UltimateFortune because she finds her hair very beautiful.", "@Viseleaux « not lock myself in my home and stay searching what to do while there's uncountable choices out there..!~❞", "@Viseleaux « out there while I still can.. Meet new people, learn new things, visit new places..! I'm a free person now, so I will »", "@Viseleaux « I will be able to make a travel to these places!~ I love my home, but I want to get out a little.. Explore this vast world »", "@Viseleaux ❝Well, I'm getting a lot of money from the Photo Shoots of the Sorcerer Magazine, s-so maybe if I save some of it »", "@ZennoNoJoou « she did anyway. Gilgamesh was a strong person, so maybe she had any secret of training that she could share with the redhead.", "@ZennoNoJoou « Do you have any suggestion of what could I do in my trainings to improve?❞ \n\nShe wasn't sure if she should ask that, but »", "@ZennoNoJoou « Maybe I reached my limit? I don't know.. I'm just not sure of what to do to improve myself anymore Gil-san.. Do you.. »", "@ZennoNoJoou « matter what techniques I create, I always lose my battles.. I can't even remember the last time that ai actually won.. »", "@ZennoNoJoou « But soon the smile faded and she looked away, feeling ashamed of herself. \n\n❝H-Huh.. Yes.. I'm trying to.. But doesn't »", "@ZennoNoJoou « against her..~ I hope you get the chance soon! I'm sure you both will enjoy!~❞\n\nA smile formed on her lips after saying »", "@FutureRogue ❝Yes you can! Bye!❞\n\nAnd then she just turns around and walks away, making him disappear. At least from her sight.", "@ZennoNoJoou ❝I know you're strong, but you shouldn't underestimate her as well Gil-san. You might get surprised when you fight »", "@FutureRogue ❝You're wrong! Now disappear already!❞", "@FutureRogue ❝You don't have time for anything anymore. Soon you will disappear, because Rogue-sam will never become you!❞", "@FutureRogue ❝No you don't.. You are idiot..❞", "@FutureRogue ❝I'm not a man.. I'm a woman. And no, I will not prove to you.❞", "@FutureRogue ❝You are a man..❞", "@Viseleaux ❝Just kidding..~❞ https://t.co/Y0iKGulQlV", "@ReformedTigress ❝I-I.. Wanted to talk with you about something..❞", "@Viseleaux ❝It's not my fault that I suffered a big accident and had to cover all my body with bandages...❞", "@Dobengal ❝Sure~ I guess it will be fun! But what event exactly we will work on?❞", "@ImpulsiaHarto ❝You're not a mage? And how will you do this then?❞", "@ImpulsiaHarto ❝Teleportation magic? You're a mage as well?❞ \n\nShe asked in curiosity, but already making her way toward her house.", "@AtorasuMusume ❝Well, I have nothing to do at the moment, so I guess we could~❞", "@Dobengal ❝O-Oh! I understood now! Well, I never really worked as waitress, so I can't really know if I'm good doing so.❞", "@AtorasuMusume ❝Just relax and think about good things..~ It always work~❞", "@ImpulsiaHarto ❝How will you bring one if you're going with me to my house? I mean.. How would you get one out of nowhere?❞", "@Dobengal ❝I'm very patient~ But what job did you get?❞", "@AtorasuMusume ❝You should stop worrying about people that doesn't make you feel comfortable.. It will only leave you stressed..❞", "@Dobengal ❝But don't worry..~ We can do it at home~❞", "@AtorasuMusume ❝Don't worry, he will disappear sooner or later, because Rogue-san will never become him!❞", "@ImpulsiaHarto « visits in her house were something that she really loved, even though she didn't get too much of them.", "@ImpulsiaHarto « a problem to make a visit~❞\n\nA smile formed on her lips. Maybe she was a little hesitant to really invite him, but »", "@ImpulsiaHarto ❝H-Huh.. What.. What is a television..? I don't think I have ever seen one before.. And well.. I guess it wouldn't be »", "@iFuriza ❝Yes..❞", "@AtorasuMusume ❝He is just jealous of your hair..! Don't let him put you down! Just ignore him!❞", "@Dobengal Zips his pants back.\n\n❝This isn't the right place to do this...❞", "@iFuriza ❝Looks like you were drawn by a five years old boy.❞", "@AtorasuMusume ❝What did he say to you? If you don't mind me asking of course.❞", "@ImpulsiaHarto « very good to pass time!❞", "@ImpulsiaHarto ❝A Screen Lacrima is a big lacrima that you can use to watch movies, shows and even play if you have a game lacrima~ It's »", "@AtorasuMusume ❝If you lie to the others, you will only lie to yourself, and this will not be good for you..❞", "@ImpulsiaHarto « watching the Screen Lacrima, taking care of my hair, cooking or sleeping.❞", "@ImpulsiaHarto ❝I-I.. I guess you can say I am.. And not at all..! I really don't mind saying..~ Well, at home I pretty much only stay »", "@ImpulsiaHarto « N-Nothing really happened..❞", "@ImpulsiaHarto ❝G-Good I guess.. I didn't do much today. I had to go to the Sorcerer Magazine for a photo shoot, and then I went home. »", "@AtorasuMusume « same person.. Don't be a coward, admit your mistakes..❞", "@AtorasuMusume « Asuka-san.. And in the last moment you left Obra cancel Kinpatsu's magic.. I know that because we are the »", "@AtorasuMusume ❝Why can't you admit your mistakes..? You were threatening Kinpatsu.. Saying that if she did anything you would kill »", "@ImpulsiaHarto ❝I-I'm.. I'm Flare Corona.. Nice to meet you too.❞\n\nShe then hesitantly lifted her hand to shake his hand.", "@ImpulsiaHarto ❝Amd how would you do that..?❞", "@Viseleaux ❝Yes Steven-san? There's anything wrong??❞", "@IncompleteLoser « A-And I don't want my mind to blow.. I don't want to die like that..❞", "@IncompleteLoser ❝I-It's not easy to stop.. I'm shy so.. T-That's normal for me.. And yes, I do know Medaka-san..~ She is a great friend~ »", "@UltimateFortune @Viseleaux ❝W-Why everyone is staring at me like that...?❞ https://t.co/ATyOAR3S6T", "@BuririantoHono ❝It was grilled salmon!❞", "@Viseleaux @UltimateFortune ❝I don't know what I did wrong..❞ \n\nLets herself be patted.", "@BuririantoHono ❝Her food isn't bad.. At least I liked it..❞", "@Viseleaux @UltimateFortune ❝What did I do..?❞", "@UltimateFortune ❝Or.. Maybe.. Huh.. No, that's all I can think..❞", "@BuririantoHono ❝What's wrong about Kinpatsu's food? I liked it when tasted it..❞", "@UltimateFortune ❝Maybr it's everyone's mating season. Or maybe it was that weird magic that made everyone stay horny..❞", "@BuririantoHono ❝H-Huh.. Did you eat anything that wasn't good..? Or were you in a transport..?❞", "@ReformedTigress ❝Minerva-sama..? Are you around..?❞", "@BuririantoHono ❝What's the matter Natsu-san?❞", "@SwirlyBrow « as well, I will not lie about this..❞", "@SwirlyBrow ❝I-I don't mean to offend you Sanji-san.. But sometimes you are. But isn't that normal for people..? I'm a pervert sometimes »", "@SwirlyBrow ❝But... Why do that with him when you also are a pervert sometimes..?❞", "@ImpulsiaHarto ❝I try to.. But it's too hard.. I don't know how to do this..❞", "@SwirlyBrow ❝The funny bones-san??❞", "@ImpulsiaHarto ❝And what I'm supposed to do..? That's how the things are for me..❞", "@SwirlyBrow ❝But what you said was scary Sanji-san..❞", "@ImpulsiaHarto ❝In a way.. Yes.. B-But I'm already getting use to it..❞", "@SwirlyBrow Just steps back afraid of him.", "@IncompleteLoser ❝H-Huh.. H-Hai.. I'm Flare.. And who are you..? And verse..? I'm.. Not really sure I understood what you meant..❞", "RT @RubberySencho: #MVHalloween\n\nRead: https://t.co/IInH9CHb7W https://t.co/aDUqHUT81j", "@RubberySencho ❝C-Can I go as well Luffy-san..?❞", "@Kagefusa ❝Cover yourself miss...❞", "❝Sometimes I just feel that i'm not in the right place...❞", "@SterlingDrift ❝Then... Explain this!❞\n\nAnd then she lifts a photo to the girl. https://t.co/1gjyYmn1cB", "@SterlingDrift ❝I know that you're a dog too.❞", "@SterlingDrift ❝I know your secret.❞", "Just hugs tightly. https://t.co/83v1EBfWjv", "@Aidoukou It would be worthy anyway.", "Fights the urge to hug @Aidoukou.", "❝Good morning everyone..~❞", "@TheEndMode ❝I missed you so much!! Where have you been?!❞", "@TheEndMode Casually hugs tightly.\n\n❝Medaka-san! You're back!❞", "❝I'm sorry for losing people.. I disappointed you all..❞", "Cuddles with @RuinousPrincess to try to make her sleep.", "@OriginalGogeta @lncarnatedEvil Ends up bumping on him and falls on her butt.\n\n❝Ouch..❞", "@lncarnatedEvil And then runs away.", "@lncarnatedEvil Sticks the tongue at him.", "@ChemeiMeiji ❝A nap would be great..!~ I'm a little tired because of the fight so.. I would love to!❞", "『Invisible Enemy』\n\nRead: https://t.co/IgF36JjZRd\n\n@SoulScion", "@RuinousPrincess Is totally gay for Rias.", "@iLyonVastia « what I have in Bank.❞", "@iLyonVastia ❝No? They invited me to do an edition.. I only accepted. Besides that what I will get from doing it isn't even a little of »", "@iLyonVastia ❝Yes I do~ I get 40% of every magazine sold~❞", "@iLyonVastia ❝More money for me..~❞", "Wrapped Fire\n\nRead: https://t.co/FKBnWIUkD4\n\n@SoulScion", "@iLyonVastia ❝I only have access to the covers..! The rest only in the magazine..!❞", "But being the only one then he will be the number one- https://t.co/U2bUK09FTN", "Will be her only fan tbh https://t.co/smFvVY2poO", "Pretty sure he will ask an autograph. https://t.co/9O8QuIPr5z", "Is rich but doesn't tell anyone. https://t.co/UZk9fKQQMi", "Will live in a mansion after this. https://t.co/9aKS0tiuVh", "And it contains 3D photos. Everyone is happy. https://t.co/iAlfgphHWr", "Neither she since she gets a good percentage of the price. Rich Flare is Rich. https://t.co/JKnlV9KM1x", "Well stay rich because of it. https://t.co/7xJAe90KzN", "@iLyonVastia ❝H-Hey..! That's mine..! Give it back!!❞", "@SoulScion (Yoi can of you want! I will only be able to be here at night, so you could start already to make things faster!)", "@FukushuMeiden ❝Y-You were offering it.. And you had a spoon on your hand.. I-I thought it was food.. O-Ouch..❞", "@FukushuMeiden ❝T-This isn't good to eat.. It's too hard..❞", "@Dobengal ❝It will be my best one..! You will see..!~❞", "@FukushuMeiden ❝My.. Teeth hurts..❞"], "description": "⊰【 Flare Corona 】⊱ ❝Eclipses doesn’t make the light of the Sun go away. Once they fade, the Sun shines once again, brighter than before.❞", "location": "⊰ Sun Village ⊱", "lang": null, "friends_count": 518, "entities": {"description": {"urls": []}}}